camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* PRR0 - Power reduction Register 0 */
#define    PRSPI           0       /* Power Reduction Serial Peripheral Interface */
#define    BM_PRSPI	(uint8_t)(1U<<PRSPI)
#define    PRR0_R1         1       /*  */
#define    BM_PRR0_R1	(uint8_t)(1U<<PRR0_R1)
#define    PRTXDC          2       /* Power Reduction Transmit DSP Control */
#define    BM_PRTXDC	(uint8_t)(1U<<PRTXDC)
#define    PRCRC           3       /* Power Reduction CRC */
#define    BM_PRCRC	(uint8_t)(1U<<PRCRC)
#define    PRVM            4       /* Power Reduction Voltage Monitor */
#define    BM_PRVM	(uint8_t)(1U<<PRVM)
#define    PRCO            5       /* Power Reduction Clock Output */
#define    BM_PRCO	(uint8_t)(1U<<PRCO)
#define    PRCU            6       /* Power Reduction Crypto Unit */
#define    BM_PRCU	(uint8_t)(1U<<PRCU)
#define    PRTWI           7       /* Power Reduction Two Wire Interface */
#define    BM_PRTWI	(uint8_t)(1U<<PRTWI)

/* PRR1 - Power reduction Register 1 */
#define    PRT1            0       /* Power Reduction Timer 1 */
#define    BM_PRT1	(uint8_t)(1U<<PRT1)
#define    PRT2            1       /* Power Reduction Timer 2 */
#define    BM_PRT2	(uint8_t)(1U<<PRT2)
#define    PRT3            2       /* Power Reduction Timer 3 */
#define    BM_PRT3	(uint8_t)(1U<<PRT3)
#define    PRT4            3       /* Power Reduction Timer 4 */
#define    BM_PRT4	(uint8_t)(1U<<PRT4)
#define    PRT5            4       /* Power Reduction Timer 5 */
#define    BM_PRT5	(uint8_t)(1U<<PRT5)
#define    PRLFR           5       /* Power Reduction LF Receiver */
#define    BM_PRLFR	(uint8_t)(1U<<PRLFR)
#define    PRCI            6       /* Power Reduction Contactless Interface */
#define    BM_PRCI	(uint8_t)(1U<<PRCI)

/* PRR2 - Power reduction register 2 */
#define    PRR2_R0         0       /*  */
#define    BM_PRR2_R0	(uint8_t)(1U<<PRR2_R0)
#define    PRR2_R1         1       /*  */
#define    BM_PRR2_R1	(uint8_t)(1U<<PRR2_R1)
#define    PRSF            2       /* Power Reduction Preamble/RSSI FIFO */
#define    BM_PRSF	(uint8_t)(1U<<PRSF)
#define    PRDF            3       /* Power Reduction Data FIFO */
#define    BM_PRDF	(uint8_t)(1U<<PRDF)
#define    PRR2_R4         4       /*  */
#define    BM_PRR2_R4	(uint8_t)(1U<<PRR2_R4)
#define    PRR2_R5         5       /*  */
#define    BM_PRR2_R5	(uint8_t)(1U<<PRR2_R5)
#define    PRTM            6       /* Power Reduction Tx Modulator */
#define    BM_PRTM	(uint8_t)(1U<<PRTM)
#define    PRSSM           7       /* Power Reduction Sequencer State Machine */
#define    BM_PRSSM	(uint8_t)(1U<<PRSSM)

/* XFUSE -  */


/* ***** CPU ************************** */
/* CLPR - Clock Prescaler Register */
#define    CLKPS0          0       /* System Clock Prescaler Select bit 0 */
#define    BM_CLKPS0	(uint8_t)(1U<<CLKPS0)
#define    CLKPS1          1       /* System Clock Prescaler Select bit 1 */
#define    BM_CLKPS1	(uint8_t)(1U<<CLKPS1)
#define    CLKPS2          2       /* System Clock Prescaler Select bit 2 */
#define    BM_CLKPS2	(uint8_t)(1U<<CLKPS2)
#define    CLTPS0          3       /* Timer Clock Prescaler Select bit 0 */
#define    BM_CLTPS0	(uint8_t)(1U<<CLTPS0)
#define    CLTPS1          4       /* Timer Clock Prescaler Select bit 1 */
#define    BM_CLTPS1	(uint8_t)(1U<<CLTPS1)
#define    CLTPS2          5       /* Timer Clock Prescaler Select bit 2 */
#define    BM_CLTPS2	(uint8_t)(1U<<CLTPS2)
#define    CLPCE           7       /* Clock Prescaler Change Enable */
#define    BM_CLPCE	(uint8_t)(1U<<CLPCE)

/* CMCR - Clock Management Control Register */
#define    CMM0            0       /* Clock Management Mode bit 0 */
#define    BM_CMM0	(uint8_t)(1U<<CMM0)
#define    CMM1            1       /* Clock Management Mode bit 1 */
#define    BM_CMM1	(uint8_t)(1U<<CMM1)
#define    CMM2            2       /* Clock Management Mode bit 2 */
#define    BM_CMM2	(uint8_t)(1U<<CMM2)
#define    CCS             3       /* Core Clock Select */
#define    BM_CCS	(uint8_t)(1U<<CCS)
#define    CMONEN          6       /* Clock monitor enable */
#define    BM_CMONEN	(uint8_t)(1U<<CMONEN)
#define    CMCCE           7       /* Clock management control change enable */
#define    BM_CMCCE	(uint8_t)(1U<<CMCCE)

/* CMIMR - Clock interrupt mask Register */
#define    ECIE            0       /* External clock interrupt enable */
#define    BM_ECIE	(uint8_t)(1U<<ECIE)

/* DWDR - Debug Wire Data Register */
#define    DWDR0           0       /* Debug Wire Data Register bit 0 */
#define    BM_DWDR0	(uint8_t)(1U<<DWDR0)
#define    DWDR1           1       /* Debug Wire Data Register bit 1 */
#define    BM_DWDR1	(uint8_t)(1U<<DWDR1)
#define    DWDR2           2       /* Debug Wire Data Register bit 2 */
#define    BM_DWDR2	(uint8_t)(1U<<DWDR2)
#define    DWDR3           3       /* Debug Wire Data Register bit 3 */
#define    BM_DWDR3	(uint8_t)(1U<<DWDR3)
#define    DWDR4           4       /* Debug Wire Data Register bit 4 */
#define    BM_DWDR4	(uint8_t)(1U<<DWDR4)
#define    DWDR5           5       /* Debug Wire Data Register bit 5 */
#define    BM_DWDR5	(uint8_t)(1U<<DWDR5)
#define    DWDR6           6       /* Debug Wire Data Register bit 6 */
#define    BM_DWDR6	(uint8_t)(1U<<DWDR6)
#define    DWDR7           7       /* Debug Wire Data Register bit 7 */
#define    BM_DWDR7	(uint8_t)(1U<<DWDR7)

/* MCUCR - MCU control Register */
#define    IVCE            0       /* Interrupt Vector Change Enable */
#define    BM_IVCE	(uint8_t)(1U<<IVCE)
#define    IVSEL           1       /* Interrupt Vector Select */
#define    BM_IVSEL	(uint8_t)(1U<<IVSEL)
#define    SPIIO           2       /* SPI Interrupt Only */
#define    BM_SPIIO	(uint8_t)(1U<<SPIIO)
#define    ENPS            3       /* Enable Port Settings */
#define    BM_ENPS	(uint8_t)(1U<<ENPS)
#define    PUD             4       /* Pull-up Resistors Disable */
#define    BM_PUD	(uint8_t)(1U<<PUD)
#define    TRCCE           5       /* Trace Change Enable */
#define    BM_TRCCE	(uint8_t)(1U<<TRCCE)
#define    TRCEN           6       /* Trace Enable */
#define    BM_TRCEN	(uint8_t)(1U<<TRCEN)

/* MCUSR - MCU Status Register */
#define    PORF            0       /* Power-On Reset Flag */
#define    BM_PORF	(uint8_t)(1U<<PORF)
#define    EXTRF           1       /* External Reset Flag */
#define    BM_EXTRF	(uint8_t)(1U<<EXTRF)
#define    MCUSR_R2        2       /*  */
#define    BM_MCUSR_R2	(uint8_t)(1U<<MCUSR_R2)
#define    WDRF            3       /* Watchdog Reset Flag */
#define    BM_WDRF	(uint8_t)(1U<<WDRF)
#define    TPRF            5       /* Transponder Reset Flag */
#define    BM_TPRF	(uint8_t)(1U<<TPRF)
#define    MCUSR_R6        6       /*  */
#define    BM_MCUSR_R6	(uint8_t)(1U<<MCUSR_R6)

/* SMCR - Sleep mode control Register */
#define    SE              0       /* Sleep Enable */
#define    BM_SE	(uint8_t)(1U<<SE)
#define    SM0             1       /* Sleep Mode Select bit 0 */
#define    BM_SM0	(uint8_t)(1U<<SM0)
#define    SM1             2       /* Sleep Mode Select bit 1 */
#define    BM_SM1	(uint8_t)(1U<<SM1)
#define    SM2             3       /* Sleep Mode Select bit 2 */
#define    BM_SM2	(uint8_t)(1U<<SM2)

/* SPH - Stack Pointer High */
#define    SP8             0       /* Stack pointer bit 8 */
#define    BM_SP8	(uint8_t)(1U<<SP8)
#define    SP9             1       /* Stack pointer bit 9 */
#define    BM_SP9	(uint8_t)(1U<<SP9)
#define    SP10            2       /* Stack pointer bit 10 */
#define    BM_SP10	(uint8_t)(1U<<SP10)

/* SPL - Stack Pointer Low */
#define    SP0             0       /* Stack pointer bit 0 */
#define    BM_SP0	(uint8_t)(1U<<SP0)
#define    SP1             1       /* Stack pointer bit 1 */
#define    BM_SP1	(uint8_t)(1U<<SP1)
#define    SP2             2       /* Stack pointer bit 2 */
#define    BM_SP2	(uint8_t)(1U<<SP2)
#define    SP3             3       /* Stack pointer bit 3 */
#define    BM_SP3	(uint8_t)(1U<<SP3)
#define    SP4             4       /* Stack pointer bit 4 */
#define    BM_SP4	(uint8_t)(1U<<SP4)
#define    SP5             5       /* Stack pointer bit 5 */
#define    BM_SP5	(uint8_t)(1U<<SP5)
#define    SP6             6       /* Stack pointer bit 6 */
#define    BM_SP6	(uint8_t)(1U<<SP6)
#define    SP7             7       /* Stack pointer bit 7 */
#define    BM_SP7	(uint8_t)(1U<<SP7)

/* SPMCSR - Store Program Memory Control and Status Register */
#define    SELFPRGEN       0       /* Self Programming Enable */
#define    BM_SELFPRGEN	(uint8_t)(1U<<SELFPRGEN)
#define    PGERS           1       /* Page Erase */
#define    BM_PGERS	(uint8_t)(1U<<PGERS)
#define    PGWRT           2       /* Page Write */
#define    BM_PGWRT	(uint8_t)(1U<<PGWRT)
#define    BLBSET          3       /* Boot Lock Bit Set */
#define    BM_BLBSET	(uint8_t)(1U<<BLBSET)
#define    RWWSRE          4       /* Read-While-Write Section Read Enable */
#define    BM_RWWSRE	(uint8_t)(1U<<RWWSRE)
#define    SIGRD           5       /*  */
#define    BM_SIGRD	(uint8_t)(1U<<SIGRD)
#define    RWWSB           6       /* Read-While-Write Section Busy */
#define    BM_RWWSB	(uint8_t)(1U<<RWWSB)
#define    SPMIE           7       /* SPM Interrupt Enable */
#define    BM_SPMIE	(uint8_t)(1U<<SPMIE)

/* SREG - Status Register */
#define    SREG_C          0       /* Carry Flag */
#define    BM_SREG_C	(uint8_t)(1U<<SREG_C)
#define    SREG_Z          1       /* Zero Flag */
#define    BM_SREG_Z	(uint8_t)(1U<<SREG_Z)
#define    SREG_N          2       /* Negative Flag */
#define    BM_SREG_N	(uint8_t)(1U<<SREG_N)
#define    SREG_V          3       /* Two's Complement Overflow Flag */
#define    BM_SREG_V	(uint8_t)(1U<<SREG_V)
#define    SREG_S          4       /* Sign Bit */
#define    BM_SREG_S	(uint8_t)(1U<<SREG_S)
#define    SREG_H          5       /* Half Carry Flag */
#define    BM_SREG_H	(uint8_t)(1U<<SREG_H)
#define    SREG_T          6       /* Bit Copy Storage */
#define    BM_SREG_T	(uint8_t)(1U<<SREG_T)
#define    SREG_I          7       /* Global Interrupt Enable */
#define    BM_SREG_I	(uint8_t)(1U<<SREG_I)


/* ***** CRC ************************** */
/* CRCCR - CRC Control Register */
#define    CRCRS           0       /* CRC Data Register Reset */
#define    BM_CRCRS	(uint8_t)(1U<<CRCRS)
#define    REFLI           1       /* Reflect Data Input Byte */
#define    BM_REFLI	(uint8_t)(1U<<REFLI)
#define    REFLO           2       /* Reflect Data Output Byte */
#define    BM_REFLO	(uint8_t)(1U<<REFLO)

/* CRCDIR - CRC Data Input Register */
#define    CRCDIR0         0       /* CRC Data Input Register bit 0 */
#define    BM_CRCDIR0	(uint8_t)(1U<<CRCDIR0)
#define    CRCDIR1         1       /* CRC Data Input Register bit 1 */
#define    BM_CRCDIR1	(uint8_t)(1U<<CRCDIR1)
#define    CRCDIR2         2       /* CRC Data Input Register bit 2 */
#define    BM_CRCDIR2	(uint8_t)(1U<<CRCDIR2)
#define    CRCDIR3         3       /* CRC Data Input Register bit 3 */
#define    BM_CRCDIR3	(uint8_t)(1U<<CRCDIR3)
#define    CRCDIR4         4       /* CRC Data Input Register bit 4 */
#define    BM_CRCDIR4	(uint8_t)(1U<<CRCDIR4)
#define    CRCDIR5         5       /* CRC Data Input Register bit 5 */
#define    BM_CRCDIR5	(uint8_t)(1U<<CRCDIR5)
#define    CRCDIR6         6       /* CRC Data Input Register bit 6 */
#define    BM_CRCDIR6	(uint8_t)(1U<<CRCDIR6)
#define    CRCDIR7         7       /* CRC Data Input Register bit 7 */
#define    BM_CRCDIR7	(uint8_t)(1U<<CRCDIR7)

