camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* CRCDOR - CRC Data Output Register */
#define    CRCDOR0         0       /* CRC Data Output Register bit 0 */
#define    BM_CRCDOR0	(uint8_t)(1U<<CRCDOR0)
#define    CRCDOR1         1       /* CRC Data Output Register bit 1 */
#define    BM_CRCDOR1	(uint8_t)(1U<<CRCDOR1)
#define    CRCDOR2         2       /* CRC Data Output Register bit 2 */
#define    BM_CRCDOR2	(uint8_t)(1U<<CRCDOR2)
#define    CRCDOR3         3       /* CRC Data Output Register bit 3 */
#define    BM_CRCDOR3	(uint8_t)(1U<<CRCDOR3)
#define    CRCDOR4         4       /* CRC Data Output Register bit 4 */
#define    BM_CRCDOR4	(uint8_t)(1U<<CRCDOR4)
#define    CRCDOR5         5       /* CRC Data Output Register bit 5 */
#define    BM_CRCDOR5	(uint8_t)(1U<<CRCDOR5)
#define    CRCDOR6         6       /* CRC Data Output Register bit 6 */
#define    BM_CRCDOR6	(uint8_t)(1U<<CRCDOR6)
#define    CRCDOR7         7       /* CRC Data Output Register bit 7 */
#define    BM_CRCDOR7	(uint8_t)(1U<<CRCDOR7)


/* ***** DEBOUNCE ********************* */
/* DBCR - DeBounce Control Register */
#define    DBMD            0       /* Debounce Mode */
#define    BM_DBMD	(uint8_t)(1U<<DBMD)
#define    DBCS            1       /* Debounce Clock Select */
#define    BM_DBCS	(uint8_t)(1U<<DBCS)
#define    DBTMS           2       /* Debounce Timer Mask Select */
#define    BM_DBTMS	(uint8_t)(1U<<DBTMS)
#define    DBHA            3       /* Debounce Handshake Active */
#define    BM_DBHA	(uint8_t)(1U<<DBHA)

/* DBENB - DeBounce Enable Port B */
#define    DBENB0          0       /* DeBounce Enable Port B Pin 0 */
#define    BM_DBENB0	(uint8_t)(1U<<DBENB0)
#define    DBENB1          1       /* DeBounce Enable Port B Pin 1 */
#define    BM_DBENB1	(uint8_t)(1U<<DBENB1)
#define    DBENB2          2       /* DeBounce Enable Port B Pin 2 */
#define    BM_DBENB2	(uint8_t)(1U<<DBENB2)
#define    DBENB3          3       /* DeBounce Enable Port B Pin 3 */
#define    BM_DBENB3	(uint8_t)(1U<<DBENB3)
#define    DBENB4          4       /* DeBounce Enable Port B Pin 4 */
#define    BM_DBENB4	(uint8_t)(1U<<DBENB4)
#define    DBENB5          5       /* DeBounce Enable Port B Pin 5 */
#define    BM_DBENB5	(uint8_t)(1U<<DBENB5)
#define    DBENB6          6       /* DeBounce Enable Port B Pin 6 */
#define    BM_DBENB6	(uint8_t)(1U<<DBENB6)
#define    DBENB7          7       /* DeBounce Enable Port B Pin 7 */
#define    BM_DBENB7	(uint8_t)(1U<<DBENB7)

/* DBENC - DeBounce Enable Port C */
#define    DBENC0          0       /* DeBounce Enable Port C Pin 0 */
#define    BM_DBENC0	(uint8_t)(1U<<DBENC0)
#define    DBENC1          1       /* DeBounce Enable Port C Pin 1 */
#define    BM_DBENC1	(uint8_t)(1U<<DBENC1)
#define    DBENC2          2       /* DeBounce Enable Port C Pin 2 */
#define    BM_DBENC2	(uint8_t)(1U<<DBENC2)

/* DBEND - DeBounce Enable Port D */
#define    DBEND0          0       /* DeBounce Enable Port D Pin 0 */
#define    BM_DBEND0	(uint8_t)(1U<<DBEND0)
#define    DBEND1          1       /* DeBounce Enable Port D Pin 1 */
#define    BM_DBEND1	(uint8_t)(1U<<DBEND1)
#define    DBEND2          2       /* DeBounce Enable Port D Pin 2 */
#define    BM_DBEND2	(uint8_t)(1U<<DBEND2)
#define    DBEND3          3       /* DeBounce Enable Port D Pin 3 */
#define    BM_DBEND3	(uint8_t)(1U<<DBEND3)
#define    DBEND4          4       /* DeBounce Enable Port D Pin 4 */
#define    BM_DBEND4	(uint8_t)(1U<<DBEND4)
#define    DBEND5          5       /* DeBounce Enable Port D Pin 5 */
#define    BM_DBEND5	(uint8_t)(1U<<DBEND5)
#define    DBEND6          6       /* DeBounce Enable Port D Pin 6 */
#define    BM_DBEND6	(uint8_t)(1U<<DBEND6)
#define    DBEND7          7       /* DeBounce Enable Port D Pin 7 */
#define    BM_DBEND7	(uint8_t)(1U<<DBEND7)

/* DBTC - Debounce Timer Compare Register */
#define    DBTC0           0       /* Debounce Timer Compare bit 0 */
#define    BM_DBTC0	(uint8_t)(1U<<DBTC0)
#define    DBTC1           1       /* Debounce Timer Compare bit 1 */
#define    BM_DBTC1	(uint8_t)(1U<<DBTC1)
#define    DBTC2           2       /* Debounce Timer Compare bit 2 */
#define    BM_DBTC2	(uint8_t)(1U<<DBTC2)
#define    DBTC3           3       /* Debounce Timer Compare bit 3 */
#define    BM_DBTC3	(uint8_t)(1U<<DBTC3)
#define    DBTC4           4       /* Debounce Timer Compare bit 4 */
#define    BM_DBTC4	(uint8_t)(1U<<DBTC4)
#define    DBTC5           5       /* Debounce Timer Compare bit 5 */
#define    BM_DBTC5	(uint8_t)(1U<<DBTC5)
#define    DBTC6           6       /* Debounce Timer Compare bit 6 */
#define    BM_DBTC6	(uint8_t)(1U<<DBTC6)
#define    DBTC7           7       /* Debounce Timer Compare bit 7 */
#define    BM_DBTC7	(uint8_t)(1U<<DBTC7)


/* ***** DEBUG ************************ */
/* DBGSW - Debugging Support Switch */
#define    DBGGS0          0       /* Debugging Support Group Select bit 0 */
#define    BM_DBGGS0	(uint8_t)(1U<<DBGGS0)
#define    DBGGS1          1       /* Debugging Support Group Select bit 1 */
#define    BM_DBGGS1	(uint8_t)(1U<<DBGGS1)
#define    DBGGS2          2       /* Debugging Support Group Select bit 2 */
#define    BM_DBGGS2	(uint8_t)(1U<<DBGGS2)
#define    DBGGS3          3       /* Debugging Support Group Select bit 3 */
#define    BM_DBGGS3	(uint8_t)(1U<<DBGGS3)
#define    CPBFOS0         4       /* CPU Busy Flag Output Select bit 0 */
#define    BM_CPBFOS0	(uint8_t)(1U<<CPBFOS0)
#define    CPBFOS1         5       /* CPU Busy Flag Output Select bit 1 */
#define    BM_CPBFOS1	(uint8_t)(1U<<CPBFOS1)
#define    CPBF            6       /* CPU Busy Flag */
#define    BM_CPBF	(uint8_t)(1U<<CPBF)
#define    ATEST           7       /* Analog Test Pins Enable */
#define    BM_ATEST	(uint8_t)(1U<<ATEST)

/* DBONDR - Downbond Test Register */
#define    BBESD           0       /* Bond BBESD */
#define    BM_BBESD	(uint8_t)(1U<<BBESD)
#define    AGND_BB         1       /* Bond AGND BB */
#define    BM_AGND_BB	(uint8_t)(1U<<AGND_BB)
#define    ISO_GND         2       /* Bond ISO SUBS3 GND */
#define    BM_ISO_GND	(uint8_t)(1U<<ISO_GND)
#define    AGND_LF         3       /* Bond AGND LF */
#define    BM_AGND_LF	(uint8_t)(1U<<AGND_LF)
#define    BTEST4          4       /* Bond Test 4 */
#define    BM_BTEST4	(uint8_t)(1U<<BTEST4)
#define    BTEST5          5       /* Bond Test 5 */
#define    BM_BTEST5	(uint8_t)(1U<<BTEST5)
#define    BTEST6          6       /* Bond Test 6 */
#define    BM_BTEST6	(uint8_t)(1U<<BTEST6)

