camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* EECR2 - EEPROM Control Register 2 */
#define    EEBRE           0       /* EEPROM Burst Read Enable */
#define    BM_EEBRE	(uint8_t)(1U<<EEBRE)
#define    E2CIM           1       /* EEPROM Error Code Correction Interrupt Mask */
#define    BM_E2CIM	(uint8_t)(1U<<E2CIM)
#define    E2AVF           5       /* EEPROM Error Code Correction Interrupt Mask */
#define    BM_E2AVF	(uint8_t)(1U<<E2AVF)
#define    E2FF            6       /* EEPROM error Fault Flag bit */
#define    BM_E2FF	(uint8_t)(1U<<E2FF)
#define    E2CF            7       /* EEPROM Error Correction Code Flag */
#define    BM_E2CF	(uint8_t)(1U<<E2CF)

/* EEPR - EEPROM Protection Register */
#define    EEAP0           0       /* EEPROM Access Protection Register bit 0 */
#define    BM_EEAP0	(uint8_t)(1U<<EEAP0)
#define    EEAP1           1       /* EEPROM Access Protection Register bit 1 */
#define    BM_EEAP1	(uint8_t)(1U<<EEAP1)
#define    EEAP2           2       /* EEPROM Access Protection Register bit 2 */
#define    BM_EEAP2	(uint8_t)(1U<<EEAP2)
#define    EEAP3           3       /* EEPROM Access Protection Register bit 3 */
#define    BM_EEAP3	(uint8_t)(1U<<EEAP3)


/* ***** FE *************************** */
/* FEALR - Front-End Antenna Level Detector Range */
#define    RNGE0           0       /* Range of the ANT_TUNE level detector bit 0 */
#define    BM_RNGE0	(uint8_t)(1U<<RNGE0)
#define    RNGE1           1       /* Range of the ANT_TUNE level detector bit 1 */
#define    BM_RNGE1	(uint8_t)(1U<<RNGE1)

/* FEANT - Front-End Antenna */
#define    LVLC0           0       /* antenna signal LeVeL bit 0 */
#define    BM_LVLC0	(uint8_t)(1U<<LVLC0)
#define    LVLC1           1       /* antenna signal LeVeL bit 1 */
#define    BM_LVLC1	(uint8_t)(1U<<LVLC1)
#define    LVLC2           2       /* antenna signal LeVeL bit 2 */
#define    BM_LVLC2	(uint8_t)(1U<<LVLC2)
#define    LVLC3           3       /* antenna signal LeVeL bit 3 */
#define    BM_LVLC3	(uint8_t)(1U<<LVLC3)

/* FEAT - Front-End Antenna Tuning */
#define    ANTN0           0       /* Antenna Tuning bit 0 */
#define    BM_ANTN0	(uint8_t)(1U<<ANTN0)
#define    ANTN1           1       /* Antenna Tuning bit 1 */
#define    BM_ANTN1	(uint8_t)(1U<<ANTN1)
#define    ANTN2           2       /* Antenna Tuning bit 2 */
#define    BM_ANTN2	(uint8_t)(1U<<ANTN2)
#define    ANTN3           3       /* Antenna Tuning bit 3 */
#define    BM_ANTN3	(uint8_t)(1U<<ANTN3)

/* FEBIA - Front-End IF Amplifier BIAS */
#define    BIAM0           0       /* Bias amplifier bit 0 */
#define    BM_BIAM0	(uint8_t)(1U<<BIAM0)
#define    BIAM1           1       /* Bias amplifier bit 1 */
#define    BM_BIAM1	(uint8_t)(1U<<BIAM1)
#define    BIAM2           2       /* Bias amplifier bit 2 */
#define    BM_BIAM2	(uint8_t)(1U<<BIAM2)
#define    BIAM3           3       /* Bias amplifier bit 3 */
#define    BM_BIAM3	(uint8_t)(1U<<BIAM3)
#define    FEBIA_R4        4       /*  */
#define    BM_FEBIA_R4	(uint8_t)(1U<<FEBIA_R4)
#define    FEBIA_R5        5       /*  */
#define    BM_FEBIA_R5	(uint8_t)(1U<<FEBIA_R5)
#define    FEBIA_R6        6       /*  */
#define    BM_FEBIA_R6	(uint8_t)(1U<<FEBIA_R6)
#define    IFAEN           7       /* IF Amplifier Enable */
#define    BM_IFAEN	(uint8_t)(1U<<IFAEN)

/* FEBT - Front-End RC Tuning Register */
#define    CTN20           0       /* Capacitor Tuning bit 0 */
#define    BM_CTN20	(uint8_t)(1U<<CTN20)
#define    CTN21           1       /* Capacitor Tuning bit 1 */
#define    BM_CTN21	(uint8_t)(1U<<CTN21)
#define    RTN20           2       /* Resistor Tuning bit 0 */
#define    BM_RTN20	(uint8_t)(1U<<RTN20)
#define    RTN21           3       /* Resistor Tuning bit 1 */
#define    BM_RTN21	(uint8_t)(1U<<RTN21)

/* FECR - Front-End Control Register */
#define    LBNHB           0       /* Select Low-Band Not High-Band */
#define    BM_LBNHB	(uint8_t)(1U<<LBNHB)
#define    S4N3            1       /* Select 433 Not 315MHz Band */
#define    BM_S4N3	(uint8_t)(1U<<S4N3)
#define    ANDP            2       /* Antenna Damping */
#define    BM_ANDP	(uint8_t)(1U<<ANDP)
#define    ADHS            3       /* ADC High Sample Rate */
#define    BM_ADHS	(uint8_t)(1U<<ADHS)
#define    PLCKG           4       /* PLL Lock Detect Gate */
#define    BM_PLCKG	(uint8_t)(1U<<PLCKG)
#define    ANPS            5       /* ASK Not DPSK Switch */
#define    BM_ANPS	(uint8_t)(1U<<ANPS)

/* FEEN1 - Front-End Enable Register 1 */
#define    PLEN            0       /* PLL enable */
#define    BM_PLEN	(uint8_t)(1U<<PLEN)
#define    PLCAL           1       /* PLL calibration mode */
#define    BM_PLCAL	(uint8_t)(1U<<PLCAL)
#define    XTOEN           2       /* Cristal Oscillator enable */
#define    BM_XTOEN	(uint8_t)(1U<<XTOEN)
#define    LNAEN           3       /* Low Noise Amplifier enable */
#define    BM_LNAEN	(uint8_t)(1U<<LNAEN)
#define    ADEN            4       /* Analog Digital Converter enable */
#define    BM_ADEN	(uint8_t)(1U<<ADEN)
#define    ADCLK           5       /* ADC Clock enable */
#define    BM_ADCLK	(uint8_t)(1U<<ADCLK)
#define    PLSP1           6       /* PLL Speedup 1 */
#define    BM_PLSP1	(uint8_t)(1U<<PLSP1)
#define    ATEN            7       /* Antenna Tuning Enable */
#define    BM_ATEN	(uint8_t)(1U<<ATEN)

/* FEEN2 - Front-End Enable Register 2 */
#define    SDRX            0       /* Single Pole Double Throw (SPDT) Switch RX */
#define    BM_SDRX	(uint8_t)(1U<<SDRX)
#define    SDTX            1       /* Single Pole Double Throw (SPDT) Switch TX */
#define    BM_SDTX	(uint8_t)(1U<<SDTX)
#define    PAEN            2       /* Power Amplifier enable */
#define    BM_PAEN	(uint8_t)(1U<<PAEN)
#define    TMPM            3       /* Temperature measurement */
#define    BM_TMPM	(uint8_t)(1U<<TMPM)
#define    PLPEN           4       /* PLL Post En IQ divider */
#define    BM_PLPEN	(uint8_t)(1U<<PLPEN)
#define    XTPEN           5       /* XTO VPump enable */
#define    BM_XTPEN	(uint8_t)(1U<<XTPEN)
#define    CPBIA           6       /* Cap Array Bias */
#define    BM_CPBIA	(uint8_t)(1U<<CPBIA)
#define    FEEN2_R7        7       /*  */
#define    BM_FEEN2_R7	(uint8_t)(1U<<FEEN2_R7)

/* FELNA - Front-End LNA Bias Register */
#define    LBH0            0       /* LNA Bias High band bit 0 */
#define    BM_LBH0	(uint8_t)(1U<<LBH0)
#define    LBH1            1       /* LNA Bias High band bit 1 */
#define    BM_LBH1	(uint8_t)(1U<<LBH1)
#define    LBH2            2       /* LNA Bias High band bit 2 */
#define    BM_LBH2	(uint8_t)(1U<<LBH2)
#define    LBH3            3       /* LNA Bias High band bit 3 */
#define    BM_LBH3	(uint8_t)(1U<<LBH3)
#define    LBL0            4       /* LNA Bias Low band bit 0 */
#define    BM_LBL0	(uint8_t)(1U<<LBL0)
#define    LBL1            5       /* LNA Bias Low band bit 1 */
#define    BM_LBL1	(uint8_t)(1U<<LBL1)
#define    LBL2            6       /* LNA Bias Low band bit 2 */
#define    BM_LBL2	(uint8_t)(1U<<LBL2)
#define    LBL3            7       /* LNA Bias Low band bit 3 */
#define    BM_LBL3	(uint8_t)(1U<<LBL3)

/* FEMS - Front-End Main and Swallow Control Register */
#define    PLLS0           0       /* PLL Swallow bit 0 */
#define    BM_PLLS0	(uint8_t)(1U<<PLLS0)
#define    PLLS1           1       /* PLL Swallow bit 1 */
#define    BM_PLLS1	(uint8_t)(1U<<PLLS1)
#define    PLLS2           2       /* PLL Swallow bit 2 */
#define    BM_PLLS2	(uint8_t)(1U<<PLLS2)
#define    PLLS3           3       /* PLL Swallow bit 3 */
#define    BM_PLLS3	(uint8_t)(1U<<PLLS3)
#define    PLLM0           4       /* PLL Mode bit 0 */
#define    BM_PLLM0	(uint8_t)(1U<<PLLM0)
#define    PLLM1           5       /* PLL Mode bit 1 */
#define    BM_PLLM1	(uint8_t)(1U<<PLLM1)
#define    PLLM2           6       /* PLL Mode bit 2 */
#define    BM_PLLM2	(uint8_t)(1U<<PLLM2)
#define    PLLM3           7       /* PLL Mode bit 3 */
#define    BM_PLLM3	(uint8_t)(1U<<PLLM3)

/* FEPAC - Front-End Power Amplifier Control Register */
#define    PACR0           0       /* Power Amplifier Control Register bit 0 */
#define    BM_PACR0	(uint8_t)(1U<<PACR0)
#define    PACR1           1       /* Power Amplifier Control Register bit 1 */
#define    BM_PACR1	(uint8_t)(1U<<PACR1)
#define    PACR2           2       /* Power Amplifier Control Register bit 2 */
#define    BM_PACR2	(uint8_t)(1U<<PACR2)
#define    PACR3           3       /* Power Amplifier Control Register bit 3 */
#define    BM_PACR3	(uint8_t)(1U<<PACR3)
#define    PACR4           4       /* Power Amplifier Control Register bit 4 */
#define    BM_PACR4	(uint8_t)(1U<<PACR4)
#define    PACR5           5       /* Power Amplifier Control Register bit 5 */
#define    BM_PACR5	(uint8_t)(1U<<PACR5)
#define    PACR6           6       /* Power Amplifier Control Register bit 6 */
#define    BM_PACR6	(uint8_t)(1U<<PACR6)
#define    PACR7           7       /* Power Amplifier Control Register bit 7 */
#define    BM_PACR7	(uint8_t)(1U<<PACR7)

/* FESR - Front-End Status Register */
#define    LBSAT           0       /* LNA Low band saturated */
#define    BM_LBSAT	(uint8_t)(1U<<LBSAT)
#define    HBSAT           1       /* LNA High band saturated */
#define    BM_HBSAT	(uint8_t)(1U<<HBSAT)
#define    XRDY            2       /* XTO ready */
#define    BM_XRDY	(uint8_t)(1U<<XRDY)
#define    PLCK            3       /* PLL locked */
#define    BM_PLCK	(uint8_t)(1U<<PLCK)
#define    ANTS            4       /* Antenna saturated */
#define    BM_ANTS	(uint8_t)(1U<<ANTS)

