camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* ***** INT ************************** */
/* EICRA - External Interrupt control Register */
#define    ISC00           0       /* Interrupt Sense Control 0 bit 0 */
#define    BM_ISC00	(uint8_t)(1U<<ISC00)
#define    ISC01           1       /* Interrupt Sense Control 0 bit 1 */
#define    BM_ISC01	(uint8_t)(1U<<ISC01)
#define    ISC10           2       /* Interrupt Sense Control 1 bit 0 */
#define    BM_ISC10	(uint8_t)(1U<<ISC10)
#define    ISC11           3       /* Interrupt Sense Control 1 bit 1 */
#define    BM_ISC11	(uint8_t)(1U<<ISC11)

/* EIFR - External Interrupt Flag Register */
#define    INTF0           0       /* External Interrupt Flag 0 */
#define    BM_INTF0	(uint8_t)(1U<<INTF0)
#define    INTF1           1       /* External Interrupt Flag 1 */
#define    BM_INTF1	(uint8_t)(1U<<INTF1)

/* EIMSK - External Interrupt Mask Register */
#define    INT0            0       /* External Interrupt Request 0 Enable */
#define    BM_INT0	(uint8_t)(1U<<INT0)
#define    INT1            1       /* External Interrupt Request 1 Enable */
#define    BM_INT1	(uint8_t)(1U<<INT1)

/* PCICR - Pin change Interrupt control Register */
#define    PCIE0           0       /* Pin Change Interrupt Enable 0 */
#define    BM_PCIE0	(uint8_t)(1U<<PCIE0)
#define    PCIE1           1       /* Pin Change Interrupt Enable 1 */
#define    BM_PCIE1	(uint8_t)(1U<<PCIE1)

/* PCIFR - Pin change Interrupt flag Register */
#define    PCIF0           0       /* Pin Change Interrupt Flag 0 */
#define    BM_PCIF0	(uint8_t)(1U<<PCIF0)
#define    PCIF1           1       /* Pin Change Interrupt Flag 1 */
#define    BM_PCIF1	(uint8_t)(1U<<PCIF1)

/* PCMSK0 - Pin change Mask Register 0 */
#define    PCINT0          0       /* Pin Change Enable Mask bit 0 */
#define    BM_PCINT0	(uint8_t)(1U<<PCINT0)
#define    PCINT1          1       /* Pin Change Enable Mask bit 1 */
#define    BM_PCINT1	(uint8_t)(1U<<PCINT1)
#define    PCINT2          2       /* Pin Change Enable Mask bit 2 */
#define    BM_PCINT2	(uint8_t)(1U<<PCINT2)
#define    PCINT3          3       /* Pin Change Enable Mask bit 3 */
#define    BM_PCINT3	(uint8_t)(1U<<PCINT3)
#define    PCINT4          4       /* Pin Change Enable Mask bit 4 */
#define    BM_PCINT4	(uint8_t)(1U<<PCINT4)
#define    PCINT5          5       /* Pin Change Enable Mask bit 5 */
#define    BM_PCINT5	(uint8_t)(1U<<PCINT5)
#define    PCINT6          6       /* Pin Change Enable Mask bit 6 */
#define    BM_PCINT6	(uint8_t)(1U<<PCINT6)
#define    PCINT7          7       /* Pin Change Enable Mask bit 7 */
#define    BM_PCINT7	(uint8_t)(1U<<PCINT7)

/* PCMSK1 - Pin change Mask Register 1 */
#define    PCINT8          0       /* Pin Change Enable Mask bit 8 */
#define    BM_PCINT8	(uint8_t)(1U<<PCINT8)
#define    PCINT9          1       /* Pin Change Enable Mask bit 9 */
#define    BM_PCINT9	(uint8_t)(1U<<PCINT9)
#define    PCINT10         2       /* Pin Change Enable Mask bit 10 */
#define    BM_PCINT10	(uint8_t)(1U<<PCINT10)
#define    PCINT11         3       /* Pin Change Enable Mask bit 11 */
#define    BM_PCINT11	(uint8_t)(1U<<PCINT11)
#define    PCINT12         4       /* Pin Change Enable Mask bit 12 */
#define    BM_PCINT12	(uint8_t)(1U<<PCINT12)
#define    PCINT13         5       /* Pin Change Enable Mask bit 13 */
#define    BM_PCINT13	(uint8_t)(1U<<PCINT13)
#define    PCINT14         6       /* Pin Change Enable Mask bit 14 */
#define    BM_PCINT14	(uint8_t)(1U<<PCINT14)
#define    PCINT15         7       /* Pin Change Enable Mask bit 15 */
#define    BM_PCINT15	(uint8_t)(1U<<PCINT15)


/* ***** LED ************************** */
/* PDSCR - Pad Driver Strength Control Register */
#define    PDSC0           0       /* Pad Driver Strength Control bit 0 */
#define    BM_PDSC0	(uint8_t)(1U<<PDSC0)
#define    PDSC1           1       /* Pad Driver Strength Control bit 1 */
#define    BM_PDSC1	(uint8_t)(1U<<PDSC1)
#define    PDSC2           2       /* Pad Driver Strength Control bit 2 */
#define    BM_PDSC2	(uint8_t)(1U<<PDSC2)
#define    PDSC3           3       /* Pad Driver Strength Control bit 3 */
#define    BM_PDSC3	(uint8_t)(1U<<PDSC3)
#define    PDSC4           4       /* Pad Driver Strength Control bit 4 */
#define    BM_PDSC4	(uint8_t)(1U<<PDSC4)
#define    RSSISEL         6       /* Testmode Enable for RSSI Measurement */
#define    BM_RSSISEL	(uint8_t)(1U<<RSSISEL)
#define    ATBSEL          7       /* Analog Testbus Select */
#define    BM_ATBSEL	(uint8_t)(1U<<ATBSEL)


/* ***** LF3D ************************* */
/* LFCPR - LF Receiver Calibration Protect Register */
#define    LFCALP          0       /* LF CaLibration Protection */
#define    BM_LFCALP	(uint8_t)(1U<<LFCALP)
#define    LFCALRY         1       /* LF Calibration Ready */
#define    BM_LFCALRY	(uint8_t)(1U<<LFCALRY)
#define    LFCPCE          7       /* LF CaLibration Protect Change Enable */
#define    BM_LFCPCE	(uint8_t)(1U<<LFCPCE)

/* LFCR0 - LF Receiver Decode Unit Control Register 0 */
#define    LFCE1           0       /* LF Receiver Channel 1 Enable */
#define    BM_LFCE1	(uint8_t)(1U<<LFCE1)
#define    LFCE2           1       /* LF Receiver Channel 2 Enable */
#define    BM_LFCE2	(uint8_t)(1U<<LFCE2)
#define    LFCE3           2       /* LF Receiver Channel 3 Enable */
#define    BM_LFCE3	(uint8_t)(1U<<LFCE3)
#define    LFBR0           3       /* LF Receiver Bit Rate bit 0 */
#define    BM_LFBR0	(uint8_t)(1U<<LFBR0)
#define    LFBR1           4       /* LF Receiver Bit Rate bit 1 */
#define    BM_LFBR1	(uint8_t)(1U<<LFBR1)
#define    LFMG            5       /* LF Receiver Maximum Gain Select */
#define    BM_LFMG	(uint8_t)(1U<<LFMG)
#define    LFRRT0          6       /* LF Receiver Reset Time select bit 0 */
#define    BM_LFRRT0	(uint8_t)(1U<<LFRRT0)
#define    LFRRT1          7       /* LF Receiver Reset Time select bit 1 */
#define    BM_LFRRT1	(uint8_t)(1U<<LFRRT1)

/* LFCR1 - LF Receiver Decode Unit Control Register 1 */
#define    LFFM0           0       /* LF Function Mode bit 0 */
#define    BM_LFFM0	(uint8_t)(1U<<LFFM0)
#define    LFFM1           1       /* LF Function Mode bit 1 */
#define    BM_LFFM1	(uint8_t)(1U<<LFFM1)
#define    ARMDE           2       /* Analog Reset Manchester Detector Enable */
#define    BM_ARMDE	(uint8_t)(1U<<ARMDE)
#define    LFCODE          3       /* Reserved for future use */
#define    BM_LFCODE	(uint8_t)(1U<<LFCODE)
#define    FLLEN           4       /* FLL Enable */
#define    BM_FLLEN	(uint8_t)(1U<<FLLEN)
#define    ADTHEN          5       /* Adapt Threshold Enable */
#define    BM_ADTHEN	(uint8_t)(1U<<ADTHEN)
#define    LFPEEN          6       /* LF Port Event Enable */
#define    BM_LFPEEN	(uint8_t)(1U<<LFPEEN)
#define    LFRE            7       /* LF Receiver Enable */
#define    BM_LFRE	(uint8_t)(1U<<LFRE)

/* LFCR2 - LF Receiver Decode Unit Control Register 2 */
#define    LFSEN0          0       /* LF Sensitivity Mode bit 0 */
#define    BM_LFSEN0	(uint8_t)(1U<<LFSEN0)
#define    LFSEN1          1       /* LF Sensitivity Mode bit 1 */
#define    BM_LFSEN1	(uint8_t)(1U<<LFSEN1)
#define    LFDAMP          2       /* LF coil Damping level select */
#define    BM_LFDAMP	(uint8_t)(1U<<LFDAMP)
#define    LFSBEN          4       /* LF Standby mode Enable */
#define    BM_LFSBEN	(uint8_t)(1U<<LFSBEN)
#define    LFVC0           5       /* LF Velocity Control bit 0 */
#define    BM_LFVC0	(uint8_t)(1U<<LFVC0)
#define    LFVC1           6       /* LF Velocity Control bit 1 */
#define    BM_LFVC1	(uint8_t)(1U<<LFVC1)
#define    LFVC2           7       /* LF Velocity Control bit 2 */
#define    BM_LFVC2	(uint8_t)(1U<<LFVC2)

/* LFCR3 - LF Receiver Decode Unit Control Register 3 */
#define    LFRCTEN         0       /* LF RC Trim Enable */
#define    BM_LFRCTEN	(uint8_t)(1U<<LFRCTEN)
#define    LFRCPCEN        1       /* LF RC Pump Continous Enable */
#define    BM_LFRCPCEN	(uint8_t)(1U<<LFRCPCEN)
#define    LFRCPM          2       /* LF RC Pump mode Enable */
#define    BM_LFRCPM	(uint8_t)(1U<<LFRCPM)

/* LFDSR1 - LF Receiver Decoder Setting Register 1 */
#define    LOTHA0          0       /* Low Threshold A bit 0 */
#define    BM_LOTHA0	(uint8_t)(1U<<LOTHA0)
#define    LOTHA1          1       /* Low Threshold A bit 1 */
#define    BM_LOTHA1	(uint8_t)(1U<<LOTHA1)
#define    HITHA0          2       /* High Threshold A bit 0 */
#define    BM_HITHA0	(uint8_t)(1U<<HITHA0)
#define    HITHA1          3       /* High Threshold A bit 1 */
#define    BM_HITHA1	(uint8_t)(1U<<HITHA1)
#define    CTTHA0          4       /* Count Threshold A bit 0 */
#define    BM_CTTHA0	(uint8_t)(1U<<CTTHA0)
#define    CTTHA1          5       /* Count Threshold A bit 1 */
#define    BM_CTTHA1	(uint8_t)(1U<<CTTHA1)

/* LFDSR11 - Low Frequency Decoder Setting Register 11 */
#define    TINITA0         0       /* Time Init A bit 0 */
#define    BM_TINITA0	(uint8_t)(1U<<TINITA0)
#define    TINITA1         1       /* Time Init A bit 1 */
#define    BM_TINITA1	(uint8_t)(1U<<TINITA1)
#define    TINITA2         2       /* Time Init A bit 2 */
#define    BM_TINITA2	(uint8_t)(1U<<TINITA2)
#define    TINITA3         3       /* Time Init A bit 3 */
#define    BM_TINITA3	(uint8_t)(1U<<TINITA3)
#define    TINITB0         4       /* Time Init B bit 0 */
#define    BM_TINITB0	(uint8_t)(1U<<TINITB0)
#define    TINITB1         5       /* Time Init B bit 1 */
#define    BM_TINITB1	(uint8_t)(1U<<TINITB1)
#define    TINITB2         6       /* Time Init B bit 2 */
#define    BM_TINITB2	(uint8_t)(1U<<TINITB2)
#define    TINITB3         7       /* Time Init B bit 3 */
#define    BM_TINITB3	(uint8_t)(1U<<TINITB3)

/* LFDSR2 - LF Receiver Decoder Setting Register 2 */
#define    LOTHB0          0       /* Low Threshold B bit 0 */
#define    BM_LOTHB0	(uint8_t)(1U<<LOTHB0)
#define    LOTHB1          1       /* Low Threshold B bit 1 */
#define    BM_LOTHB1	(uint8_t)(1U<<LOTHB1)
#define    HITHB0          2       /* High Threshold B bit 0 */
#define    BM_HITHB0	(uint8_t)(1U<<HITHB0)
#define    HITHB1          3       /* High Threshold B bit 1 */
#define    BM_HITHB1	(uint8_t)(1U<<HITHB1)
#define    CTTHB0          4       /* Count Threshold B bit 0 */
#define    BM_CTTHB0	(uint8_t)(1U<<CTTHB0)
#define    CTTHB1          5       /* Count Threshold B bit 1 */
#define    BM_CTTHB1	(uint8_t)(1U<<CTTHB1)

