camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* ***** LF_PROTOCOL_HANDLER ********** */
/* PHBCRR - Protocol Handler Bit Counter Read Register */
#define    PHBCR0          0       /* Protocol Handler Bit Counter Read bit 0 */
#define    BM_PHBCR0	(uint8_t)(1U<<PHBCR0)
#define    PHBCR1          1       /* Protocol Handler Bit Counter Read bit 1 */
#define    BM_PHBCR1	(uint8_t)(1U<<PHBCR1)
#define    PHBCR2          2       /* Protocol Handler Bit Counter Read bit 2 */
#define    BM_PHBCR2	(uint8_t)(1U<<PHBCR2)
#define    PHBCR3          3       /* Protocol Handler Bit Counter Read bit 3 */
#define    BM_PHBCR3	(uint8_t)(1U<<PHBCR3)
#define    PHBCR4          4       /* Protocol Handler Bit Counter Read bit 4 */
#define    BM_PHBCR4	(uint8_t)(1U<<PHBCR4)
#define    PHBCR5          5       /* Protocol Handler Bit Counter Read bit 5 */
#define    BM_PHBCR5	(uint8_t)(1U<<PHBCR5)
#define    PHBCR6          6       /* Protocol Handler Bit Counter Read bit 6 */
#define    BM_PHBCR6	(uint8_t)(1U<<PHBCR6)
#define    PHBCR7          7       /* Protocol Handler Bit Counter Read bit 7 */
#define    BM_PHBCR7	(uint8_t)(1U<<PHBCR7)

/* PHCKCR - PH FIFO Clock Gen. Control Register */
#define    FIFSCSW         0       /* FIFO Synchronous Clock Switch */
#define    BM_FIFSCSW	(uint8_t)(1U<<FIFSCSW)
#define    FRFIFO          5       /* Frame stored in FIFO */
#define    BM_FRFIFO	(uint8_t)(1U<<FRFIFO)
#define    CPM             6       /* Continuous Pattern Mode */
#define    BM_CPM	(uint8_t)(1U<<CPM)
#define    CSM             7       /* Continue or Single receive Mode */
#define    BM_CSM	(uint8_t)(1U<<CSM)

/* PHCKSR - PH FIFO Clock Gen. Status Register */
#define    FIFO_SW         0       /* FIFO Clock Switch */
#define    BM_FIFO_SW	(uint8_t)(1U<<FIFO_SW)

/* PHCRCR - Protocol Handler CRC Control Register */
#define    CRCFR           2       /* CRC ID Frame */
#define    BM_CRCFR	(uint8_t)(1U<<CRCFR)
#define    CRCMSB          3       /* CRC MSB */
#define    BM_CRCMSB	(uint8_t)(1U<<CRCMSB)
#define    CRCSE0          4       /* CRC Select bit 0 */
#define    BM_CRCSE0	(uint8_t)(1U<<CRCSE0)
#define    CRCSE1          5       /* CRC Select bit 1 */
#define    BM_CRCSE1	(uint8_t)(1U<<CRCSE1)
#define    STREN           6       /* Strobe Enable */
#define    BM_STREN	(uint8_t)(1U<<STREN)
#define    CRCEN           7       /* CRC Enable */
#define    BM_CRCEN	(uint8_t)(1U<<CRCEN)

/* PHCRPH - PH CRC Polynomial High Byte Register */
#define    PHCRP8          0       /*  */
#define    BM_PHCRP8	(uint8_t)(1U<<PHCRP8)
#define    PHCRP9          1       /*  */
#define    BM_PHCRP9	(uint8_t)(1U<<PHCRP9)
#define    PHCRP10         2       /*  */
#define    BM_PHCRP10	(uint8_t)(1U<<PHCRP10)
#define    PHCRP11         3       /*  */
#define    BM_PHCRP11	(uint8_t)(1U<<PHCRP11)
#define    PHCRP12         4       /*  */
#define    BM_PHCRP12	(uint8_t)(1U<<PHCRP12)
#define    PHCRP13         5       /*  */
#define    BM_PHCRP13	(uint8_t)(1U<<PHCRP13)
#define    PHCRP14         6       /*  */
#define    BM_PHCRP14	(uint8_t)(1U<<PHCRP14)
#define    PHCRP15         7       /*  */
#define    BM_PHCRP15	(uint8_t)(1U<<PHCRP15)

/* PHCRPL - PH CRC Polynomial Low Byte Register */
#define    PHCRP0          0       /*  */
#define    BM_PHCRP0	(uint8_t)(1U<<PHCRP0)
#define    PHCRP1          1       /*  */
#define    BM_PHCRP1	(uint8_t)(1U<<PHCRP1)
#define    PHCRP2          2       /*  */
#define    BM_PHCRP2	(uint8_t)(1U<<PHCRP2)
#define    PHCRP3          3       /*  */
#define    BM_PHCRP3	(uint8_t)(1U<<PHCRP3)
#define    PHCRP4          4       /*  */
#define    BM_PHCRP4	(uint8_t)(1U<<PHCRP4)
#define    PHCRP5          5       /*  */
#define    BM_PHCRP5	(uint8_t)(1U<<PHCRP5)
#define    PHCRP6          6       /*  */
#define    BM_PHCRP6	(uint8_t)(1U<<PHCRP6)
#define    PHCRP7          7       /*  */
#define    BM_PHCRP7	(uint8_t)(1U<<PHCRP7)

/* PHCSRH - PH CRC Checksum High Byte Register */
#define    PHCSR8          0       /*  */
#define    BM_PHCSR8	(uint8_t)(1U<<PHCSR8)
#define    PHCSR9          1       /*  */
#define    BM_PHCSR9	(uint8_t)(1U<<PHCSR9)
#define    PHCSR10         2       /*  */
#define    BM_PHCSR10	(uint8_t)(1U<<PHCSR10)
#define    PHCSR11         3       /*  */
#define    BM_PHCSR11	(uint8_t)(1U<<PHCSR11)
#define    PHCSR12         4       /*  */
#define    BM_PHCSR12	(uint8_t)(1U<<PHCSR12)
#define    PHCSR13         5       /*  */
#define    BM_PHCSR13	(uint8_t)(1U<<PHCSR13)
#define    PHCSR14         6       /*  */
#define    BM_PHCSR14	(uint8_t)(1U<<PHCSR14)
#define    PHCSR15         7       /*  */
#define    BM_PHCSR15	(uint8_t)(1U<<PHCSR15)

/* PHCSRL - PH CRC Checksum Low Byte Register */
#define    PHCSR0          0       /*  */
#define    BM_PHCSR0	(uint8_t)(1U<<PHCSR0)
#define    PHCSR1          1       /*  */
#define    BM_PHCSR1	(uint8_t)(1U<<PHCSR1)
#define    PHCSR2          2       /*  */
#define    BM_PHCSR2	(uint8_t)(1U<<PHCSR2)
#define    PHCSR3          3       /*  */
#define    BM_PHCSR3	(uint8_t)(1U<<PHCSR3)
#define    PHCSR4          4       /*  */
#define    BM_PHCSR4	(uint8_t)(1U<<PHCSR4)
#define    PHCSR5          5       /*  */
#define    BM_PHCSR5	(uint8_t)(1U<<PHCSR5)
#define    PHCSR6          6       /*  */
#define    BM_PHCSR6	(uint8_t)(1U<<PHCSR6)
#define    PHCSR7          7       /*  */
#define    BM_PHCSR7	(uint8_t)(1U<<PHCSR7)

/* PHCSTH - PH CRC Start Value High Byte Register */
#define    PHCST8          0       /*  */
#define    BM_PHCST8	(uint8_t)(1U<<PHCST8)
#define    PHCST9          1       /*  */
#define    BM_PHCST9	(uint8_t)(1U<<PHCST9)
#define    PHCST10         2       /*  */
#define    BM_PHCST10	(uint8_t)(1U<<PHCST10)
#define    PHCST11         3       /*  */
#define    BM_PHCST11	(uint8_t)(1U<<PHCST11)
#define    PHCST12         4       /*  */
#define    BM_PHCST12	(uint8_t)(1U<<PHCST12)
#define    PHCST13         5       /*  */
#define    BM_PHCST13	(uint8_t)(1U<<PHCST13)
#define    PHCST14         6       /*  */
#define    BM_PHCST14	(uint8_t)(1U<<PHCST14)
#define    PHCST15         7       /*  */
#define    BM_PHCST15	(uint8_t)(1U<<PHCST15)

/* PHCSTL - PH CRC Start Value Low Byte Register */
#define    PHCST0          0       /*  */
#define    BM_PHCST0	(uint8_t)(1U<<PHCST0)
#define    PHCST1          1       /*  */
#define    BM_PHCST1	(uint8_t)(1U<<PHCST1)
#define    PHCST2          2       /*  */
#define    BM_PHCST2	(uint8_t)(1U<<PHCST2)
#define    PHCST3          3       /*  */
#define    BM_PHCST3	(uint8_t)(1U<<PHCST3)
#define    PHCST4          4       /*  */
#define    BM_PHCST4	(uint8_t)(1U<<PHCST4)
#define    PHCST5          5       /*  */
#define    BM_PHCST5	(uint8_t)(1U<<PHCST5)
#define    PHCST6          6       /*  */
#define    BM_PHCST6	(uint8_t)(1U<<PHCST6)
#define    PHCST7          7       /*  */
#define    BM_PHCST7	(uint8_t)(1U<<PHCST7)

/* PHDFR - Protocol Handler Data Frame end Register */
#define    PHDF0           0       /* Protocol Handler Data Frame end bit 0 */
#define    BM_PHDF0	(uint8_t)(1U<<PHDF0)
#define    PHDF1           1       /* Protocol Handler Data Frame end bit 1 */
#define    BM_PHDF1	(uint8_t)(1U<<PHDF1)
#define    PHDF2           2       /* Protocol Handler Data Frame end bit 2 */
#define    BM_PHDF2	(uint8_t)(1U<<PHDF2)
#define    PHDF3           3       /* Protocol Handler Data Frame end bit 3 */
#define    BM_PHDF3	(uint8_t)(1U<<PHDF3)
#define    PHDF4           4       /* Protocol Handler Data Frame end bit 4 */
#define    BM_PHDF4	(uint8_t)(1U<<PHDF4)
#define    PHDF5           5       /* Protocol Handler Data Frame end bit 5 */
#define    BM_PHDF5	(uint8_t)(1U<<PHDF5)
#define    PHDF6           6       /* Protocol Handler Data Frame end bit 6 */
#define    BM_PHDF6	(uint8_t)(1U<<PHDF6)
#define    PHDF7           7       /* Protocol Handler Data Frame end bit 7 */
#define    BM_PHDF7	(uint8_t)(1U<<PHDF7)

/* PHFC - PH FIFO Configuration Register */
#define    FLC0            0       /* PH FIFO Fill-Level Configuration bit 0 */
#define    BM_FLC0	(uint8_t)(1U<<FLC0)
#define    FLC1            1       /* PH FIFO Fill-Level Configuration bit 1 */
#define    BM_FLC1	(uint8_t)(1U<<FLC1)
#define    FLC2            2       /* PH FIFO Fill-Level Configuration bit 2 */
#define    BM_FLC2	(uint8_t)(1U<<FLC2)
#define    FLC3            3       /* PH FIFO Fill-Level Configuration bit 3 */
#define    BM_FLC3	(uint8_t)(1U<<FLC3)
#define    FLC4            4       /* PH FIFO Fill-Level Configuration bit 4 */
#define    BM_FLC4	(uint8_t)(1U<<FLC4)
#define    FLC5            5       /* PH FIFO Fill-Level Configuration bit 5 */
#define    BM_FLC5	(uint8_t)(1U<<FLC5)
#define    FFMSB           6       /* PH FIFO MSB alignment bit */
#define    BM_FFMSB	(uint8_t)(1U<<FFMSB)
#define    DRA             7       /* PH FIFO Direct Read Access Operational Mode */
#define    BM_DRA	(uint8_t)(1U<<DRA)

/* PHFI - PH FIFO Interrupt Mask Register */
#define    FLIM            0       /* PH FIFO Fill-level Interrupt Mask */
#define    BM_FLIM	(uint8_t)(1U<<FLIM)
#define    ERIM            1       /* PH FIFO Error Interrupt Mask */
#define    BM_ERIM	(uint8_t)(1U<<ERIM)

/* PHFL - PH FIFO Fill Level Register */
#define    FLS0            0       /* PH FIFO Fill Level Status bit 0 */
#define    BM_FLS0	(uint8_t)(1U<<FLS0)
#define    FLS1            1       /* PH FIFO Fill Level Status bit 1 */
#define    BM_FLS1	(uint8_t)(1U<<FLS1)
#define    FLS2            2       /* PH FIFO Fill Level Status bit 2 */
#define    BM_FLS2	(uint8_t)(1U<<FLS2)
#define    FLS3            3       /* PH FIFO Fill Level Status bit 3 */
#define    BM_FLS3	(uint8_t)(1U<<FLS3)
#define    FLS4            4       /* PH FIFO Fill Level Status bit 4 */
#define    BM_FLS4	(uint8_t)(1U<<FLS4)
#define    FLS5            5       /* PH FIFO Fill Level Status bit 5 */
#define    BM_FLS5	(uint8_t)(1U<<FLS5)
#define    PHCLR           7       /* PH FIFO Clear */
#define    BM_PHCLR	(uint8_t)(1U<<PHCLR)

/* PHFR - Protocol Handler Flag Register */
#define    CRCEF           0       /* PH CRC Error Status Flag */
#define    BM_CRCEF	(uint8_t)(1U<<CRCEF)
#define    PHTBLF          1       /* Protocol Handler Telegram Bit Length Flag */
#define    BM_PHTBLF	(uint8_t)(1U<<PHTBLF)
#define    PHDFF           2       /* Protocol Handler Date Frame Flag */
#define    BM_PHDFF	(uint8_t)(1U<<PHDFF)
#define    PHIDFF          3       /* Protocol Handler ID Frame Flag */
#define    BM_PHIDFF	(uint8_t)(1U<<PHIDFF)
#define    PHID0F          4       /* Protocol Handler IDentifier 0 Flag */
#define    BM_PHID0F	(uint8_t)(1U<<PHID0F)
#define    PHID1F          5       /* Protocol Handler IDentifier 1 Flag */
#define    BM_PHID1F	(uint8_t)(1U<<PHID1F)

/* PHFRP - PH FIFO Read Pointer */
#define    FRP0            0       /* PH FIFO Read Pointer bit 0 */
#define    BM_FRP0	(uint8_t)(1U<<FRP0)
#define    FRP1            1       /* PH FIFO Read Pointer bit 1 */
#define    BM_FRP1	(uint8_t)(1U<<FRP1)
#define    FRP2            2       /* PH FIFO Read Pointer bit 2 */
#define    BM_FRP2	(uint8_t)(1U<<FRP2)
#define    FRP3            3       /* PH FIFO Read Pointer bit 3 */
#define    BM_FRP3	(uint8_t)(1U<<FRP3)
#define    FRP4            4       /* PH FIFO Read Pointer bit 4 */
#define    BM_FRP4	(uint8_t)(1U<<FRP4)
#define    FRP5            5       /* PH FIFO Read Pointer bit 5 */
#define    BM_FRP5	(uint8_t)(1U<<FRP5)

/* PHFS - Protocol Handler FIFO Status Register */
#define    FLRF            0       /* PH FIFO Fill-Level Reached Status Flag */
#define    BM_FLRF	(uint8_t)(1U<<FLRF)
#define    FUFL            1       /* PH FIFO Underflow Flag */
#define    BM_FUFL	(uint8_t)(1U<<FUFL)
#define    FOFL            2       /* PH FIFO Overflow Flag */
#define    BM_FOFL	(uint8_t)(1U<<FOFL)

/* PHFWP - PH FIFO Write Pointer */
#define    FWP0            0       /* PH FIFO Write Pointer bit 0 */
#define    BM_FWP0	(uint8_t)(1U<<FWP0)
#define    FWP1            1       /* PH FIFO Write Pointer bit 1 */
#define    BM_FWP1	(uint8_t)(1U<<FWP1)
#define    FWP2            2       /* PH FIFO Write Pointer bit 2 */
#define    BM_FWP2	(uint8_t)(1U<<FWP2)
#define    FWP3            3       /* PH FIFO Write Pointer bit 3 */
#define    BM_FWP3	(uint8_t)(1U<<FWP3)
#define    FWP4            4       /* PH FIFO Write Pointer bit 4 */
#define    BM_FWP4	(uint8_t)(1U<<FWP4)
#define    FWP5            5       /* PH FIFO Write Pointer bit 5 */
#define    BM_FWP5	(uint8_t)(1U<<FWP5)

/* PHID0L - PH Identifier 0 Length Register */
#define    ID0FS0          0       /* Identifier 0 Frame Select bit 0 */
#define    BM_ID0FS0	(uint8_t)(1U<<ID0FS0)
#define    ID0FS1          1       /* Identifier 0 Frame Select bit 1 */
#define    BM_ID0FS1	(uint8_t)(1U<<ID0FS1)
#define    ID0FS2          2       /* Identifier 0 Frame Select bit 2 */
#define    BM_ID0FS2	(uint8_t)(1U<<ID0FS2)
#define    ID0FS3          3       /* Identifier 0 Frame Select bit 3 */
#define    BM_ID0FS3	(uint8_t)(1U<<ID0FS3)
#define    ID0FS4          4       /* Identifier 0 Frame Select bit 4 */
#define    BM_ID0FS4	(uint8_t)(1U<<ID0FS4)
#define    ID0FS5          5       /* Identifier 0 Frame Select bit 5 */
#define    BM_ID0FS5	(uint8_t)(1U<<ID0FS5)

/* PHID1L - PH Identifier 1 Length Register */
#define    ID1FS0          0       /* Identifier 0 Frame Select bit 0 */
#define    BM_ID1FS0	(uint8_t)(1U<<ID1FS0)
#define    ID1FS1          1       /* Identifier 0 Frame Select bit 1 */
#define    BM_ID1FS1	(uint8_t)(1U<<ID1FS1)
#define    ID1FS2          2       /* Identifier 0 Frame Select bit 2 */
#define    BM_ID1FS2	(uint8_t)(1U<<ID1FS2)
#define    ID1FS3          3       /* Identifier 0 Frame Select bit 3 */
#define    BM_ID1FS3	(uint8_t)(1U<<ID1FS3)
#define    ID1FS4          4       /* Identifier 0 Frame Select bit 4 */
#define    BM_ID1FS4	(uint8_t)(1U<<ID1FS4)
#define    ID1FS5          5       /* Identifier 0 Frame Select bit 5 */
#define    BM_ID1FS5	(uint8_t)(1U<<ID1FS5)

