camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* PHIDFR - Protocol Handler ID Frame Register */
#define    RDFS0           0       /*  */
#define    BM_RDFS0	(uint8_t)(1U<<RDFS0)
#define    RDFS1           1       /*  */
#define    BM_RDFS1	(uint8_t)(1U<<RDFS1)
#define    RDFS2           2       /*  */
#define    BM_RDFS2	(uint8_t)(1U<<RDFS2)
#define    RDFS3           3       /*  */
#define    BM_RDFS3	(uint8_t)(1U<<RDFS3)
#define    RDFS4           4       /*  */
#define    BM_RDFS4	(uint8_t)(1U<<RDFS4)
#define    RDFS5           5       /*  */
#define    BM_RDFS5	(uint8_t)(1U<<RDFS5)
#define    RDFS6           6       /*  */
#define    BM_RDFS6	(uint8_t)(1U<<RDFS6)
#define    RDFS7           7       /*  */
#define    BM_RDFS7	(uint8_t)(1U<<RDFS7)

/* PHIMR - Protocol Handler Interrupt Mask Register */
#define    PHTBLIM         1       /* Protocol Handler Telegram Bit Length Interrupt Mask */
#define    BM_PHTBLIM	(uint8_t)(1U<<PHTBLIM)
#define    PHDFIM          2       /* Protocol Handler Date Frame Interrupt Mask */
#define    BM_PHDFIM	(uint8_t)(1U<<PHDFIM)
#define    PHIDFIM         3       /* Protocol Handler ID Frame Interrupt Mask */
#define    BM_PHIDFIM	(uint8_t)(1U<<PHIDFIM)
#define    PHID0IM         4       /* Protocol Handler IDentifier 0 Interrupt Mask */
#define    BM_PHID0IM	(uint8_t)(1U<<PHID0IM)
#define    PHID1IM         5       /* Protocol Handler IDentifier 1 Interrupt Mask */
#define    BM_PHID1IM	(uint8_t)(1U<<PHID1IM)

/* PHTBLR - Protocol Handler Telegram Bit Length Register */
#define    PHTBL0          0       /*  */
#define    BM_PHTBL0	(uint8_t)(1U<<PHTBL0)
#define    PHTBL1          1       /*  */
#define    BM_PHTBL1	(uint8_t)(1U<<PHTBL1)
#define    PHTBL2          2       /*  */
#define    BM_PHTBL2	(uint8_t)(1U<<PHTBL2)
#define    PHTBL3          3       /*  */
#define    BM_PHTBL3	(uint8_t)(1U<<PHTBL3)
#define    PHTBL4          4       /*  */
#define    BM_PHTBL4	(uint8_t)(1U<<PHTBL4)
#define    PHTBL5          5       /*  */
#define    BM_PHTBL5	(uint8_t)(1U<<PHTBL5)
#define    PHTBL6          6       /*  */
#define    BM_PHTBL6	(uint8_t)(1U<<PHTBL6)
#define    PHTBL7          7       /*  */
#define    BM_PHTBL7	(uint8_t)(1U<<PHTBL7)

/* PHTCMR - Protocol Handler Timer Control Mode Register */
#define    PHPS0           0       /* PH timer Prescaler Select bit 0 */
#define    BM_PHPS0	(uint8_t)(1U<<PHPS0)
#define    PHPS1           1       /* PH timer Prescaler Select bit 1 */
#define    BM_PHPS1	(uint8_t)(1U<<PHPS1)
#define    PHPS2           2       /* PH timer Prescaler Select bit 2 */
#define    BM_PHPS2	(uint8_t)(1U<<PHPS2)
#define    PHCRM           3       /* PH timer Compare Reset Mask */
#define    BM_PHCRM	(uint8_t)(1U<<PHCRM)
#define    PHCIM           4       /* PH timer Compare Interrupt Mask */
#define    BM_PHCIM	(uint8_t)(1U<<PHCIM)
#define    PHRES           5       /* PH timer Reset */
#define    BM_PHRES	(uint8_t)(1U<<PHRES)
#define    PHSM            6       /* PH timer Start Mode */
#define    BM_PHSM	(uint8_t)(1U<<PHSM)
#define    PHTE            7       /* PH Timer Enable */
#define    BM_PHTE	(uint8_t)(1U<<PHTE)

/* PHTCOR - Protocol Handler Timer Compare Register */
#define    PHTCOR0         0       /*  */
#define    BM_PHTCOR0	(uint8_t)(1U<<PHTCOR0)
#define    PHTCOR1         1       /*  */
#define    BM_PHTCOR1	(uint8_t)(1U<<PHTCOR1)
#define    PHTCOR2         2       /*  */
#define    BM_PHTCOR2	(uint8_t)(1U<<PHTCOR2)
#define    PHTCOR3         3       /*  */
#define    BM_PHTCOR3	(uint8_t)(1U<<PHTCOR3)
#define    PHTCOR4         4       /*  */
#define    BM_PHTCOR4	(uint8_t)(1U<<PHTCOR4)
#define    PHTCOR5         5       /*  */
#define    BM_PHTCOR5	(uint8_t)(1U<<PHTCOR5)
#define    PHTCOR6         6       /*  */
#define    BM_PHTCOR6	(uint8_t)(1U<<PHTCOR6)
#define    PHTCOR7         7       /*  */
#define    BM_PHTCOR7	(uint8_t)(1U<<PHTCOR7)

/* PHTEMR - Protocol Handler Timer Event Mask Register */
#define    ID0EM           0       /* ID0 Event Mask */
#define    BM_ID0EM	(uint8_t)(1U<<ID0EM)
#define    ID1EM           1       /* ID1 Event Mask */
#define    BM_ID1EM	(uint8_t)(1U<<ID1EM)
#define    IDFEM           2       /* Identifier Frame Event Mask */
#define    BM_IDFEM	(uint8_t)(1U<<IDFEM)
#define    DFEM            3       /* Data Frame end reached Event Mask */
#define    BM_DFEM	(uint8_t)(1U<<DFEM)
#define    TBLEM           4       /* Telegram Bit Length reached Event Mask */
#define    BM_TBLEM	(uint8_t)(1U<<TBLEM)
#define    FLEM            5       /* Fill Level reached Event Mask */
#define    BM_FLEM	(uint8_t)(1U<<FLEM)
#define    EOFEM           6       /* End OF telegram Event Mask */
#define    BM_EOFEM	(uint8_t)(1U<<EOFEM)
#define    PHCOF           7       /* PH timer Compare Flag */
#define    BM_PHCOF	(uint8_t)(1U<<PHCOF)


/* ***** LF_RSSI ********************** */
/* LFRSC1H - LF RSSI Value Channel 1 High Byte Register */
#define    LFRSC18         0       /* LF RSSI Value Channel 1 bit 8 */
#define    BM_LFRSC18	(uint8_t)(1U<<LFRSC18)
#define    LFRSC19         1       /* LF RSSI Value Channel 1 bit 9 */
#define    BM_LFRSC19	(uint8_t)(1U<<LFRSC19)
#define    LFRSC110        2       /* LF RSSI Value Channel 1 bit 10 */
#define    BM_LFRSC110	(uint8_t)(1U<<LFRSC110)
#define    LFRSC111        3       /* LF RSSI Value Channel 1 bit 11 */
#define    BM_LFRSC111	(uint8_t)(1U<<LFRSC111)
#define    LFRSC112        4       /* LF RSSI Value Channel 1 bit 12 */
#define    BM_LFRSC112	(uint8_t)(1U<<LFRSC112)
#define    LFRSC113        5       /* LF RSSI Value Channel 1 bit 13 */
#define    BM_LFRSC113	(uint8_t)(1U<<LFRSC113)
#define    LFRSC114        6       /* LF RSSI Value Channel 1 bit 14 */
#define    BM_LFRSC114	(uint8_t)(1U<<LFRSC114)
#define    LFRSC115        7       /* LF RSSI Value Channel 1 bit 15 */
#define    BM_LFRSC115	(uint8_t)(1U<<LFRSC115)

/* LFRSC1L - LF RSSI Value Channel 1 Low Byte Register */
#define    LFRSC10         0       /* LF RSSI Value Channel 1 bit 0 */
#define    BM_LFRSC10	(uint8_t)(1U<<LFRSC10)
#define    LFRSC11         1       /* LF RSSI Value Channel 1 bit 1 */
#define    BM_LFRSC11	(uint8_t)(1U<<LFRSC11)
#define    LFRSC12         2       /* LF RSSI Value Channel 1 bit 2 */
#define    BM_LFRSC12	(uint8_t)(1U<<LFRSC12)
#define    LFRSC13         3       /* LF RSSI Value Channel 1 bit 3 */
#define    BM_LFRSC13	(uint8_t)(1U<<LFRSC13)
#define    LFRSC14         4       /* LF RSSI Value Channel 1 bit 4 */
#define    BM_LFRSC14	(uint8_t)(1U<<LFRSC14)
#define    LFRSC15         5       /* LF RSSI Value Channel 1 bit 5 */
#define    BM_LFRSC15	(uint8_t)(1U<<LFRSC15)
#define    LFRSC16         6       /* LF RSSI Value Channel 1 bit 6 */
#define    BM_LFRSC16	(uint8_t)(1U<<LFRSC16)
#define    LFRSC17         7       /* LF RSSI Value Channel 1 bit 7 */
#define    BM_LFRSC17	(uint8_t)(1U<<LFRSC17)

/* LFRSC2H - LF RSSI Value Channel 2 High Byte Register */
#define    LFRSC28         0       /* LF RSSI Value Channel 2 bit 8 */
#define    BM_LFRSC28	(uint8_t)(1U<<LFRSC28)
#define    LFRSC29         1       /* LF RSSI Value Channel 2 bit 9 */
#define    BM_LFRSC29	(uint8_t)(1U<<LFRSC29)
#define    LFRSC210        2       /* LF RSSI Value Channel 2 bit 10 */
#define    BM_LFRSC210	(uint8_t)(1U<<LFRSC210)
#define    LFRSC211        3       /* LF RSSI Value Channel 2 bit 11 */
#define    BM_LFRSC211	(uint8_t)(1U<<LFRSC211)
#define    LFRSC212        4       /* LF RSSI Value Channel 2 bit 12 */
#define    BM_LFRSC212	(uint8_t)(1U<<LFRSC212)
#define    LFRSC213        5       /* LF RSSI Value Channel 2 bit 13 */
#define    BM_LFRSC213	(uint8_t)(1U<<LFRSC213)
#define    LFRSC214        6       /* LF RSSI Value Channel 2 bit 14 */
#define    BM_LFRSC214	(uint8_t)(1U<<LFRSC214)
#define    LFRSC215        7       /* LF RSSI Value Channel 2 bit 15 */
#define    BM_LFRSC215	(uint8_t)(1U<<LFRSC215)

/* LFRSC2L - LF RSSI Value Channel 2 Low Byte Register */
#define    LFRSC20         0       /* LF RSSI Value Channel 2 bit 0 */
#define    BM_LFRSC20	(uint8_t)(1U<<LFRSC20)
#define    LFRSC21         1       /* LF RSSI Value Channel 2 bit 1 */
#define    BM_LFRSC21	(uint8_t)(1U<<LFRSC21)
#define    LFRSC22         2       /* LF RSSI Value Channel 2 bit 2 */
#define    BM_LFRSC22	(uint8_t)(1U<<LFRSC22)
#define    LFRSC23         3       /* LF RSSI Value Channel 2 bit 3 */
#define    BM_LFRSC23	(uint8_t)(1U<<LFRSC23)
#define    LFRSC24         4       /* LF RSSI Value Channel 2 bit 4 */
#define    BM_LFRSC24	(uint8_t)(1U<<LFRSC24)
#define    LFRSC25         5       /* LF RSSI Value Channel 2 bit 5 */
#define    BM_LFRSC25	(uint8_t)(1U<<LFRSC25)
#define    LFRSC26         6       /* LF RSSI Value Channel 2 bit 6 */
#define    BM_LFRSC26	(uint8_t)(1U<<LFRSC26)
#define    LFRSC27         7       /* LF RSSI Value Channel 2 bit 7 */
#define    BM_LFRSC27	(uint8_t)(1U<<LFRSC27)

/* LFRSC3H - LF RSSI Value Channel 3 High Byte Register */
#define    LFRSC38         0       /* LF RSSI Value Channel 3 bit 8 */
#define    BM_LFRSC38	(uint8_t)(1U<<LFRSC38)
#define    LFRSC39         1       /* LF RSSI Value Channel 3 bit 9 */
#define    BM_LFRSC39	(uint8_t)(1U<<LFRSC39)
#define    LFRSC310        2       /* LF RSSI Value Channel 3 bit 10 */
#define    BM_LFRSC310	(uint8_t)(1U<<LFRSC310)
#define    LFRSC311        3       /* LF RSSI Value Channel 3 bit 11 */
#define    BM_LFRSC311	(uint8_t)(1U<<LFRSC311)
#define    LFRSC312        4       /* LF RSSI Value Channel 3 bit 12 */
#define    BM_LFRSC312	(uint8_t)(1U<<LFRSC312)
#define    LFRSC313        5       /* LF RSSI Value Channel 3 bit 13 */
#define    BM_LFRSC313	(uint8_t)(1U<<LFRSC313)
#define    LFRSC314        6       /* LF RSSI Value Channel 3 bit 14 */
#define    BM_LFRSC314	(uint8_t)(1U<<LFRSC314)
#define    LFRSC315        7       /* LF RSSI Value Channel 3 bit 15 */
#define    BM_LFRSC315	(uint8_t)(1U<<LFRSC315)

