camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* LFRSC3L - LF RSSI Value Channel 3 Low Byte Register */
#define    LFRSC30         0       /* LF RSSI Value Channel 3 bit 0 */
#define    BM_LFRSC30	(uint8_t)(1U<<LFRSC30)
#define    LFRSC31         1       /* LF RSSI Value Channel 3 bit 1 */
#define    BM_LFRSC31	(uint8_t)(1U<<LFRSC31)
#define    LFRSC32         2       /* LF RSSI Value Channel 3 bit 2 */
#define    BM_LFRSC32	(uint8_t)(1U<<LFRSC32)
#define    LFRSC33         3       /* LF RSSI Value Channel 3 bit 3 */
#define    BM_LFRSC33	(uint8_t)(1U<<LFRSC33)
#define    LFRSC34         4       /* LF RSSI Value Channel 3 bit 4 */
#define    BM_LFRSC34	(uint8_t)(1U<<LFRSC34)
#define    LFRSC35         5       /* LF RSSI Value Channel 3 bit 5 */
#define    BM_LFRSC35	(uint8_t)(1U<<LFRSC35)
#define    LFRSC36         6       /* LF RSSI Value Channel 3 bit 6 */
#define    BM_LFRSC36	(uint8_t)(1U<<LFRSC36)
#define    LFRSC37         7       /* LF RSSI Value Channel 3 bit 7 */
#define    BM_LFRSC37	(uint8_t)(1U<<LFRSC37)

/* LFRSCR - LF RSSI Control Register */
#define    LFRSA0          0       /* LF RSSI Average Number bit 0 */
#define    BM_LFRSA0	(uint8_t)(1U<<LFRSA0)
#define    LFRSA1          1       /* LF RSSI Average Number bit 1 */
#define    BM_LFRSA1	(uint8_t)(1U<<LFRSA1)
#define    LFRSA2          2       /* LF RSSI Average Number bit 2 */
#define    BM_LFRSA2	(uint8_t)(1U<<LFRSA2)
#define    LFRSMS          3       /* LF RSSI Measurement Start */
#define    BM_LFRSMS	(uint8_t)(1U<<LFRSMS)
#define    LFRSIM          4       /* LF RSSI Interrupt Mask */
#define    BM_LFRSIM	(uint8_t)(1U<<LFRSIM)
#define    LFRSRS          5       /* LF RSSI Reset Select */
#define    BM_LFRSRS	(uint8_t)(1U<<LFRSRS)

/* LFRSFR - LF RSSI FLAG Register */
#define    LFRSMF          0       /* LF RSSI Measure Flag */
#define    BM_LFRSMF	(uint8_t)(1U<<LFRSMF)
#define    LFRSTO1         1       /* LF RSSI Time Out channel 1 */
#define    BM_LFRSTO1	(uint8_t)(1U<<LFRSTO1)
#define    LFRSTO2         2       /* LF RSSI Time Out channel 2 */
#define    BM_LFRSTO2	(uint8_t)(1U<<LFRSTO2)
#define    LFRSTO3         3       /* LF RSSI Time Out channel 3 */
#define    BM_LFRSTO3	(uint8_t)(1U<<LFRSTO3)

/* LFRSISR - LF RSSI Initial Step Register */
#define    LFRSIS0         0       /* LF RSSI initial value bit 0 */
#define    BM_LFRSIS0	(uint8_t)(1U<<LFRSIS0)
#define    LFRSIS1         1       /* LF RSSI initial value bit 1 */
#define    BM_LFRSIS1	(uint8_t)(1U<<LFRSIS1)
#define    LFRSIS2         2       /* LF RSSI initial value bit 2 */
#define    BM_LFRSIS2	(uint8_t)(1U<<LFRSIS2)
#define    LFRSIS3         3       /* LF RSSI initial value bit 3 */
#define    BM_LFRSIS3	(uint8_t)(1U<<LFRSIS3)
#define    LFRSIS4         4       /* LF RSSI initial value bit 4 */
#define    BM_LFRSIS4	(uint8_t)(1U<<LFRSIS4)
#define    LFRSIS5         5       /* LF RSSI initial value bit 5 */
#define    BM_LFRSIS5	(uint8_t)(1U<<LFRSIS5)
#define    RESIS           6       /* Reset the LFRSIS Register Address */
#define    BM_RESIS	(uint8_t)(1U<<RESIS)
#define    LFRSNIS         7       /* LF RSSI No Initial Step */
#define    BM_LFRSNIS	(uint8_t)(1U<<LFRSNIS)

/* LFRSMR - LF RSSI Mode Register */
#define    LFRSM0          0       /* LF RSSI Mode bit 0 */
#define    BM_LFRSM0	(uint8_t)(1U<<LFRSM0)
#define    LFRSM1          1       /* LF RSSI Mode bit 1 */
#define    BM_LFRSM1	(uint8_t)(1U<<LFRSM1)
#define    LFRSM2          2       /* LF RSSI Mode bit 2 */
#define    BM_LFRSM2	(uint8_t)(1U<<LFRSM2)
#define    LFRSM3          3       /* LF RSSI Mode bit 3 */
#define    BM_LFRSM3	(uint8_t)(1U<<LFRSM3)
#define    LFRSCM          4       /* LF RSSI Current Mode select */
#define    BM_LFRSCM	(uint8_t)(1U<<LFRSCM)
#define    LFRSFD          5       /* LF RSSI Full average Data select */
#define    BM_LFRSFD	(uint8_t)(1U<<LFRSFD)
#define    LFRSD0          6       /* LF RSSI T2 delay select bit 0 */
#define    BM_LFRSD0	(uint8_t)(1U<<LFRSD0)
#define    LFRSD1          7       /* LF RSSI T2 delay select bit 1 */
#define    BM_LFRSD1	(uint8_t)(1U<<LFRSD1)

/* LFRSS1R - LF RSSI Setting 1 Register */
#define    RSD_OK_TI0      0       /* RSD OK delay bit 0 */
#define    BM_RSD_OK_TI0	(uint8_t)(1U<<RSD_OK_TI0)
#define    RSD_OK_TI1      1       /* RSD OK delay bit 1 */
#define    BM_RSD_OK_TI1	(uint8_t)(1U<<RSD_OK_TI1)
#define    CK_TI0          2       /* RSSI step direction decision time bit 0 */
#define    BM_CK_TI0	(uint8_t)(1U<<CK_TI0)
#define    CK_TI1          3       /* RSSI step direction decision time bit 1 */
#define    BM_CK_TI1	(uint8_t)(1U<<CK_TI1)
#define    RS_STEP0        4       /* Initial RSSI step size bit 0 */
#define    BM_RS_STEP0	(uint8_t)(1U<<RS_STEP0)
#define    RS_STEP1        5       /* Initial RSSI step size bit 1 */
#define    BM_RS_STEP1	(uint8_t)(1U<<RS_STEP1)
#define    DEL10           6       /* Delay 1 Select bit 0 */
#define    BM_DEL10	(uint8_t)(1U<<DEL10)
#define    DEL11           7       /* Delay 1 Select bit 1 */
#define    BM_DEL11	(uint8_t)(1U<<DEL11)

/* LFRSS2R - LF RSSI Setting 2 Register */
#define    DEL20           0       /* Delay 2 Select bit 0 */
#define    BM_DEL20	(uint8_t)(1U<<DEL20)
#define    DEL21           1       /* Delay 2 Select bit 1 */
#define    BM_DEL21	(uint8_t)(1U<<DEL21)
#define    DEL30           2       /* Delay 3 Select bit 0 */
#define    BM_DEL30	(uint8_t)(1U<<DEL30)
#define    DEL31           3       /* Delay 3 Select bit 1 */
#define    BM_DEL31	(uint8_t)(1U<<DEL31)
#define    DEL40           4       /* Delay 4 Select bit 0 */
#define    BM_DEL40	(uint8_t)(1U<<DEL40)
#define    DEL41           5       /* Delay 4 Select bit 1 */
#define    BM_DEL41	(uint8_t)(1U<<DEL41)
#define    LFRSNF          7       /* LF RSSI No Finish */
#define    BM_LFRSNF	(uint8_t)(1U<<LFRSNF)


/* ***** MEM ************************** */
/* EEST - EEPROM Status Register */
#define    EESYN0          0       /* EEPROM Syndrome bit 0 */
#define    BM_EESYN0	(uint8_t)(1U<<EESYN0)
#define    EESYN1          1       /* EEPROM Syndrome bit 1 */
#define    BM_EESYN1	(uint8_t)(1U<<EESYN1)
#define    EESYN2          2       /* EEPROM Syndrome bit 2 */
#define    BM_EESYN2	(uint8_t)(1U<<EESYN2)
#define    EESYN3          3       /* EEPROM Syndrome bit 3 */
#define    BM_EESYN3	(uint8_t)(1U<<EESYN3)

/* PGMST - Program Memory Status Register */
#define    PGMSYN0         0       /* Program Memory Syndrome bit 0 */
#define    BM_PGMSYN0	(uint8_t)(1U<<PGMSYN0)
#define    PGMSYN1         1       /* Program Memory Syndrome bit 1 */
#define    BM_PGMSYN1	(uint8_t)(1U<<PGMSYN1)
#define    PGMSYN2         2       /* Program Memory Syndrome bit 2 */
#define    BM_PGMSYN2	(uint8_t)(1U<<PGMSYN2)
#define    PGMSYN3         3       /* Program Memory Syndrome bit 3 */
#define    BM_PGMSYN3	(uint8_t)(1U<<PGMSYN3)
#define    PGMSYN4         4       /* Program Memory Syndrome bit 4 */
#define    BM_PGMSYN4	(uint8_t)(1U<<PGMSYN4)


/* ***** PORTB ************************ */
/* DDRB - Port B Data Direction Register */
#define    DDRB0           0       /* Port B Data Direction Register bit 0 */
#define    BM_DDRB0	(uint8_t)(1U<<DDRB0)
#define    DDRB1           1       /* Port B Data Direction Register bit 1 */
#define    BM_DDRB1	(uint8_t)(1U<<DDRB1)
#define    DDRB2           2       /* Port B Data Direction Register bit 2 */
#define    BM_DDRB2	(uint8_t)(1U<<DDRB2)
#define    DDRB3           3       /* Port B Data Direction Register bit 3 */
#define    BM_DDRB3	(uint8_t)(1U<<DDRB3)
#define    DDRB4           4       /* Port B Data Direction Register bit 4 */
#define    BM_DDRB4	(uint8_t)(1U<<DDRB4)
#define    DDRB5           5       /* Port B Data Direction Register bit 5 */
#define    BM_DDRB5	(uint8_t)(1U<<DDRB5)
#define    DDRB6           6       /* Port B Data Direction Register bit 6 */
#define    BM_DDRB6	(uint8_t)(1U<<DDRB6)
#define    DDRB7           7       /* Port B Data Direction Register bit 7 */
#define    BM_DDRB7	(uint8_t)(1U<<DDRB7)

