camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* PINB - Port B Input Pins */
#define    PINB0           0       /* Port B Input Pins bit 0 */
#define    BM_PINB0	(uint8_t)(1U<<PINB0)
#define    PINB1           1       /* Port B Input Pins bit 1 */
#define    BM_PINB1	(uint8_t)(1U<<PINB1)
#define    PINB2           2       /* Port B Input Pins bit 2 */
#define    BM_PINB2	(uint8_t)(1U<<PINB2)
#define    PINB3           3       /* Port B Input Pins bit 3 */
#define    BM_PINB3	(uint8_t)(1U<<PINB3)
#define    PINB4           4       /* Port B Input Pins bit 4 */
#define    BM_PINB4	(uint8_t)(1U<<PINB4)
#define    PINB5           5       /* Port B Input Pins bit 5 */
#define    BM_PINB5	(uint8_t)(1U<<PINB5)
#define    PINB6           6       /* Port B Input Pins bit 6 */
#define    BM_PINB6	(uint8_t)(1U<<PINB6)
#define    PINB7           7       /* Port B Input Pins bit 7 */
#define    BM_PINB7	(uint8_t)(1U<<PINB7)

/* PORTB - Port B Data Register */
#define    PORTB0          0       /* Port B Data Register bit 0 */
#define    BM_PORTB0	(uint8_t)(1U<<PORTB0)
#define    PB0             0       /* For compatibility */
#define    BM_PB0	(uint8_t)(1U<<PB0)
#define    PORTB1          1       /* Port B Data Register bit 1 */
#define    BM_PORTB1	(uint8_t)(1U<<PORTB1)
#define    PB1             1       /* For compatibility */
#define    BM_PB1	(uint8_t)(1U<<PB1)
#define    PORTB2          2       /* Port B Data Register bit 2 */
#define    BM_PORTB2	(uint8_t)(1U<<PORTB2)
#define    PB2             2       /* For compatibility */
#define    BM_PB2	(uint8_t)(1U<<PB2)
#define    PORTB3          3       /* Port B Data Register bit 3 */
#define    BM_PORTB3	(uint8_t)(1U<<PORTB3)
#define    PB3             3       /* For compatibility */
#define    BM_PB3	(uint8_t)(1U<<PB3)
#define    PORTB4          4       /* Port B Data Register bit 4 */
#define    BM_PORTB4	(uint8_t)(1U<<PORTB4)
#define    PB4             4       /* For compatibility */
#define    BM_PB4	(uint8_t)(1U<<PB4)
#define    PORTB5          5       /* Port B Data Register bit 5 */
#define    BM_PORTB5	(uint8_t)(1U<<PORTB5)
#define    PB5             5       /* For compatibility */
#define    BM_PB5	(uint8_t)(1U<<PB5)
#define    PORTB6          6       /* Port B Data Register bit 6 */
#define    BM_PORTB6	(uint8_t)(1U<<PORTB6)
#define    PB6             6       /* For compatibility */
#define    BM_PB6	(uint8_t)(1U<<PB6)
#define    PORTB7          7       /* Port B Data Register bit 7 */
#define    BM_PORTB7	(uint8_t)(1U<<PORTB7)
#define    PB7             7       /* For compatibility */
#define    BM_PB7	(uint8_t)(1U<<PB7)


/* ***** PORTC ************************ */
/* DDRC - Port C Data Direction Register */
#define    DDRC0           0       /* Port C Data Direction Register bit 0 */
#define    BM_DDRC0	(uint8_t)(1U<<DDRC0)
#define    DDRC1           1       /* Port C Data Direction Register bit 1 */
#define    BM_DDRC1	(uint8_t)(1U<<DDRC1)
#define    DDRC2           2       /* Port C Data Direction Register bit 2 */
#define    BM_DDRC2	(uint8_t)(1U<<DDRC2)

/* PINC - Port C Input Pins */
#define    PINC0           0       /* Port C Input Pins bit 0 */
#define    BM_PINC0	(uint8_t)(1U<<PINC0)
#define    PINC1           1       /* Port C Input Pins bit 1 */
#define    BM_PINC1	(uint8_t)(1U<<PINC1)
#define    PINC2           2       /* Port C Input Pins bit 2 */
#define    BM_PINC2	(uint8_t)(1U<<PINC2)

/* PORTC - Port C Data Register */
#define    PORTC0          0       /* Port C Data Register bit 0 */
#define    BM_PORTC0	(uint8_t)(1U<<PORTC0)
#define    PC0             0       /* For compatibility */
#define    BM_PC0	(uint8_t)(1U<<PC0)
#define    PORTC1          1       /* Port C Data Register bit 1 */
#define    BM_PORTC1	(uint8_t)(1U<<PORTC1)
#define    PC1             1       /* For compatibility */
#define    BM_PC1	(uint8_t)(1U<<PC1)
#define    PORTC2          2       /* Port C Data Register bit 2 */
#define    BM_PORTC2	(uint8_t)(1U<<PORTC2)
#define    PC2             2       /* For compatibility */
#define    BM_PC2	(uint8_t)(1U<<PC2)


/* ***** PORTD ************************ */
/* DDRD - Port D Data Direction Register */
#define    DDRD0           0       /* Port D Data Direction Register bit 0 */
#define    BM_DDRD0	(uint8_t)(1U<<DDRD0)
#define    DDRD1           1       /* Port D Data Direction Register bit 1 */
#define    BM_DDRD1	(uint8_t)(1U<<DDRD1)
#define    DDRD2           2       /* Port D Data Direction Register bit 2 */
#define    BM_DDRD2	(uint8_t)(1U<<DDRD2)
#define    DDRD3           3       /* Port D Data Direction Register bit 3 */
#define    BM_DDRD3	(uint8_t)(1U<<DDRD3)
#define    DDRD4           4       /* Port D Data Direction Register bit 4 */
#define    BM_DDRD4	(uint8_t)(1U<<DDRD4)
#define    DDRD5           5       /* Port D Data Direction Register bit 5 */
#define    BM_DDRD5	(uint8_t)(1U<<DDRD5)
#define    DDRD6           6       /* Port D Data Direction Register bit 6 */
#define    BM_DDRD6	(uint8_t)(1U<<DDRD6)
#define    DDRD7           7       /* Port D Data Direction Register bit 7 */
#define    BM_DDRD7	(uint8_t)(1U<<DDRD7)

/* PIND - Port D Input Pins */
#define    PIND0           0       /* Port D Input Pins bit 0 */
#define    BM_PIND0	(uint8_t)(1U<<PIND0)
#define    PIND1           1       /* Port D Input Pins bit 1 */
#define    BM_PIND1	(uint8_t)(1U<<PIND1)
#define    PIND2           2       /* Port D Input Pins bit 2 */
#define    BM_PIND2	(uint8_t)(1U<<PIND2)
#define    PIND3           3       /* Port D Input Pins bit 3 */
#define    BM_PIND3	(uint8_t)(1U<<PIND3)
#define    PIND4           4       /* Port D Input Pins bit 4 */
#define    BM_PIND4	(uint8_t)(1U<<PIND4)
#define    PIND5           5       /* Port D Input Pins bit 5 */
#define    BM_PIND5	(uint8_t)(1U<<PIND5)
#define    PIND6           6       /* Port D Input Pins bit 6 */
#define    BM_PIND6	(uint8_t)(1U<<PIND6)
#define    PIND7           7       /* Port D Input Pins bit 7 */
#define    BM_PIND7	(uint8_t)(1U<<PIND7)

/* PORTD - Port D Data Register */
#define    PORTD0          0       /* Port D Data Register bit 0 */
#define    BM_PORTD0	(uint8_t)(1U<<PORTD0)
#define    PD0             0       /* For compatibility */
#define    BM_PD0	(uint8_t)(1U<<PD0)
#define    PORTD1          1       /* Port D Data Register bit 1 */
#define    BM_PORTD1	(uint8_t)(1U<<PORTD1)
#define    PD1             1       /* For compatibility */
#define    BM_PD1	(uint8_t)(1U<<PD1)
#define    PORTD2          2       /* Port D Data Register bit 2 */
#define    BM_PORTD2	(uint8_t)(1U<<PORTD2)
#define    PD2             2       /* For compatibility */
#define    BM_PD2	(uint8_t)(1U<<PD2)
#define    PORTD3          3       /* Port D Data Register bit 3 */
#define    BM_PORTD3	(uint8_t)(1U<<PORTD3)
#define    PD3             3       /* For compatibility */
#define    BM_PD3	(uint8_t)(1U<<PD3)
#define    PORTD4          4       /* Port D Data Register bit 4 */
#define    BM_PORTD4	(uint8_t)(1U<<PORTD4)
#define    PD4             4       /* For compatibility */
#define    BM_PD4	(uint8_t)(1U<<PD4)
#define    PORTD5          5       /* Port D Data Register bit 5 */
#define    BM_PORTD5	(uint8_t)(1U<<PORTD5)
#define    PD5             5       /* For compatibility */
#define    BM_PD5	(uint8_t)(1U<<PD5)
#define    PORTD6          6       /* Port D Data Register bit 6 */
#define    BM_PORTD6	(uint8_t)(1U<<PORTD6)
#define    PD6             6       /* For compatibility */
#define    BM_PD6	(uint8_t)(1U<<PD6)
#define    PORTD7          7       /* Port D Data Register bit 7 */
#define    BM_PORTD7	(uint8_t)(1U<<PORTD7)
#define    PD7             7       /* For compatibility */
#define    BM_PD7	(uint8_t)(1U<<PD7)


/* ***** SFIFO ************************ */
/* SFC - Support FIFO Configuration Register */
#define    SFFLC0          0       /* Support FIFO Fill-Level Configuration bit 0 */
#define    BM_SFFLC0	(uint8_t)(1U<<SFFLC0)
#define    SFFLC1          1       /* Support FIFO Fill-Level Configuration bit 1 */
#define    BM_SFFLC1	(uint8_t)(1U<<SFFLC1)
#define    SFFLC2          2       /* Support FIFO Fill-Level Configuration bit 2 */
#define    BM_SFFLC2	(uint8_t)(1U<<SFFLC2)
#define    SFFLC3          3       /* Support FIFO Fill-Level Configuration bit 3 */
#define    BM_SFFLC3	(uint8_t)(1U<<SFFLC3)
#define    SFFLC4          4       /* Support FIFO Fill-Level Configuration bit 4 */
#define    BM_SFFLC4	(uint8_t)(1U<<SFFLC4)
#define    SFDRA           7       /* Support FIFO Direct Read Access Operational Mode */
#define    BM_SFDRA	(uint8_t)(1U<<SFDRA)

