camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* SFI - Support FIFO Interrupt Mask Register */
#define    SFFLIM          0       /* Support FIFO Fill-level Interrupt Mask */
#define    BM_SFFLIM	(uint8_t)(1U<<SFFLIM)
#define    SFERIM          1       /* Support FIFO Error Interrupt Mask */
#define    BM_SFERIM	(uint8_t)(1U<<SFERIM)

/* SFL - Support FIFO Fill Level Register */
#define    SFFLS0          0       /* Support FIFO Fill Level Status bit 0 */
#define    BM_SFFLS0	(uint8_t)(1U<<SFFLS0)
#define    SFFLS1          1       /* Support FIFO Fill Level Status bit 1 */
#define    BM_SFFLS1	(uint8_t)(1U<<SFFLS1)
#define    SFFLS2          2       /* Support FIFO Fill Level Status bit 2 */
#define    BM_SFFLS2	(uint8_t)(1U<<SFFLS2)
#define    SFFLS3          3       /* Support FIFO Fill Level Status bit 3 */
#define    BM_SFFLS3	(uint8_t)(1U<<SFFLS3)
#define    SFFLS4          4       /* Support FIFO Fill Level Status bit 4 */
#define    BM_SFFLS4	(uint8_t)(1U<<SFFLS4)
#define    SFCLR           7       /* Support FIFO Clear */
#define    BM_SFCLR	(uint8_t)(1U<<SFCLR)

/* SFRP - Support FIFO Read Pointer */
#define    SFRP0           0       /* Support FIFO Read Pointer bit 0 */
#define    BM_SFRP0	(uint8_t)(1U<<SFRP0)
#define    SFRP1           1       /* Support FIFO Read Pointer bit 1 */
#define    BM_SFRP1	(uint8_t)(1U<<SFRP1)
#define    SFRP2           2       /* Support FIFO Read Pointer bit 2 */
#define    BM_SFRP2	(uint8_t)(1U<<SFRP2)
#define    SFRP3           3       /* Support FIFO Read Pointer bit 3 */
#define    BM_SFRP3	(uint8_t)(1U<<SFRP3)
#define    SFRP4           4       /* Support FIFO Read Pointer bit 4 */
#define    BM_SFRP4	(uint8_t)(1U<<SFRP4)

/* SFS - Support FIFO Status Register */
#define    SFFLRF          0       /* Support FIFO Fill-Level Reached Status Flag */
#define    BM_SFFLRF	(uint8_t)(1U<<SFFLRF)
#define    SFUFL           1       /* Support FIFO Underflow Flag */
#define    BM_SFUFL	(uint8_t)(1U<<SFUFL)
#define    SFOFL           2       /* Support FIFO Overflow Flag */
#define    BM_SFOFL	(uint8_t)(1U<<SFOFL)

/* SFWP - Support FIFO Write Pointer */
#define    SFWP0           0       /* Support FIFO Write Pointer bit 0 */
#define    BM_SFWP0	(uint8_t)(1U<<SFWP0)
#define    SFWP1           1       /* Support FIFO Write Pointer bit 1 */
#define    BM_SFWP1	(uint8_t)(1U<<SFWP1)
#define    SFWP2           2       /* Support FIFO Write Pointer bit 2 */
#define    BM_SFWP2	(uint8_t)(1U<<SFWP2)
#define    SFWP3           3       /* Support FIFO Write Pointer bit 3 */
#define    BM_SFWP3	(uint8_t)(1U<<SFWP3)
#define    SFWP4           4       /* Support FIFO Write Pointer bit 4 */
#define    BM_SFWP4	(uint8_t)(1U<<SFWP4)


/* ***** SPI ************************** */
/* SFFR - SPI FIFO Fill Status Register */
#define    RFL0            0       /* Receive Buffer Fill Level bit 0 */
#define    BM_RFL0	(uint8_t)(1U<<RFL0)
#define    RFL1            1       /* Receive Buffer Fill Level bit 1 */
#define    BM_RFL1	(uint8_t)(1U<<RFL1)
#define    RFL2            2       /* Receive Buffer Fill Level bit 2 */
#define    BM_RFL2	(uint8_t)(1U<<RFL2)
#define    RFC             3       /* Rx Buffer Clear */
#define    BM_RFC	(uint8_t)(1U<<RFC)
#define    TFL0            4       /* Transmit Buffer Fill Level bit 0 */
#define    BM_TFL0	(uint8_t)(1U<<TFL0)
#define    TFL1            5       /* Transmit Buffer Fill Level bit 1 */
#define    BM_TFL1	(uint8_t)(1U<<TFL1)
#define    TFL2            6       /* Transmit Buffer Fill Level bit 2 */
#define    BM_TFL2	(uint8_t)(1U<<TFL2)
#define    TFC             7       /* SPI Tx Buffer Clear */
#define    BM_TFC	(uint8_t)(1U<<TFC)

/* SFIR - SPI FIFO Interrupt Register */
#define    RIL0            0       /* Receive Buffer Interrupt Level bit 0 */
#define    BM_RIL0	(uint8_t)(1U<<RIL0)
#define    RIL1            1       /* Receive Buffer Interrupt Level bit 1 */
#define    BM_RIL1	(uint8_t)(1U<<RIL1)
#define    RIL2            2       /* Receive Buffer Interrupt Level bit 2 */
#define    BM_RIL2	(uint8_t)(1U<<RIL2)
#define    SRIE            3       /* Rx Buffer Interrupt Enable */
#define    BM_SRIE	(uint8_t)(1U<<SRIE)
#define    TIL0            4       /* Transmit Buffer Interrupt Level bit 0 */
#define    BM_TIL0	(uint8_t)(1U<<TIL0)
#define    TIL1            5       /* Transmit Buffer Interrupt Level bit 1 */
#define    BM_TIL1	(uint8_t)(1U<<TIL1)
#define    TIL2            6       /* Transmit Buffer Interrupt Level bit 2 */
#define    BM_TIL2	(uint8_t)(1U<<TIL2)
#define    STIE            7       /* SPI Rx Buffer Interrupt Enable */
#define    BM_STIE	(uint8_t)(1U<<STIE)

/* SPCR - SPI control Register */
#define    SPR0            0       /* SPI Clock Rate Select 0 */
#define    BM_SPR0	(uint8_t)(1U<<SPR0)
#define    SPR1            1       /* SPI Clock Rate Select 1 */
#define    BM_SPR1	(uint8_t)(1U<<SPR1)
#define    CPHA            2       /* Clock Phase */
#define    BM_CPHA	(uint8_t)(1U<<CPHA)
#define    CPOL            3       /* Clock Polarity */
#define    BM_CPOL	(uint8_t)(1U<<CPOL)
#define    MSTR            4       /* Master/Slave Select */
#define    BM_MSTR	(uint8_t)(1U<<MSTR)
#define    DORD            5       /* Data Order */
#define    BM_DORD	(uint8_t)(1U<<DORD)
#define    SPE             6       /* SPI Enable */
#define    BM_SPE	(uint8_t)(1U<<SPE)
#define    SPIE            7       /* Spe Interrupt Enable */
#define    BM_SPIE	(uint8_t)(1U<<SPIE)

/* SPSR - SPI Status Register */
#define    SPI2X           0       /* Double SPI Speed Bit */
#define    BM_SPI2X	(uint8_t)(1U<<SPI2X)
#define    RXIF            4       /* Rx Buffer Interrupt Flag */
#define    BM_RXIF	(uint8_t)(1U<<RXIF)
#define    TXIF            5       /* Tx Buffer Interrupt Flag */
#define    BM_TXIF	(uint8_t)(1U<<TXIF)
#define    SPIF            7       /* SPI Interrupt Flag */
#define    BM_SPIF	(uint8_t)(1U<<SPIF)


/* ***** SSM ************************** */
/* MSMCR1 - Master State Machine Control Register 1 */
#define    MSMSM00         0       /* Master State Machine SubState Machine Select 0 bit 0 */
#define    BM_MSMSM00	(uint8_t)(1U<<MSMSM00)
#define    MSMSM01         1       /* Master State Machine SubState Machine Select 0 bit 1 */
#define    BM_MSMSM01	(uint8_t)(1U<<MSMSM01)
#define    MSMSM02         2       /* Master State Machine SubState Machine Select 0 bit 2 */
#define    BM_MSMSM02	(uint8_t)(1U<<MSMSM02)
#define    MSMSM03         3       /* Master State Machine SubState Machine Select 0 bit 3 */
#define    BM_MSMSM03	(uint8_t)(1U<<MSMSM03)
#define    MSMSM10         4       /* Master State Machine SubState Machine Select 1 bit 0 */
#define    BM_MSMSM10	(uint8_t)(1U<<MSMSM10)
#define    MSMSM11         5       /* Master State Machine SubState Machine Select 1 bit 1 */
#define    BM_MSMSM11	(uint8_t)(1U<<MSMSM11)
#define    MSMSM12         6       /* Master State Machine SubState Machine Select 1 bit 2 */
#define    BM_MSMSM12	(uint8_t)(1U<<MSMSM12)
#define    MSMSM13         7       /* Master State Machine SubState Machine Select 1 bit 3 */
#define    BM_MSMSM13	(uint8_t)(1U<<MSMSM13)

/* MSMCR2 - Master State Machine Control Register 2 */
#define    MSMSM20         0       /* Master State Machine SubState Machine Select 2 bit 0 */
#define    BM_MSMSM20	(uint8_t)(1U<<MSMSM20)
#define    MSMSM21         1       /* Master State Machine SubState Machine Select 2 bit 1 */
#define    BM_MSMSM21	(uint8_t)(1U<<MSMSM21)
#define    MSMSM22         2       /* Master State Machine SubState Machine Select 2 bit 2 */
#define    BM_MSMSM22	(uint8_t)(1U<<MSMSM22)
#define    MSMSM23         3       /* Master State Machine SubState Machine Select 2 bit 3 */
#define    BM_MSMSM23	(uint8_t)(1U<<MSMSM23)
#define    MSMSM30         4       /* Master State Machine SubState Machine Select 3 bit 0 */
#define    BM_MSMSM30	(uint8_t)(1U<<MSMSM30)
#define    MSMSM31         5       /* Master State Machine SubState Machine Select 3 bit 1 */
#define    BM_MSMSM31	(uint8_t)(1U<<MSMSM31)
#define    MSMSM32         6       /* Master State Machine SubState Machine Select 3 bit 2 */
#define    BM_MSMSM32	(uint8_t)(1U<<MSMSM32)
#define    MSMSM33         7       /* Master State Machine SubState Machine Select 3 bit 3 */
#define    BM_MSMSM33	(uint8_t)(1U<<MSMSM33)

