camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* MSMCR3 - Master State Machine Control Register 3 */
#define    MSMSM40         0       /* Master State Machine SubState Machine Select 4 bit 0 */
#define    BM_MSMSM40	(uint8_t)(1U<<MSMSM40)
#define    MSMSM41         1       /* Master State Machine SubState Machine Select 4 bit 1 */
#define    BM_MSMSM41	(uint8_t)(1U<<MSMSM41)
#define    MSMSM42         2       /* Master State Machine SubState Machine Select 4 bit 2 */
#define    BM_MSMSM42	(uint8_t)(1U<<MSMSM42)
#define    MSMSM43         3       /* Master State Machine SubState Machine Select 4 bit 3 */
#define    BM_MSMSM43	(uint8_t)(1U<<MSMSM43)
#define    MSMSM50         4       /* Master State Machine SubState Machine Select 5 bit 0 */
#define    BM_MSMSM50	(uint8_t)(1U<<MSMSM50)
#define    MSMSM51         5       /* Master State Machine SubState Machine Select 5 bit 1 */
#define    BM_MSMSM51	(uint8_t)(1U<<MSMSM51)
#define    MSMSM52         6       /* Master State Machine SubState Machine Select 5 bit 2 */
#define    BM_MSMSM52	(uint8_t)(1U<<MSMSM52)
#define    MSMSM53         7       /* Master State Machine SubState Machine Select 5 bit 3 */
#define    BM_MSMSM53	(uint8_t)(1U<<MSMSM53)

/* MSMCR4 - Master State Machine Control Register 4 */
#define    MSMSM60         0       /* Master State Machine SubState Machine Select 6 bit 0 */
#define    BM_MSMSM60	(uint8_t)(1U<<MSMSM60)
#define    MSMSM61         1       /* Master State Machine SubState Machine Select 6 bit 1 */
#define    BM_MSMSM61	(uint8_t)(1U<<MSMSM61)
#define    MSMSM62         2       /* Master State Machine SubState Machine Select 6 bit 2 */
#define    BM_MSMSM62	(uint8_t)(1U<<MSMSM62)
#define    MSMSM63         3       /* Master State Machine SubState Machine Select 6 bit 3 */
#define    BM_MSMSM63	(uint8_t)(1U<<MSMSM63)
#define    MSMSM70         4       /* Master State Machine SubState Machine Select 7 bit 0 */
#define    BM_MSMSM70	(uint8_t)(1U<<MSMSM70)
#define    MSMSM71         5       /* Master State Machine SubState Machine Select 7 bit 1 */
#define    BM_MSMSM71	(uint8_t)(1U<<MSMSM71)
#define    MSMSM72         6       /* Master State Machine SubState Machine Select 7 bit 2 */
#define    BM_MSMSM72	(uint8_t)(1U<<MSMSM72)
#define    MSMSM73         7       /* Master State Machine SubState Machine Select 7 bit 3 */
#define    BM_MSMSM73	(uint8_t)(1U<<MSMSM73)

/* MSMSTR - Master State Machine state register */
#define    SSMMST0         0       /* Sequencer State Machine Master State bit 0 */
#define    BM_SSMMST0	(uint8_t)(1U<<SSMMST0)
#define    SSMMST1         1       /* Sequencer State Machine Master State bit 1 */
#define    BM_SSMMST1	(uint8_t)(1U<<SSMMST1)
#define    SSMMST2         2       /* Sequencer State Machine Master State bit 2 */
#define    BM_SSMMST2	(uint8_t)(1U<<SSMMST2)
#define    SSMMST3         3       /* Sequencer State Machine Master State bit 3 */
#define    BM_SSMMST3	(uint8_t)(1U<<SSMMST3)
#define    SSMMST4         4       /* Sequencer State Machine Master State bit 4 */
#define    BM_SSMMST4	(uint8_t)(1U<<SSMMST4)

/* SSMCR - SSM Control Register */
#define    SSMTGE          2       /* Sequencer State Machine Tx Gauss Enable */
#define    BM_SSMTGE	(uint8_t)(1U<<SSMTGE)
#define    SSMTPE          3       /* Sequencer State Machine Tx Preemphasis Enable */
#define    BM_SSMTPE	(uint8_t)(1U<<SSMTPE)
#define    SSMPVE          4       /* Sequencer State Machine PV Enable */
#define    BM_SSMPVE	(uint8_t)(1U<<SSMPVE)
#define    SSMTAE          5       /* Sequencer State Machine Tx Ask-Shaping Enable */
#define    BM_SSMTAE	(uint8_t)(1U<<SSMTAE)

/* SSMFBR - SSM Filter Bandwidth Register */
#define    SSMPLDT         5       /* Sequencer State Machine PLL Lock Delay Time */
#define    BM_SSMPLDT	(uint8_t)(1U<<SSMPLDT)

/* SSMIFR - SSM Interrupt Flag Register */
#define    SSMIF           0       /* Sequencer State Machine Interrupt Flag */
#define    BM_SSMIF	(uint8_t)(1U<<SSMIF)

/* SSMIMR - SSM interrupt mask register */
#define    SSMIM           0       /* Sequencer State Machine Interrupt Mask */
#define    BM_SSMIM	(uint8_t)(1U<<SSMIM)

/* SSMRR - SSM Run Register */
#define    SSMR            0       /* Sequencer State Machine Run */
#define    BM_SSMR	(uint8_t)(1U<<SSMR)
#define    SSMST           1       /* Sequencer State Machine Stop */
#define    BM_SSMST	(uint8_t)(1U<<SSMST)

/* SSMSR - SSM Status Register */
#define    SSMESM0         0       /* Sequencer State Machine Error State Machine bit 0 */
#define    BM_SSMESM0	(uint8_t)(1U<<SSMESM0)
#define    SSMESM1         1       /* Sequencer State Machine Error State Machine bit 1 */
#define    BM_SSMESM1	(uint8_t)(1U<<SSMESM1)
#define    SSMESM2         2       /* Sequencer State Machine Error State Machine bit 2 */
#define    BM_SSMESM2	(uint8_t)(1U<<SSMESM2)
#define    SSMESM3         3       /* Sequencer State Machine Error State Machine bit 3 */
#define    BM_SSMESM3	(uint8_t)(1U<<SSMESM3)
#define    SSMERR          7       /* Sequencer State Machine Error */
#define    BM_SSMERR	(uint8_t)(1U<<SSMERR)

/* SSMSTR - SSM State Register */
#define    SSMSTA0         0       /* Sequencer State Machine State A bit 0 */
#define    BM_SSMSTA0	(uint8_t)(1U<<SSMSTA0)
#define    SSMSTA1         1       /* Sequencer State Machine State A bit 1 */
#define    BM_SSMSTA1	(uint8_t)(1U<<SSMSTA1)
#define    SSMSTA2         2       /* Sequencer State Machine State A bit 2 */
#define    BM_SSMSTA2	(uint8_t)(1U<<SSMSTA2)
#define    SSMSTA3         3       /* Sequencer State Machine State A bit 3 */
#define    BM_SSMSTA3	(uint8_t)(1U<<SSMSTA3)
#define    SSMSTA4         4       /* Sequencer State Machine State A bit 4 */
#define    BM_SSMSTA4	(uint8_t)(1U<<SSMSTA4)
#define    SSMSTA5         5       /* Sequencer State Machine State A bit 5 */
#define    BM_SSMSTA5	(uint8_t)(1U<<SSMSTA5)


/* ***** SUP ************************** */
/* CALRDY - Calibration ready signature */
#define    CALRDY0         0       /* Calibration ready signature bit 0 */
#define    BM_CALRDY0	(uint8_t)(1U<<CALRDY0)
#define    CALRDY1         1       /* Calibration ready signature bit 1 */
#define    BM_CALRDY1	(uint8_t)(1U<<CALRDY1)
#define    CALRDY2         2       /* Calibration ready signature bit 2 */
#define    BM_CALRDY2	(uint8_t)(1U<<CALRDY2)
#define    CALRDY3         3       /* Calibration ready signature bit 3 */
#define    BM_CALRDY3	(uint8_t)(1U<<CALRDY3)
#define    CALRDY4         4       /* Calibration ready signature bit 4 */
#define    BM_CALRDY4	(uint8_t)(1U<<CALRDY4)
#define    CALRDY5         5       /* Calibration ready signature bit 5 */
#define    BM_CALRDY5	(uint8_t)(1U<<CALRDY5)
#define    CALRDY6         6       /* Calibration ready signature bit 6 */
#define    BM_CALRDY6	(uint8_t)(1U<<CALRDY6)
#define    CALRDY7         7       /* Calibration ready signature bit 7 */
#define    BM_CALRDY7	(uint8_t)(1U<<CALRDY7)

/* CALRDYLF - Calibration ready signature LFVCC */
#define    CALRDYLF0       0       /* Calibration ready signature LFVCC bit 0 */
#define    BM_CALRDYLF0	(uint8_t)(1U<<CALRDYLF0)
#define    CALRDYLF1       1       /* Calibration ready signature LFVCC bit 1 */
#define    BM_CALRDYLF1	(uint8_t)(1U<<CALRDYLF1)
#define    CALRDYLF2       2       /* Calibration ready signature LFVCC bit 2 */
#define    BM_CALRDYLF2	(uint8_t)(1U<<CALRDYLF2)
#define    CALRDYLF3       3       /* Calibration ready signature LFVCC bit 3 */
#define    BM_CALRDYLF3	(uint8_t)(1U<<CALRDYLF3)
#define    CALRDYLF4       4       /* Calibration ready signature LFVCC bit 4 */
#define    BM_CALRDYLF4	(uint8_t)(1U<<CALRDYLF4)
#define    CALRDYLF5       5       /* Calibration ready signature LFVCC bit 5 */
#define    BM_CALRDYLF5	(uint8_t)(1U<<CALRDYLF5)
#define    CALRDYLF6       6       /* Calibration ready signature LFVCC bit 6 */
#define    BM_CALRDYLF6	(uint8_t)(1U<<CALRDYLF6)
#define    CALRDYLF7       7       /* Calibration ready signature LFVCC bit 7 */
#define    BM_CALRDYLF7	(uint8_t)(1U<<CALRDYLF7)

/* PMTER - Power Management Test Enable Register */
#define    PMTE0           0       /* Power Management Test Enable bit 0 */
#define    BM_PMTE0	(uint8_t)(1U<<PMTE0)
#define    PMTE1           1       /* Power Management Test Enable bit 1 */
#define    BM_PMTE1	(uint8_t)(1U<<PMTE1)
#define    PMTE2           2       /* Power Management Test Enable bit 2 */
#define    BM_PMTE2	(uint8_t)(1U<<PMTE2)
#define    PMTE3           3       /* Power Management Test Enable bit 3 */
#define    BM_PMTE3	(uint8_t)(1U<<PMTE3)
#define    PMTE4           4       /* Power Management Test Enable bit 4 */
#define    BM_PMTE4	(uint8_t)(1U<<PMTE4)
#define    PMTE5           5       /* Power Management Test Enable bit 5 */
#define    BM_PMTE5	(uint8_t)(1U<<PMTE5)
#define    PMTE6           6       /* Power Management Test Enable bit 6 */
#define    BM_PMTE6	(uint8_t)(1U<<PMTE6)
#define    PMTE7           7       /* Power Management Test Enable bit 7 */
#define    BM_PMTE7	(uint8_t)(1U<<PMTE7)

/* RCTCAL - RC oscillator Temperature Compensation register */
#define    FRCTC           0       /* FRC Oscillator Temperature Compensation bit */
#define    BM_FRCTC	(uint8_t)(1U<<FRCTC)
#define    MRCTC0          1       /* Medium frequency RC Oscillator Temperature Compensation bit 0 */
#define    BM_MRCTC0	(uint8_t)(1U<<MRCTC0)
#define    MRCTC1          2       /* Medium frequency RC Oscillator Temperature Compensation bit 1 */
#define    BM_MRCTC1	(uint8_t)(1U<<MRCTC1)
#define    MRCTC2          3       /* Medium frequency RC Oscillator Temperature Compensation bit 2 */
#define    BM_MRCTC2	(uint8_t)(1U<<MRCTC2)

/* SUPCA1 - Supply calibration register 1 */
#define    PV22            2       /* Power Amplifier Voltage 2.2V */
#define    BM_PV22	(uint8_t)(1U<<PV22)
#define    PVDIC           3       /* Power Amplifier Regulator Double Internal Current */
#define    BM_PVDIC	(uint8_t)(1U<<PVDIC)
#define    PVCAL0          4       /* Power Amplifier Regulator Calibration bit 0 */
#define    BM_PVCAL0	(uint8_t)(1U<<PVCAL0)
#define    PVCAL1          5       /* Power Amplifier Regulator Calibration bit 1 */
#define    BM_PVCAL1	(uint8_t)(1U<<PVCAL1)
#define    PVCAL2          6       /* Power Amplifier Regulator Calibration bit 2 */
#define    BM_PVCAL2	(uint8_t)(1U<<PVCAL2)
#define    PVCAL3          7       /* Power Amplifier Regulator Calibration bit 3 */
#define    BM_PVCAL3	(uint8_t)(1U<<PVCAL3)

/* SUPCA10 - Supply calibration register 10 */
#define    POWMAN0         0       /* Power Management Spare bits bit 0 */
#define    BM_POWMAN0	(uint8_t)(1U<<POWMAN0)
#define    POWMAN1         1       /* Power Management Spare bits bit 1 */
#define    BM_POWMAN1	(uint8_t)(1U<<POWMAN1)
#define    POWMAN2         2       /* Power Management Spare bits bit 2 */
#define    BM_POWMAN2	(uint8_t)(1U<<POWMAN2)
#define    POWMAN3         3       /* Power Management Spare bits bit 3 */
#define    BM_POWMAN3	(uint8_t)(1U<<POWMAN3)
#define    POWMAN4         4       /* Power Management Spare bits bit 4 */
#define    BM_POWMAN4	(uint8_t)(1U<<POWMAN4)

/* SUPCA2 - Supply calibration register 2 */
#define    BGCAL0          0       /* Band Gap Calibration bit 0 */
#define    BM_BGCAL0	(uint8_t)(1U<<BGCAL0)
#define    BGCAL1          1       /* Band Gap Calibration bit 1 */
#define    BM_BGCAL1	(uint8_t)(1U<<BGCAL1)
#define    BGCAL2          2       /* Band Gap Calibration bit 2 */
#define    BM_BGCAL2	(uint8_t)(1U<<BGCAL2)
#define    BGCAL3          3       /* Band Gap Calibration bit 3 */
#define    BM_BGCAL3	(uint8_t)(1U<<BGCAL3)

/* SUPCA3 - Supply calibration register 3 */
#define    ACAL0           0       /* AVCC Regulator Output Voltage Calibration bit 0 */
#define    BM_ACAL0	(uint8_t)(1U<<ACAL0)
#define    ACAL1           1       /* AVCC Regulator Output Voltage Calibration bit 1 */
#define    BM_ACAL1	(uint8_t)(1U<<ACAL1)
#define    ACAL2           2       /* AVCC Regulator Output Voltage Calibration bit 2 */
#define    BM_ACAL2	(uint8_t)(1U<<ACAL2)
#define    ACAL3           3       /* AVCC Regulator Output Voltage Calibration bit 3 */
#define    BM_ACAL3	(uint8_t)(1U<<ACAL3)
#define    ACAL4           4       /* AVCC Regulator Output Voltage Calibration bit 4 */
#define    BM_ACAL4	(uint8_t)(1U<<ACAL4)
#define    ACAL5           5       /* AVCC Regulator Output Voltage Calibration bit 5 */
#define    BM_ACAL5	(uint8_t)(1U<<ACAL5)
#define    ACAL6           6       /* AVCC Regulator Output Voltage Calibration bit 6 */
#define    BM_ACAL6	(uint8_t)(1U<<ACAL6)
#define    ACAL7           7       /* AVCC Regulator Output Voltage Calibration bit 7 */
#define    BM_ACAL7	(uint8_t)(1U<<ACAL7)

/* SUPCA4 - Supply calibration register 4 */
#define    ICONST0         0       /* ICONST Constant current of bandgap bit 0 */
#define    BM_ICONST0	(uint8_t)(1U<<ICONST0)
#define    ICONST1         1       /* ICONST Constant current of bandgap bit 1 */
#define    BM_ICONST1	(uint8_t)(1U<<ICONST1)
#define    ICONST2         2       /* ICONST Constant current of bandgap bit 2 */
#define    BM_ICONST2	(uint8_t)(1U<<ICONST2)
#define    ICONST3         3       /* ICONST Constant current of bandgap bit 3 */
#define    BM_ICONST3	(uint8_t)(1U<<ICONST3)
#define    ICONST4         4       /* ICONST Constant current of bandgap bit 4 */
#define    BM_ICONST4	(uint8_t)(1U<<ICONST4)
#define    ICONST5         5       /* ICONST Constant current of bandgap bit 5 */
#define    BM_ICONST5	(uint8_t)(1U<<ICONST5)

/* SUPCA5 - Supply calibration register 5 */
#define    IPTAT0          0       /* IPTAT current of bandgap bit 0 */
#define    BM_IPTAT0	(uint8_t)(1U<<IPTAT0)
#define    IPTAT1          1       /* IPTAT current of bandgap bit 1 */
#define    BM_IPTAT1	(uint8_t)(1U<<IPTAT1)
#define    IPTAT2          2       /* IPTAT current of bandgap bit 2 */
#define    BM_IPTAT2	(uint8_t)(1U<<IPTAT2)
#define    IPTAT3          3       /* IPTAT current of bandgap bit 3 */
#define    BM_IPTAT3	(uint8_t)(1U<<IPTAT3)
#define    IPTAT4          4       /* IPTAT current of bandgap bit 4 */
#define    BM_IPTAT4	(uint8_t)(1U<<IPTAT4)
#define    IPTAT5          5       /* IPTAT current of bandgap bit 5 */
#define    BM_IPTAT5	(uint8_t)(1U<<IPTAT5)

/* SUPCA6 - Supply calibration register 6 */
#define    VBGTR0          0       /* Threshold voltage of bandgap bit 0 */
#define    BM_VBGTR0	(uint8_t)(1U<<VBGTR0)
#define    VBGTR1          1       /* Threshold voltage of bandgap bit 1 */
#define    BM_VBGTR1	(uint8_t)(1U<<VBGTR1)
#define    VBGTR2          2       /* Threshold voltage of bandgap bit 2 */
#define    BM_VBGTR2	(uint8_t)(1U<<VBGTR2)
#define    VBGTR3          3       /* Threshold voltage of bandgap bit 3 */
#define    BM_VBGTR3	(uint8_t)(1U<<VBGTR3)
#define    VBGTR4          4       /* Threshold voltage of bandgap bit 4 */
#define    BM_VBGTR4	(uint8_t)(1U<<VBGTR4)
#define    VBGTR5          5       /* Threshold voltage of bandgap bit 5 */
#define    BM_VBGTR5	(uint8_t)(1U<<VBGTR5)
#define    VBGTR6          6       /* Threshold voltage of bandgap bit 6 */
#define    BM_VBGTR6	(uint8_t)(1U<<VBGTR6)
#define    VBGTR7          7       /* Threshold voltage of bandgap bit 7 */
#define    BM_VBGTR7	(uint8_t)(1U<<VBGTR7)

/* SUPCA7 - Supply calibration register 7 */
#define    VCCCAL0         0       /* LFVCC and DVCC Output Voltage Calibration bit 0 */
#define    BM_VCCCAL0	(uint8_t)(1U<<VCCCAL0)
#define    VCCCAL1         1       /* LFVCC and DVCC Output Voltage Calibration bit 1 */
#define    BM_VCCCAL1	(uint8_t)(1U<<VCCCAL1)
#define    VCCCAL2         2       /* LFVCC and DVCC Output Voltage Calibration bit 2 */
#define    BM_VCCCAL2	(uint8_t)(1U<<VCCCAL2)
#define    LFVCCBD0        3       /* VREF voltage for LFVCC Brown-out-Detector bit 0 */
#define    BM_LFVCCBD0	(uint8_t)(1U<<LFVCCBD0)
#define    LFVCCBD1        4       /* VREF voltage for LFVCC Brown-out-Detector bit 1 */
#define    BM_LFVCCBD1	(uint8_t)(1U<<LFVCCBD1)
#define    LFVCCBD2        5       /* VREF voltage for LFVCC Brown-out-Detector bit 2 */
#define    BM_LFVCCBD2	(uint8_t)(1U<<LFVCCBD2)

/* SUPCA8 - Supply calibration register 8 */
#define    VSWBD0          0       /* VSIG voltage for LFVCC Brown-out-Detector bit 0 */
#define    BM_VSWBD0	(uint8_t)(1U<<VSWBD0)
#define    VSWBD1          1       /* VSIG voltage for LFVCC Brown-out-Detector bit 1 */
#define    BM_VSWBD1	(uint8_t)(1U<<VSWBD1)
#define    VSWBD2          2       /* VSIG voltage for LFVCC Brown-out-Detector bit 2 */
#define    BM_VSWBD2	(uint8_t)(1U<<VSWBD2)
#define    DVCCBD0         3       /* VREF voltage for DVCC Brown-out-Detector bit 0 */
#define    BM_DVCCBD0	(uint8_t)(1U<<DVCCBD0)
#define    DVCCBD1         4       /* VREF voltage for DVCC Brown-out-Detector bit 1 */
#define    BM_DVCCBD1	(uint8_t)(1U<<DVCCBD1)
#define    DVCCBD2         5       /* VREF voltage for DVCC Brown-out-Detector bit 2 */
#define    BM_DVCCBD2	(uint8_t)(1U<<DVCCBD2)

/* SUPCA9 - Supply calibration register 9 */
#define    VMEM0           0       /* VMEM ldo voltage bit 0 */
#define    BM_VMEM0	(uint8_t)(1U<<VMEM0)
#define    VMEM1           1       /* VMEM ldo voltage bit 1 */
#define    BM_VMEM1	(uint8_t)(1U<<VMEM1)
#define    VMEM2           2       /* VMEM ldo voltage bit 2 */
#define    BM_VMEM2	(uint8_t)(1U<<VMEM2)
#define    VMEM3           3       /* VMEM ldo voltage bit 3 */
#define    BM_VMEM3	(uint8_t)(1U<<VMEM3)
#define    VMEM4           4       /* VMEM ldo voltage bit 4 */
#define    BM_VMEM4	(uint8_t)(1U<<VMEM4)
#define    VMEM5           5       /* VMEM ldo voltage bit 5 */
#define    BM_VMEM5	(uint8_t)(1U<<VMEM5)
#define    VMEM6           6       /* VMEM ldo voltage bit 6 */
#define    BM_VMEM6	(uint8_t)(1U<<VMEM6)
#define    VMEM7           7       /* VMEM ldo voltage bit 7 */
#define    BM_VMEM7	(uint8_t)(1U<<VMEM7)

/* SUPCR - Supply Control Register */
#define    AVCCRM          0       /* AVCC Reset Interrupt Mask */
#define    BM_AVCCRM	(uint8_t)(1U<<AVCCRM)
#define    AVCCLM          1       /* AVCC Low Interrupt Mask */
#define    BM_AVCCLM	(uint8_t)(1U<<AVCCLM)
#define    PVEN            2       /* Power amplifier Voltage supply Enable */
#define    BM_PVEN	(uint8_t)(1U<<PVEN)
#define    AVDIC           3       /* AVCC Double Internal Current */
#define    BM_AVDIC	(uint8_t)(1U<<AVDIC)
#define    AVEN            4       /* AVCC Enable */
#define    BM_AVEN	(uint8_t)(1U<<AVEN)
#define    DVHEN           5       /* DVCC High Current Mode Enable */
#define    BM_DVHEN	(uint8_t)(1U<<DVHEN)
#define    VMRESM          6       /* VMEM Reset Mask */
#define    BM_VMRESM	(uint8_t)(1U<<VMRESM)
#define    VMEMEN          7       /* Memory Voltage Regulator Enable */
#define    BM_VMEMEN	(uint8_t)(1U<<VMEMEN)

/* SUPFR - Supply Interrupt Flag Register */
#define    AVCCRF          0       /* AVCC reset interrupt flag */
#define    BM_AVCCRF	(uint8_t)(1U<<AVCCRF)
#define    AVCCLF          1       /* AVCC low interrupt flag */
#define    BM_AVCCLF	(uint8_t)(1U<<AVCCLF)

/* VMCR - Voltage Monitor Control Register */
#define    VMLS0           0       /* Voltage Monitor Level Select bit 0 */
#define    BM_VMLS0	(uint8_t)(1U<<VMLS0)
#define    VMLS1           1       /* Voltage Monitor Level Select bit 1 */
#define    BM_VMLS1	(uint8_t)(1U<<VMLS1)
#define    VMLS2           2       /* Voltage Monitor Level Select bit 2 */
#define    BM_VMLS2	(uint8_t)(1U<<VMLS2)
#define    VMLS3           3       /* Voltage Monitor Level Select bit 3 */
#define    BM_VMLS3	(uint8_t)(1U<<VMLS3)
#define    VMIM            4       /* Voltage Monitor Interrupt Mask */
#define    BM_VMIM	(uint8_t)(1U<<VMIM)
#define    VMPS0           5       /* Voltage Monitor Power Supply Select 0 */
#define    BM_VMPS0	(uint8_t)(1U<<VMPS0)
#define    VMPS1           6       /* Voltage Monitor Power Supply Select 1 */
#define    BM_VMPS1	(uint8_t)(1U<<VMPS1)
#define    VMRS            7       /* Voltage Monitor Range Select */
#define    BM_VMRS	(uint8_t)(1U<<VMRS)

