camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* VMSR - Voltage Monitor Status Register */
#define    VMF             0       /* Voltage Monitor Flag */
#define    BM_VMF	(uint8_t)(1U<<VMF)


/* ***** TIMER0_WDT ******************* */
/* T0CR - Timer0 Control Register */
#define    T0PS0           0       /* Timer0 Prescaler Select bit 0 */
#define    BM_T0PS0	(uint8_t)(1U<<T0PS0)
#define    T0PS1           1       /* Timer0 Prescaler Select bit 1 */
#define    BM_T0PS1	(uint8_t)(1U<<T0PS1)
#define    T0PS2           2       /* Timer0 Prescaler Select bit 2 */
#define    BM_T0PS2	(uint8_t)(1U<<T0PS2)
#define    T0IE            3       /* Timer0 Interrupt Enable */
#define    BM_T0IE	(uint8_t)(1U<<T0IE)
#define    T0PR            4       /* Timer0 Prescaler Reset */
#define    BM_T0PR	(uint8_t)(1U<<T0PR)

/* T0IFR - Timer0 Interrupt Flag Register */
#define    T0F             0       /* Timer0 Flag */
#define    BM_T0F	(uint8_t)(1U<<T0F)

/* WDTCR - Watchdog Timer0 control Register */
#define    WDPS0           0       /* Watchdog Prescaler Select bit 0 */
#define    BM_WDPS0	(uint8_t)(1U<<WDPS0)
#define    WDPS1           1       /* Watchdog Prescaler Select bit 1 */
#define    BM_WDPS1	(uint8_t)(1U<<WDPS1)
#define    WDPS2           2       /* Watchdog Prescaler Select bit 2 */
#define    BM_WDPS2	(uint8_t)(1U<<WDPS2)
#define    WDE             3       /* Watchdog System Reset Enable */
#define    BM_WDE	(uint8_t)(1U<<WDE)
#define    WDCE            4       /* Watchdog Change Enable */
#define    BM_WDCE	(uint8_t)(1U<<WDCE)


/* ***** TIMER1 *********************** */
/* T1CNT - Timer1 Counter Register */
#define    T1CNT0          0       /* Timer1 Counter bit 0 */
#define    BM_T1CNT0	(uint8_t)(1U<<T1CNT0)
#define    T1CNT1          1       /* Timer1 Counter bit 1 */
#define    BM_T1CNT1	(uint8_t)(1U<<T1CNT1)
#define    T1CNT2          2       /* Timer1 Counter bit 2 */
#define    BM_T1CNT2	(uint8_t)(1U<<T1CNT2)
#define    T1CNT3          3       /* Timer1 Counter bit 3 */
#define    BM_T1CNT3	(uint8_t)(1U<<T1CNT3)
#define    T1CNT4          4       /* Timer1 Counter bit 4 */
#define    BM_T1CNT4	(uint8_t)(1U<<T1CNT4)
#define    T1CNT5          5       /* Timer1 Counter bit 5 */
#define    BM_T1CNT5	(uint8_t)(1U<<T1CNT5)
#define    T1CNT6          6       /* Timer1 Counter bit 6 */
#define    BM_T1CNT6	(uint8_t)(1U<<T1CNT6)
#define    T1CNT7          7       /* Timer1 Counter bit 7 */
#define    BM_T1CNT7	(uint8_t)(1U<<T1CNT7)

/* T1COR - Timer1 Compare Register */
#define    T1COR0          0       /* Timer1 Compare bit 0 */
#define    BM_T1COR0	(uint8_t)(1U<<T1COR0)
#define    T1COR1          1       /* Timer1 Compare bit 1 */
#define    BM_T1COR1	(uint8_t)(1U<<T1COR1)
#define    T1COR2          2       /* Timer1 Compare bit 2 */
#define    BM_T1COR2	(uint8_t)(1U<<T1COR2)
#define    T1COR3          3       /* Timer1 Compare bit 3 */
#define    BM_T1COR3	(uint8_t)(1U<<T1COR3)
#define    T1COR4          4       /* Timer1 Compare bit 4 */
#define    BM_T1COR4	(uint8_t)(1U<<T1COR4)
#define    T1COR5          5       /* Timer1 Compare bit 5 */
#define    BM_T1COR5	(uint8_t)(1U<<T1COR5)
#define    T1COR6          6       /* Timer1 Compare bit 6 */
#define    BM_T1COR6	(uint8_t)(1U<<T1COR6)
#define    T1COR7          7       /* Timer1 Compare bit 7 */
#define    BM_T1COR7	(uint8_t)(1U<<T1COR7)

/* T1CR - Timer1 control Register */
#define    T1OTM           0       /* Timer1 Overflow Toggle Mask */
#define    BM_T1OTM	(uint8_t)(1U<<T1OTM)
#define    T1CTM           1       /* Timer1 Compare Toggle Mask */
#define    BM_T1CTM	(uint8_t)(1U<<T1CTM)
#define    T1CRM           2       /* Timer1 Compare Reset Mask */
#define    BM_T1CRM	(uint8_t)(1U<<T1CRM)
#define    T1TOP           4       /* Timer1 Toggle Output Preset */
#define    BM_T1TOP	(uint8_t)(1U<<T1TOP)
#define    T1RES           5       /* Timer1 Reset */
#define    BM_T1RES	(uint8_t)(1U<<T1RES)
#define    T1TOS           6       /* Timer1 Toggle with Start */
#define    BM_T1TOS	(uint8_t)(1U<<T1TOS)
#define    T1ENA           7       /* Timer1 Enable */
#define    BM_T1ENA	(uint8_t)(1U<<T1ENA)

/* T1IFR - Timer1 Interrupt Flag Register */
#define    T1OFF           0       /* Timer1 Overflow Flag */
#define    BM_T1OFF	(uint8_t)(1U<<T1OFF)
#define    T1COF           1       /* Timer1 Compare Flag */
#define    BM_T1COF	(uint8_t)(1U<<T1COF)

/* T1IMR - Timer1 Interrupt Mask Register */
#define    T1OIM           0       /* Timer1 Overflow Interrupt Mask */
#define    BM_T1OIM	(uint8_t)(1U<<T1OIM)
#define    T1CIM           1       /* Timer1 Compare Interrupt Mask */
#define    BM_T1CIM	(uint8_t)(1U<<T1CIM)

/* T1MR - Timer1 Mode Register */
#define    T1CS0           0       /* Timer1 Clock Select bit 0 */
#define    BM_T1CS0	(uint8_t)(1U<<T1CS0)
#define    T1CS1           1       /* Timer1 Clock Select bit 1 */
#define    BM_T1CS1	(uint8_t)(1U<<T1CS1)
#define    T1PS0           2       /* Timer1 Prescaler Select bit 0 */
#define    BM_T1PS0	(uint8_t)(1U<<T1PS0)
#define    T1PS1           3       /* Timer1 Prescaler Select bit 1 */
#define    BM_T1PS1	(uint8_t)(1U<<T1PS1)
#define    T1PS2           4       /* Timer1 Prescaler Select bit 2 */
#define    BM_T1PS2	(uint8_t)(1U<<T1PS2)
#define    T1PS3           5       /* Timer1 Prescaler Select bit 3 */
#define    BM_T1PS3	(uint8_t)(1U<<T1PS3)
#define    T1DC0           6       /* Timer1 Duty Cycle bit 0 */
#define    BM_T1DC0	(uint8_t)(1U<<T1DC0)
#define    T1DC1           7       /* Timer1 Duty Cycle bit 1 */
#define    BM_T1DC1	(uint8_t)(1U<<T1DC1)


/* ***** TIMER2 *********************** */
/* T2CNT - Timer2 Counter Register */
#define    T2CNT0          0       /* Timer2 Counter bit 0 */
#define    BM_T2CNT0	(uint8_t)(1U<<T2CNT0)
#define    T2CNT1          1       /* Timer2 Counter bit 1 */
#define    BM_T2CNT1	(uint8_t)(1U<<T2CNT1)
#define    T2CNT2          2       /* Timer2 Counter bit 2 */
#define    BM_T2CNT2	(uint8_t)(1U<<T2CNT2)
#define    T2CNT3          3       /* Timer2 Counter bit 3 */
#define    BM_T2CNT3	(uint8_t)(1U<<T2CNT3)
#define    T2CNT4          4       /* Timer2 Counter bit 4 */
#define    BM_T2CNT4	(uint8_t)(1U<<T2CNT4)
#define    T2CNT5          5       /* Timer2 Counter bit 5 */
#define    BM_T2CNT5	(uint8_t)(1U<<T2CNT5)
#define    T2CNT6          6       /* Timer2 Counter bit 6 */
#define    BM_T2CNT6	(uint8_t)(1U<<T2CNT6)
#define    T2CNT7          7       /* Timer2 Counter bit 7 */
#define    BM_T2CNT7	(uint8_t)(1U<<T2CNT7)

/* T2COR - Timer2 Compare Register */
#define    T2COR0          0       /* Timer2 Compare bit 0 */
#define    BM_T2COR0	(uint8_t)(1U<<T2COR0)
#define    T2COR1          1       /* Timer2 Compare bit 1 */
#define    BM_T2COR1	(uint8_t)(1U<<T2COR1)
#define    T2COR2          2       /* Timer2 Compare bit 2 */
#define    BM_T2COR2	(uint8_t)(1U<<T2COR2)
#define    T2COR3          3       /* Timer2 Compare bit 3 */
#define    BM_T2COR3	(uint8_t)(1U<<T2COR3)
#define    T2COR4          4       /* Timer2 Compare bit 4 */
#define    BM_T2COR4	(uint8_t)(1U<<T2COR4)
#define    T2COR5          5       /* Timer2 Compare bit 5 */
#define    BM_T2COR5	(uint8_t)(1U<<T2COR5)
#define    T2COR6          6       /* Timer2 Compare bit 6 */
#define    BM_T2COR6	(uint8_t)(1U<<T2COR6)
#define    T2COR7          7       /* Timer2 Compare bit 7 */
#define    BM_T2COR7	(uint8_t)(1U<<T2COR7)

/* T2CR - Timer2 Control Register */
#define    T2OTM           0       /* Timer2 Overflow Toggle Mask */
#define    BM_T2OTM	(uint8_t)(1U<<T2OTM)
#define    T2CTM           1       /* Timer2 Compare Toggle Mask */
#define    BM_T2CTM	(uint8_t)(1U<<T2CTM)
#define    T2CRM           2       /* Timer2 Compare Reset Mask */
#define    BM_T2CRM	(uint8_t)(1U<<T2CRM)
#define    T2TOP           4       /* Timer2 Toggle Output Preset */
#define    BM_T2TOP	(uint8_t)(1U<<T2TOP)
#define    T2RES           5       /* Timer2 Reset */
#define    BM_T2RES	(uint8_t)(1U<<T2RES)
#define    T2TOS           6       /* Timer2 Toggle with Start */
#define    BM_T2TOS	(uint8_t)(1U<<T2TOS)
#define    T2ENA           7       /* Timer2 Enable */
#define    BM_T2ENA	(uint8_t)(1U<<T2ENA)

/* T2IFR - Timer2 Interrupt Flag Register */
#define    T2OFF           0       /* Timer2 Overflow Flag */
#define    BM_T2OFF	(uint8_t)(1U<<T2OFF)
#define    T2COF           1       /* Timer2 Compare Flag */
#define    BM_T2COF	(uint8_t)(1U<<T2COF)

/* T2IMR - Timer2 Interrupt Mask Register */
#define    T2OIM           0       /* Timer2 Overflow Interrupt Mask */
#define    BM_T2OIM	(uint8_t)(1U<<T2OIM)
#define    T2CIM           1       /* Timer2 Compare Interrupt Mask */
#define    BM_T2CIM	(uint8_t)(1U<<T2CIM)

