camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* T2MR - Timer2 Mode Register */
#define    T2CS0           0       /* Timer2 Clock Select bit 0 */
#define    BM_T2CS0	(uint8_t)(1U<<T2CS0)
#define    T2CS1           1       /* Timer2 Clock Select bit 1 */
#define    BM_T2CS1	(uint8_t)(1U<<T2CS1)
#define    T2PS0           2       /* Timer2 Prescaler Select bit 0 */
#define    BM_T2PS0	(uint8_t)(1U<<T2PS0)
#define    T2PS1           3       /* Timer2 Prescaler Select bit 1 */
#define    BM_T2PS1	(uint8_t)(1U<<T2PS1)
#define    T2PS2           4       /* Timer2 Prescaler Select bit 2 */
#define    BM_T2PS2	(uint8_t)(1U<<T2PS2)
#define    T2PS3           5       /* Timer2 Prescaler Select bit 3 */
#define    BM_T2PS3	(uint8_t)(1U<<T2PS3)
#define    T2DC0           6       /* Timer2 Duty Cycle bit 0 */
#define    BM_T2DC0	(uint8_t)(1U<<T2DC0)
#define    T2DC1           7       /* Timer2 Duty Cycle bit 1 */
#define    BM_T2DC1	(uint8_t)(1U<<T2DC1)


/* ***** TIMER3 *********************** */
/* T3CNTH - Timer3 counter High Byte Register */
#define    T3CNT8          0       /* Timer3 counter bit 8 */
#define    BM_T3CNT8	(uint8_t)(1U<<T3CNT8)
#define    T3CNT9          1       /* Timer3 counter bit 9 */
#define    BM_T3CNT9	(uint8_t)(1U<<T3CNT9)
#define    T3CNT10         2       /* Timer3 counter bit 10 */
#define    BM_T3CNT10	(uint8_t)(1U<<T3CNT10)
#define    T3CNT11         3       /* Timer3 counter bit 11 */
#define    BM_T3CNT11	(uint8_t)(1U<<T3CNT11)
#define    T3CNT12         4       /* Timer3 counter bit 12 */
#define    BM_T3CNT12	(uint8_t)(1U<<T3CNT12)
#define    T3CNT13         5       /* Timer3 counter bit 13 */
#define    BM_T3CNT13	(uint8_t)(1U<<T3CNT13)
#define    T3CNT14         6       /* Timer3 counter bit 14 */
#define    BM_T3CNT14	(uint8_t)(1U<<T3CNT14)
#define    T3CNT15         7       /* Timer3 counter bit 15 */
#define    BM_T3CNT15	(uint8_t)(1U<<T3CNT15)

/* T3CNTL - Timer3 counter Low Byte Register */
#define    T3CNT0          0       /* Timer3 counter bit 0 */
#define    BM_T3CNT0	(uint8_t)(1U<<T3CNT0)
#define    T3CNT1          1       /* Timer3 counter bit 1 */
#define    BM_T3CNT1	(uint8_t)(1U<<T3CNT1)
#define    T3CNT2          2       /* Timer3 counter bit 2 */
#define    BM_T3CNT2	(uint8_t)(1U<<T3CNT2)
#define    T3CNT3          3       /* Timer3 counter bit 3 */
#define    BM_T3CNT3	(uint8_t)(1U<<T3CNT3)
#define    T3CNT4          4       /* Timer3 counter bit 4 */
#define    BM_T3CNT4	(uint8_t)(1U<<T3CNT4)
#define    T3CNT5          5       /* Timer3 counter bit 5 */
#define    BM_T3CNT5	(uint8_t)(1U<<T3CNT5)
#define    T3CNT6          6       /* Timer3 counter bit 6 */
#define    BM_T3CNT6	(uint8_t)(1U<<T3CNT6)
#define    T3CNT7          7       /* Timer3 counter bit 7 */
#define    BM_T3CNT7	(uint8_t)(1U<<T3CNT7)

/* T3CORH - Timer3 compare High Byte Register */
#define    T3COR8          0       /* Timer3 compare bit 8 */
#define    BM_T3COR8	(uint8_t)(1U<<T3COR8)
#define    T3COR9          1       /* Timer3 compare bit 9 */
#define    BM_T3COR9	(uint8_t)(1U<<T3COR9)
#define    T3COR10         2       /* Timer3 compare bit 10 */
#define    BM_T3COR10	(uint8_t)(1U<<T3COR10)
#define    T3COR11         3       /* Timer3 compare bit 11 */
#define    BM_T3COR11	(uint8_t)(1U<<T3COR11)
#define    T3COR12         4       /* Timer3 compare bit 12 */
#define    BM_T3COR12	(uint8_t)(1U<<T3COR12)
#define    T3COR13         5       /* Timer3 compare bit 13 */
#define    BM_T3COR13	(uint8_t)(1U<<T3COR13)
#define    T3COR14         6       /* Timer3 compare bit 14 */
#define    BM_T3COR14	(uint8_t)(1U<<T3COR14)
#define    T3COR15         7       /* Timer3 compare bit 15 */
#define    BM_T3COR15	(uint8_t)(1U<<T3COR15)

/* T3CORL - Timer3 compare Low Byte Register */
#define    T3COR0          0       /* Timer3 compare bit 0 */
#define    BM_T3COR0	(uint8_t)(1U<<T3COR0)
#define    T3COR1          1       /* Timer3 compare bit 1 */
#define    BM_T3COR1	(uint8_t)(1U<<T3COR1)
#define    T3COR2          2       /* Timer3 compare bit 2 */
#define    BM_T3COR2	(uint8_t)(1U<<T3COR2)
#define    T3COR3          3       /* Timer3 compare bit 3 */
#define    BM_T3COR3	(uint8_t)(1U<<T3COR3)
#define    T3COR4          4       /* Timer3 compare bit 4 */
#define    BM_T3COR4	(uint8_t)(1U<<T3COR4)
#define    T3COR5          5       /* Timer3 compare bit 5 */
#define    BM_T3COR5	(uint8_t)(1U<<T3COR5)
#define    T3COR6          6       /* Timer3 compare bit 6 */
#define    BM_T3COR6	(uint8_t)(1U<<T3COR6)
#define    T3COR7          7       /* Timer3 compare bit 7 */
#define    BM_T3COR7	(uint8_t)(1U<<T3COR7)

/* T3CR - Timer3 control Register */
#define    T3OTM           0       /* Timer3 Overflow Toggle Mask */
#define    BM_T3OTM	(uint8_t)(1U<<T3OTM)
#define    T3CTM           1       /* Timer3 Compare Toggle Mask */
#define    BM_T3CTM	(uint8_t)(1U<<T3CTM)
#define    T3CRM           2       /* Timer3 Compare Reset Mask */
#define    BM_T3CRM	(uint8_t)(1U<<T3CRM)
#define    T3CPRM          3       /* Timer3 CaPture Reset Mask */
#define    BM_T3CPRM	(uint8_t)(1U<<T3CPRM)
#define    T3TOP           4       /* Timer3 Toggle Output Preset */
#define    BM_T3TOP	(uint8_t)(1U<<T3TOP)
#define    T3RES           5       /* Timer3 Reset */
#define    BM_T3RES	(uint8_t)(1U<<T3RES)
#define    T3TOS           6       /* Timer3 Toggle with Start */
#define    BM_T3TOS	(uint8_t)(1U<<T3TOS)
#define    T3ENA           7       /* Timer3 Enable */
#define    BM_T3ENA	(uint8_t)(1U<<T3ENA)

/* T3ICRH - Timer3 input capture High Byte Register */
#define    T3ICR8          0       /* Timer3 input capture bit 8 */
#define    BM_T3ICR8	(uint8_t)(1U<<T3ICR8)
#define    T3ICR9          1       /* Timer3 input capture bit 9 */
#define    BM_T3ICR9	(uint8_t)(1U<<T3ICR9)
#define    T3ICR10         2       /* Timer3 input capture bit 10 */
#define    BM_T3ICR10	(uint8_t)(1U<<T3ICR10)
#define    T3ICR11         3       /* Timer3 input capture bit 11 */
#define    BM_T3ICR11	(uint8_t)(1U<<T3ICR11)
#define    T3ICR12         4       /* Timer3 input capture bit 12 */
#define    BM_T3ICR12	(uint8_t)(1U<<T3ICR12)
#define    T3ICR13         5       /* Timer3 input capture bit 13 */
#define    BM_T3ICR13	(uint8_t)(1U<<T3ICR13)
#define    T3ICR14         6       /* Timer3 input capture bit 14 */
#define    BM_T3ICR14	(uint8_t)(1U<<T3ICR14)
#define    T3ICR15         7       /* Timer3 input capture bit 15 */
#define    BM_T3ICR15	(uint8_t)(1U<<T3ICR15)

/* T3ICRL - Timer3 input capture Low Byte Register */
#define    T3ICR0          0       /* Timer3 input capture bit 0 */
#define    BM_T3ICR0	(uint8_t)(1U<<T3ICR0)
#define    T3ICR1          1       /* Timer3 input capture bit 1 */
#define    BM_T3ICR1	(uint8_t)(1U<<T3ICR1)
#define    T3ICR2          2       /* Timer3 input capture bit 2 */
#define    BM_T3ICR2	(uint8_t)(1U<<T3ICR2)
#define    T3ICR3          3       /* Timer3 input capture bit 3 */
#define    BM_T3ICR3	(uint8_t)(1U<<T3ICR3)
#define    T3ICR4          4       /* Timer3 input capture bit 4 */
#define    BM_T3ICR4	(uint8_t)(1U<<T3ICR4)
#define    T3ICR5          5       /* Timer3 input capture bit 5 */
#define    BM_T3ICR5	(uint8_t)(1U<<T3ICR5)
#define    T3ICR6          6       /* Timer3 input capture bit 6 */
#define    BM_T3ICR6	(uint8_t)(1U<<T3ICR6)
#define    T3ICR7          7       /* Timer3 input capture bit 7 */
#define    BM_T3ICR7	(uint8_t)(1U<<T3ICR7)

/* T3IFR - Timer3 interrupt flag Register */
#define    T3OFF           0       /* Timer3 OverFlow Flag */
#define    BM_T3OFF	(uint8_t)(1U<<T3OFF)
#define    T3COF           1       /* Timer3 Compare Flag */
#define    BM_T3COF	(uint8_t)(1U<<T3COF)
#define    T3ICF           2       /* Timer3 Input Capture Flag */
#define    BM_T3ICF	(uint8_t)(1U<<T3ICF)

/* T3IMR - Timer3 interrupt mask Register */
#define    T3OIM           0       /* Timer3 Overflow Interrupt Mask */
#define    BM_T3OIM	(uint8_t)(1U<<T3OIM)
#define    T3CIM           1       /* Timer3 Compare Interrupt Mask */
#define    BM_T3CIM	(uint8_t)(1U<<T3CIM)
#define    T3CPIM          2       /* Timer3 Capture Interrupt Mask */
#define    BM_T3CPIM	(uint8_t)(1U<<T3CPIM)

/* T3MRA - Timer3 mode Register */
#define    T3CS0           0       /* Timer3 Clock Select bit 0 */
#define    BM_T3CS0	(uint8_t)(1U<<T3CS0)
#define    T3CS1           1       /* Timer3 Clock Select bit 1 */
#define    BM_T3CS1	(uint8_t)(1U<<T3CS1)
#define    T3PS0           2       /* Timer3 Prescaler Select bit 0 */
#define    BM_T3PS0	(uint8_t)(1U<<T3PS0)
#define    T3PS1           3       /* Timer3 Prescaler Select bit 1 */
#define    BM_T3PS1	(uint8_t)(1U<<T3PS1)
#define    T3PS2           4       /* Timer3 Prescaler Select bit 2 */
#define    BM_T3PS2	(uint8_t)(1U<<T3PS2)

/* T3MRB - Timer3 mode Register */
#define    T3SCE           1       /* Timer3 Software Capture Enable */
#define    BM_T3SCE	(uint8_t)(1U<<T3SCE)
#define    T3CNC           2       /* Timer3 input Capture Noise Canceller */
#define    BM_T3CNC	(uint8_t)(1U<<T3CNC)
#define    T3CE0           3       /* Timer3 Capture Edge select bit 0 */
#define    BM_T3CE0	(uint8_t)(1U<<T3CE0)
#define    T3CE1           4       /* Timer3 Capture Edge select bit 1 */
#define    BM_T3CE1	(uint8_t)(1U<<T3CE1)
#define    T3ICS0          5       /* Timer3 Input Capture Select bit 0 */
#define    BM_T3ICS0	(uint8_t)(1U<<T3ICS0)
#define    T3ICS1          6       /* Timer3 Input Capture Select bit 1 */
#define    BM_T3ICS1	(uint8_t)(1U<<T3ICS1)
#define    T3ICS2          7       /* Timer3 Input Capture Select bit 2 */
#define    BM_T3ICS2	(uint8_t)(1U<<T3ICS2)


