camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* ***** TIMER4 *********************** */
/* T4CNTH - Timer4 counter High Byte Register */
#define    T4CNT8          0       /* Timer4 counter bit 8 */
#define    BM_T4CNT8	(uint8_t)(1U<<T4CNT8)
#define    T4CNT9          1       /* Timer4 counter bit 9 */
#define    BM_T4CNT9	(uint8_t)(1U<<T4CNT9)
#define    T4CNT10         2       /* Timer4 counter bit 10 */
#define    BM_T4CNT10	(uint8_t)(1U<<T4CNT10)
#define    T4CNT11         3       /* Timer4 counter bit 11 */
#define    BM_T4CNT11	(uint8_t)(1U<<T4CNT11)
#define    T4CNT12         4       /* Timer4 counter bit 12 */
#define    BM_T4CNT12	(uint8_t)(1U<<T4CNT12)
#define    T4CNT13         5       /* Timer4 counter bit 13 */
#define    BM_T4CNT13	(uint8_t)(1U<<T4CNT13)
#define    T4CNT14         6       /* Timer4 counter bit 14 */
#define    BM_T4CNT14	(uint8_t)(1U<<T4CNT14)
#define    T4CNT15         7       /* Timer4 counter bit 15 */
#define    BM_T4CNT15	(uint8_t)(1U<<T4CNT15)

/* T4CNTL - Timer4 counter Low Byte Register */
#define    T4CNT0          0       /* Timer4 counter bit 0 */
#define    BM_T4CNT0	(uint8_t)(1U<<T4CNT0)
#define    T4CNT1          1       /* Timer4 counter bit 1 */
#define    BM_T4CNT1	(uint8_t)(1U<<T4CNT1)
#define    T4CNT2          2       /* Timer4 counter bit 2 */
#define    BM_T4CNT2	(uint8_t)(1U<<T4CNT2)
#define    T4CNT3          3       /* Timer4 counter bit 3 */
#define    BM_T4CNT3	(uint8_t)(1U<<T4CNT3)
#define    T4CNT4          4       /* Timer4 counter bit 4 */
#define    BM_T4CNT4	(uint8_t)(1U<<T4CNT4)
#define    T4CNT5          5       /* Timer4 counter bit 5 */
#define    BM_T4CNT5	(uint8_t)(1U<<T4CNT5)
#define    T4CNT6          6       /* Timer4 counter bit 6 */
#define    BM_T4CNT6	(uint8_t)(1U<<T4CNT6)
#define    T4CNT7          7       /* Timer4 counter bit 7 */
#define    BM_T4CNT7	(uint8_t)(1U<<T4CNT7)

/* T4CORH - Timer4 compare high Byte Register */
#define    T4COR8          0       /* Timer4 compare bit 8 */
#define    BM_T4COR8	(uint8_t)(1U<<T4COR8)
#define    T4COR9          1       /* Timer4 compare bit 9 */
#define    BM_T4COR9	(uint8_t)(1U<<T4COR9)
#define    T4COR10         2       /* Timer4 compare bit 10 */
#define    BM_T4COR10	(uint8_t)(1U<<T4COR10)
#define    T4COR11         3       /* Timer4 compare bit 11 */
#define    BM_T4COR11	(uint8_t)(1U<<T4COR11)
#define    T4COR12         4       /* Timer4 compare bit 12 */
#define    BM_T4COR12	(uint8_t)(1U<<T4COR12)
#define    T4COR13         5       /* Timer4 compare bit 13 */
#define    BM_T4COR13	(uint8_t)(1U<<T4COR13)
#define    T4COR14         6       /* Timer4 compare bit 14 */
#define    BM_T4COR14	(uint8_t)(1U<<T4COR14)
#define    T4COR15         7       /* Timer4 compare bit 15 */
#define    BM_T4COR15	(uint8_t)(1U<<T4COR15)

/* T4CORL - Timer4 compare Low Byte Register */
#define    T4COR0          0       /* Timer4 compare bit 0 */
#define    BM_T4COR0	(uint8_t)(1U<<T4COR0)
#define    T4COR1          1       /* Timer4 compare bit 1 */
#define    BM_T4COR1	(uint8_t)(1U<<T4COR1)
#define    T4COR2          2       /* Timer4 compare bit 2 */
#define    BM_T4COR2	(uint8_t)(1U<<T4COR2)
#define    T4COR3          3       /* Timer4 compare bit 3 */
#define    BM_T4COR3	(uint8_t)(1U<<T4COR3)
#define    T4COR4          4       /* Timer4 compare bit 4 */
#define    BM_T4COR4	(uint8_t)(1U<<T4COR4)
#define    T4COR5          5       /* Timer4 compare bit 5 */
#define    BM_T4COR5	(uint8_t)(1U<<T4COR5)
#define    T4COR6          6       /* Timer4 compare bit 6 */
#define    BM_T4COR6	(uint8_t)(1U<<T4COR6)
#define    T4COR7          7       /* Timer4 compare bit 7 */
#define    BM_T4COR7	(uint8_t)(1U<<T4COR7)

/* T4CR - Timer4 control Register */
#define    T4OTM           0       /* Timer4 Overflow Toggle Mask */
#define    BM_T4OTM	(uint8_t)(1U<<T4OTM)
#define    T4CTM           1       /* Timer4 Compare Toggle Mask */
#define    BM_T4CTM	(uint8_t)(1U<<T4CTM)
#define    T4CRM           2       /* Timer4 Compare Reset Mask */
#define    BM_T4CRM	(uint8_t)(1U<<T4CRM)
#define    T4CPRM          3       /* Timer4 CaPture Reset Mask */
#define    BM_T4CPRM	(uint8_t)(1U<<T4CPRM)
#define    T4TOP           4       /* Timer4 Toggle Output Preset */
#define    BM_T4TOP	(uint8_t)(1U<<T4TOP)
#define    T4RES           5       /* Timer4 Reset */
#define    BM_T4RES	(uint8_t)(1U<<T4RES)
#define    T4TOS           6       /* Timer4 Toggle with Start */
#define    BM_T4TOS	(uint8_t)(1U<<T4TOS)
#define    T4ENA           7       /* Timer4 Enable */
#define    BM_T4ENA	(uint8_t)(1U<<T4ENA)

/* T4ICRH - Timer4 input capture High Byte Register */
#define    T4ICR8          0       /* Timer4 input capture bit 8 */
#define    BM_T4ICR8	(uint8_t)(1U<<T4ICR8)
#define    T4ICR9          1       /* Timer4 input capture bit 9 */
#define    BM_T4ICR9	(uint8_t)(1U<<T4ICR9)
#define    T4ICR10         2       /* Timer4 input capture bit 10 */
#define    BM_T4ICR10	(uint8_t)(1U<<T4ICR10)
#define    T4ICR11         3       /* Timer4 input capture bit 11 */
#define    BM_T4ICR11	(uint8_t)(1U<<T4ICR11)
#define    T4ICR12         4       /* Timer4 input capture bit 12 */
#define    BM_T4ICR12	(uint8_t)(1U<<T4ICR12)
#define    T4ICR13         5       /* Timer4 input capture bit 13 */
#define    BM_T4ICR13	(uint8_t)(1U<<T4ICR13)
#define    T4ICR14         6       /* Timer4 input capture bit 14 */
#define    BM_T4ICR14	(uint8_t)(1U<<T4ICR14)
#define    T4ICR15         7       /* Timer4 input capture bit 15 */
#define    BM_T4ICR15	(uint8_t)(1U<<T4ICR15)

/* T4ICRL - Timer4 input capture Low Byte Register */
#define    T4ICR0          0       /* Timer4 input capture bit 0 */
#define    BM_T4ICR0	(uint8_t)(1U<<T4ICR0)
#define    T4ICR1          1       /* Timer4 input capture bit 1 */
#define    BM_T4ICR1	(uint8_t)(1U<<T4ICR1)
#define    T4ICR2          2       /* Timer4 input capture bit 2 */
#define    BM_T4ICR2	(uint8_t)(1U<<T4ICR2)
#define    T4ICR3          3       /* Timer4 input capture bit 3 */
#define    BM_T4ICR3	(uint8_t)(1U<<T4ICR3)
#define    T4ICR4          4       /* Timer4 input capture bit 4 */
#define    BM_T4ICR4	(uint8_t)(1U<<T4ICR4)
#define    T4ICR5          5       /* Timer4 input capture bit 5 */
#define    BM_T4ICR5	(uint8_t)(1U<<T4ICR5)
#define    T4ICR6          6       /* Timer4 input capture bit 6 */
#define    BM_T4ICR6	(uint8_t)(1U<<T4ICR6)
#define    T4ICR7          7       /* Timer4 input capture bit 7 */
#define    BM_T4ICR7	(uint8_t)(1U<<T4ICR7)

/* T4IFR - Timer4 interrupt flag Register */
#define    T4OFF           0       /* Timer4 OverFlow Flag */
#define    BM_T4OFF	(uint8_t)(1U<<T4OFF)
#define    T4COF           1       /* Timer4 Compare Flag */
#define    BM_T4COF	(uint8_t)(1U<<T4COF)
#define    T4ICF           2       /* Timer4 Input Capture Flag */
#define    BM_T4ICF	(uint8_t)(1U<<T4ICF)

/* T4IMR - Timer4 interrupt mask Register */
#define    T4OIM           0       /* Timer4 Overflow Interrupt Mask */
#define    BM_T4OIM	(uint8_t)(1U<<T4OIM)
#define    T4CIM           1       /* Timer4 Compare Interrupt Mask */
#define    BM_T4CIM	(uint8_t)(1U<<T4CIM)
#define    T4CPIM          2       /* Timer4 Capture Interrupt Mask */
#define    BM_T4CPIM	(uint8_t)(1U<<T4CPIM)

/* T4MRA - Timer4 mode Register */
#define    T4CS0           0       /* Timer4 Clock Select bit 0 */
#define    BM_T4CS0	(uint8_t)(1U<<T4CS0)
#define    T4CS1           1       /* Timer4 Clock Select bit 1 */
#define    BM_T4CS1	(uint8_t)(1U<<T4CS1)
#define    T4PS0           2       /* Timer4 Prescaler Select bit 0 */
#define    BM_T4PS0	(uint8_t)(1U<<T4PS0)
#define    T4PS1           3       /* Timer4 Prescaler Select bit 1 */
#define    BM_T4PS1	(uint8_t)(1U<<T4PS1)
#define    T4PS2           4       /* Timer4 Prescaler Select bit 2 */
#define    BM_T4PS2	(uint8_t)(1U<<T4PS2)

/* T4MRB - Timer4 mode Register */
#define    T4SCE           1       /* Timer4 Software Capture Enable */
#define    BM_T4SCE	(uint8_t)(1U<<T4SCE)
#define    T4CNC           2       /* Timer4 input Capture Noise Canceller */
#define    BM_T4CNC	(uint8_t)(1U<<T4CNC)
#define    T4CE0           3       /* Timer4 Capture Edge select bit 0 */
#define    BM_T4CE0	(uint8_t)(1U<<T4CE0)
#define    T4CE1           4       /* Timer4 Capture Edge select bit 1 */
#define    BM_T4CE1	(uint8_t)(1U<<T4CE1)
#define    T4ICS0          5       /* Timer4 Input Capture Select bit 0 */
#define    BM_T4ICS0	(uint8_t)(1U<<T4ICS0)
#define    T4ICS1          6       /* Timer4 Input Capture Select bit 1 */
#define    BM_T4ICS1	(uint8_t)(1U<<T4ICS1)
#define    T4ICS2          7       /* Timer4 Input Capture Select bit 2 */
#define    BM_T4ICS2	(uint8_t)(1U<<T4ICS2)


/* ***** TIMER5 *********************** */
/* GTCCR - General Timer/Counter Control Register */
#define    PSR10           0       /* PreScaler Reset */
#define    BM_PSR10	(uint8_t)(1U<<PSR10)
#define    TSM             7       /* Timer/Counter Synchronization Mode */
#define    BM_TSM	(uint8_t)(1U<<TSM)

/* T5CCR - Timer5 Control Register */
#define    T5CS0           0       /* Timer5 Clock Select bit 0 */
#define    BM_T5CS0	(uint8_t)(1U<<T5CS0)
#define    T5CS1           1       /* Timer5 Clock Select bit 1 */
#define    BM_T5CS1	(uint8_t)(1U<<T5CS1)
#define    T5CS2           2       /* Timer5 Clock Select bit 2 */
#define    BM_T5CS2	(uint8_t)(1U<<T5CS2)
#define    T5CTC           3       /* Clear Timer5 on Compare Match */
#define    BM_T5CTC	(uint8_t)(1U<<T5CTC)

