camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* TPSR - Transponder Status Register */
#define    TPA             0       /* Transponder Active */
#define    BM_TPA	(uint8_t)(1U<<TPA)
#define    TPGAP           1       /* Transponder GAP Signal */
#define    BM_TPGAP	(uint8_t)(1U<<TPGAP)
#define    TPPSW           2       /* Transponder Power Switch */
#define    BM_TPPSW	(uint8_t)(1U<<TPPSW)
#define    TPBCOK          3       /* Transponder Battery Charge OK */
#define    BM_TPBCOK	(uint8_t)(1U<<TPBCOK)


/* ***** TWI ************************** */
/* TWAMR - TWI Address Mask Register */
#define    TWAM0           1       /* TWI Address Mask bit 0 */
#define    BM_TWAM0	(uint8_t)(1U<<TWAM0)
#define    TWAM1           2       /* TWI Address Mask bit 1 */
#define    BM_TWAM1	(uint8_t)(1U<<TWAM1)
#define    TWAM2           3       /* TWI Address Mask bit 2 */
#define    BM_TWAM2	(uint8_t)(1U<<TWAM2)
#define    TWAM3           4       /* TWI Address Mask bit 3 */
#define    BM_TWAM3	(uint8_t)(1U<<TWAM3)
#define    TWAM4           5       /* TWI Address Mask bit 4 */
#define    BM_TWAM4	(uint8_t)(1U<<TWAM4)
#define    TWAM5           6       /* TWI Address Mask bit 5 */
#define    BM_TWAM5	(uint8_t)(1U<<TWAM5)
#define    TWAM6           7       /* TWI Address Mask bit 6 */
#define    BM_TWAM6	(uint8_t)(1U<<TWAM6)

/* TWAR - TWI (Slave) Address Register */
#define    TWGCE           0       /* TWI General Call Recognition Enable */
#define    BM_TWGCE	(uint8_t)(1U<<TWGCE)
#define    TWA0            1       /* TWI (Slave) Address bit 0 */
#define    BM_TWA0	(uint8_t)(1U<<TWA0)
#define    TWA1            2       /* TWI (Slave) Address bit 1 */
#define    BM_TWA1	(uint8_t)(1U<<TWA1)
#define    TWA2            3       /* TWI (Slave) Address bit 2 */
#define    BM_TWA2	(uint8_t)(1U<<TWA2)
#define    TWA3            4       /* TWI (Slave) Address bit 3 */
#define    BM_TWA3	(uint8_t)(1U<<TWA3)
#define    TWA4            5       /* TWI (Slave) Address bit 4 */
#define    BM_TWA4	(uint8_t)(1U<<TWA4)
#define    TWA5            6       /* TWI (Slave) Address bit 5 */
#define    BM_TWA5	(uint8_t)(1U<<TWA5)
#define    TWA6            7       /* TWI (Slave) Address bit 6 */
#define    BM_TWA6	(uint8_t)(1U<<TWA6)

/* TWBR - TWI Bit Rate Register */
#define    TWBR0           0       /* TWI Bit Rate bit 0 */
#define    BM_TWBR0	(uint8_t)(1U<<TWBR0)
#define    TWBR1           1       /* TWI Bit Rate bit 1 */
#define    BM_TWBR1	(uint8_t)(1U<<TWBR1)
#define    TWBR2           2       /* TWI Bit Rate bit 2 */
#define    BM_TWBR2	(uint8_t)(1U<<TWBR2)
#define    TWBR3           3       /* TWI Bit Rate bit 3 */
#define    BM_TWBR3	(uint8_t)(1U<<TWBR3)
#define    TWBR4           4       /* TWI Bit Rate bit 4 */
#define    BM_TWBR4	(uint8_t)(1U<<TWBR4)
#define    TWBR5           5       /* TWI Bit Rate bit 5 */
#define    BM_TWBR5	(uint8_t)(1U<<TWBR5)
#define    TWBR6           6       /* TWI Bit Rate bit 6 */
#define    BM_TWBR6	(uint8_t)(1U<<TWBR6)
#define    TWBR7           7       /* TWI Bit Rate bit 7 */
#define    BM_TWBR7	(uint8_t)(1U<<TWBR7)

/* TWCR - TWI Control Register */
#define    TWIE            0       /* TWI Interrupt Enable */
#define    BM_TWIE	(uint8_t)(1U<<TWIE)
#define    TWEN            2       /* TWI Enable */
#define    BM_TWEN	(uint8_t)(1U<<TWEN)
#define    TWWC            3       /* TWI Write Collision Flag */
#define    BM_TWWC	(uint8_t)(1U<<TWWC)
#define    TWSTO           4       /* TWI STOP Condition */
#define    BM_TWSTO	(uint8_t)(1U<<TWSTO)
#define    TWSTA           5       /* TWI START Condition */
#define    BM_TWSTA	(uint8_t)(1U<<TWSTA)
#define    TWEA            6       /* TWI Enable Acknowledge */
#define    BM_TWEA	(uint8_t)(1U<<TWEA)
#define    TWINT           7       /* TWI Interrupt Flag */
#define    BM_TWINT	(uint8_t)(1U<<TWINT)

/* TWDR - TWI Data Register */
#define    TWD0            0       /* TWI Data bit 0 */
#define    BM_TWD0	(uint8_t)(1U<<TWD0)
#define    TWD1            1       /* TWI Data bit 1 */
#define    BM_TWD1	(uint8_t)(1U<<TWD1)
#define    TWD2            2       /* TWI Data bit 2 */
#define    BM_TWD2	(uint8_t)(1U<<TWD2)
#define    TWD3            3       /* TWI Data bit 3 */
#define    BM_TWD3	(uint8_t)(1U<<TWD3)
#define    TWD4            4       /* TWI Data bit 4 */
#define    BM_TWD4	(uint8_t)(1U<<TWD4)
#define    TWD5            5       /* TWI Data bit 5 */
#define    BM_TWD5	(uint8_t)(1U<<TWD5)
#define    TWD6            6       /* TWI Data bit 6 */
#define    BM_TWD6	(uint8_t)(1U<<TWD6)
#define    TWD7            7       /* TWI Data bit 7 */
#define    BM_TWD7	(uint8_t)(1U<<TWD7)

/* TWSR - TWI Status Register */
#define    TWPS0           0       /* TWI Prescaler bit 0 */
#define    BM_TWPS0	(uint8_t)(1U<<TWPS0)
#define    TWPS1           1       /* TWI Prescaler bit 1 */
#define    BM_TWPS1	(uint8_t)(1U<<TWPS1)
#define    TWS0            3       /* TWI Status bit 0 */
#define    BM_TWS0	(uint8_t)(1U<<TWS0)
#define    TWS1            4       /* TWI Status bit 1 */
#define    BM_TWS1	(uint8_t)(1U<<TWS1)
#define    TWS2            5       /* TWI Status bit 2 */
#define    BM_TWS2	(uint8_t)(1U<<TWS2)
#define    TWS3            6       /* TWI Status bit 3 */
#define    BM_TWS3	(uint8_t)(1U<<TWS3)
#define    TWS4            7       /* TWI Status bit 4 */
#define    BM_TWS4	(uint8_t)(1U<<TWS4)


/* ***** TXDSP ************************ */
/* BBTE2 - Base Band Test Enable 2 */
#define    TDEPO           0       /* Tx DSP External Pin Output */
#define    BM_TDEPO	(uint8_t)(1U<<TDEPO)
#define    DITDIS          1       /* Dither Disable on Sigma Delta Modulator */
#define    BM_DITDIS	(uint8_t)(1U<<DITDIS)

/* FFREQ1H - Fractional Frequency 1 Setting, High Byte */
#define    FFREQ1H0        0       /* Fractional Frequency 1 High Byte bit 0 */
#define    BM_FFREQ1H0	(uint8_t)(1U<<FFREQ1H0)
#define    FFREQ1H1        1       /* Fractional Frequency 1 High Byte bit 1 */
#define    BM_FFREQ1H1	(uint8_t)(1U<<FFREQ1H1)

/* FFREQ1L - Fractional Frequency 1 Setting, Low Byte */
#define    FFREQ1L0        0       /* Fractional Frequency 1 Low Byte bit 0 */
#define    BM_FFREQ1L0	(uint8_t)(1U<<FFREQ1L0)
#define    FFREQ1L1        1       /* Fractional Frequency 1 Low Byte bit 1 */
#define    BM_FFREQ1L1	(uint8_t)(1U<<FFREQ1L1)
#define    FFREQ1L2        2       /* Fractional Frequency 1 Low Byte bit 2 */
#define    BM_FFREQ1L2	(uint8_t)(1U<<FFREQ1L2)
#define    FFREQ1L3        3       /* Fractional Frequency 1 Low Byte bit 3 */
#define    BM_FFREQ1L3	(uint8_t)(1U<<FFREQ1L3)
#define    FFREQ1L4        4       /* Fractional Frequency 1 Low Byte bit 4 */
#define    BM_FFREQ1L4	(uint8_t)(1U<<FFREQ1L4)
#define    FFREQ1L5        5       /* Fractional Frequency 1 Low Byte bit 5 */
#define    BM_FFREQ1L5	(uint8_t)(1U<<FFREQ1L5)
#define    FFREQ1L6        6       /* Fractional Frequency 1 Low Byte bit 6 */
#define    BM_FFREQ1L6	(uint8_t)(1U<<FFREQ1L6)
#define    FFREQ1L7        7       /* Fractional Frequency 1 Low Byte bit 7 */
#define    BM_FFREQ1L7	(uint8_t)(1U<<FFREQ1L7)

