camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* FFREQ1M - Fractional Frequency 1 Setting, Middle Byte */
#define    FFREQ1M0        0       /* Fractional Frequency 1 Middle Byte bit 0 */
#define    BM_FFREQ1M0	(uint8_t)(1U<<FFREQ1M0)
#define    FFREQ1M1        1       /* Fractional Frequency 1 Middle Byte bit 1 */
#define    BM_FFREQ1M1	(uint8_t)(1U<<FFREQ1M1)
#define    FFREQ1M2        2       /* Fractional Frequency 1 Middle Byte bit 2 */
#define    BM_FFREQ1M2	(uint8_t)(1U<<FFREQ1M2)
#define    FFREQ1M3        3       /* Fractional Frequency 1 Middle Byte bit 3 */
#define    BM_FFREQ1M3	(uint8_t)(1U<<FFREQ1M3)
#define    FFREQ1M4        4       /* Fractional Frequency 1 Middle Byte bit 4 */
#define    BM_FFREQ1M4	(uint8_t)(1U<<FFREQ1M4)
#define    FFREQ1M5        5       /* Fractional Frequency 1 Middle Byte bit 5 */
#define    BM_FFREQ1M5	(uint8_t)(1U<<FFREQ1M5)
#define    FFREQ1M6        6       /* Fractional Frequency 1 Middle Byte bit 6 */
#define    BM_FFREQ1M6	(uint8_t)(1U<<FFREQ1M6)
#define    FFREQ1M7        7       /* Fractional Frequency 1 Middle Byte bit 7 */
#define    BM_FFREQ1M7	(uint8_t)(1U<<FFREQ1M7)

/* FFREQ2H - Fractional Frequency 2 Setting, High Byte */
#define    FFREQ2H0        0       /* Fractional Frequency 2 High Byte bit 0 */
#define    BM_FFREQ2H0	(uint8_t)(1U<<FFREQ2H0)
#define    FFREQ2H1        1       /* Fractional Frequency 2 High Byte bit 1 */
#define    BM_FFREQ2H1	(uint8_t)(1U<<FFREQ2H1)

/* FFREQ2L - Fractional Frequency 2 Setting, Low Byte */
#define    FFREQ2L0        0       /* Fractional Frequency 2 Low Byte bit 0 */
#define    BM_FFREQ2L0	(uint8_t)(1U<<FFREQ2L0)
#define    FFREQ2L1        1       /* Fractional Frequency 2 Low Byte bit 1 */
#define    BM_FFREQ2L1	(uint8_t)(1U<<FFREQ2L1)
#define    FFREQ2L2        2       /* Fractional Frequency 2 Low Byte bit 2 */
#define    BM_FFREQ2L2	(uint8_t)(1U<<FFREQ2L2)
#define    FFREQ2L3        3       /* Fractional Frequency 2 Low Byte bit 3 */
#define    BM_FFREQ2L3	(uint8_t)(1U<<FFREQ2L3)
#define    FFREQ2L4        4       /* Fractional Frequency 2 Low Byte bit 4 */
#define    BM_FFREQ2L4	(uint8_t)(1U<<FFREQ2L4)
#define    FFREQ2L5        5       /* Fractional Frequency 2 Low Byte bit 5 */
#define    BM_FFREQ2L5	(uint8_t)(1U<<FFREQ2L5)
#define    FFREQ2L6        6       /* Fractional Frequency 2 Low Byte bit 6 */
#define    BM_FFREQ2L6	(uint8_t)(1U<<FFREQ2L6)
#define    FFREQ2L7        7       /* Fractional Frequency 2 Low Byte bit 7 */
#define    BM_FFREQ2L7	(uint8_t)(1U<<FFREQ2L7)

/* FFREQ2M - Fractional Frequency 2 Setting, Middle Byte */
#define    FFREQ2M0        0       /* Fractional Frequency 2 Middle Byte bit 0 */
#define    BM_FFREQ2M0	(uint8_t)(1U<<FFREQ2M0)
#define    FFREQ2M1        1       /* Fractional Frequency 2 Middle Byte bit 1 */
#define    BM_FFREQ2M1	(uint8_t)(1U<<FFREQ2M1)
#define    FFREQ2M2        2       /* Fractional Frequency 2 Middle Byte bit 2 */
#define    BM_FFREQ2M2	(uint8_t)(1U<<FFREQ2M2)
#define    FFREQ2M3        3       /* Fractional Frequency 2 Middle Byte bit 3 */
#define    BM_FFREQ2M3	(uint8_t)(1U<<FFREQ2M3)
#define    FFREQ2M4        4       /* Fractional Frequency 2 Middle Byte bit 4 */
#define    BM_FFREQ2M4	(uint8_t)(1U<<FFREQ2M4)
#define    FFREQ2M5        5       /* Fractional Frequency 2 Middle Byte bit 5 */
#define    BM_FFREQ2M5	(uint8_t)(1U<<FFREQ2M5)
#define    FFREQ2M6        6       /* Fractional Frequency 2 Middle Byte bit 6 */
#define    BM_FFREQ2M6	(uint8_t)(1U<<FFREQ2M6)
#define    FFREQ2M7        7       /* Fractional Frequency 2 Middle Byte bit 7 */
#define    BM_FFREQ2M7	(uint8_t)(1U<<FFREQ2M7)

/* FSCR - Frequency Synthesizer Control Register */
#define    TXMOD           0       /* Tx Modulation */
#define    BM_TXMOD	(uint8_t)(1U<<TXMOD)
#define    SFM             1       /* Select FSK Modulation */
#define    BM_SFM	(uint8_t)(1U<<SFM)
#define    TXMS0           2       /* Tx Modulation Source bit 0 */
#define    BM_TXMS0	(uint8_t)(1U<<TXMS0)
#define    TXMS1           3       /* Tx Modulation Source bit 1 */
#define    BM_TXMS1	(uint8_t)(1U<<TXMS1)
#define    PAOER           4       /* Power Amplifier Output Enable Register */
#define    BM_PAOER	(uint8_t)(1U<<PAOER)
#define    PAON            7       /* Power Amplifier Output is On */
#define    BM_PAON	(uint8_t)(1U<<PAON)

/* FSEN - Frequency Synthesizer Enable register */
#define    SDPU            0       /* Sigma-delta Modulator Power Up */
#define    BM_SDPU	(uint8_t)(1U<<SDPU)
#define    SDEN            1       /* Sigma-delta Modulator Enable */
#define    BM_SDEN	(uint8_t)(1U<<SDEN)
#define    GAEN            2       /* Gauss Filtering Enable */
#define    BM_GAEN	(uint8_t)(1U<<GAEN)
#define    PEEN            3       /* Pre-emphasis Filtering Enable */
#define    BM_PEEN	(uint8_t)(1U<<PEEN)
#define    ASEN            4       /* ASK Shaping Enable */
#define    BM_ASEN	(uint8_t)(1U<<ASEN)
#define    ANTT            5       /* Antenna Tuning Active */
#define    BM_ANTT	(uint8_t)(1U<<ANTT)

/* FSFCR - Frequency Synthesizer Filter Control Register */
#define    BTSEL0          0       /* Gauss Filter BT Selection bit 0 */
#define    BM_BTSEL0	(uint8_t)(1U<<BTSEL0)
#define    BTSEL1          1       /* Gauss Filter BT Selection bit 1 */
#define    BM_BTSEL1	(uint8_t)(1U<<BTSEL1)
#define    ASDIV0          4       /* ASK Shaping Divider bit 0 */
#define    BM_ASDIV0	(uint8_t)(1U<<ASDIV0)
#define    ASDIV1          5       /* ASK Shaping Divider bit 1 */
#define    BM_ASDIV1	(uint8_t)(1U<<ASDIV1)
#define    ASDIV2          6       /* ASK Shaping Divider bit 2 */
#define    BM_ASDIV2	(uint8_t)(1U<<ASDIV2)
#define    ASDIV3          7       /* ASK Shaping Divider bit 3 */
#define    BM_ASDIV3	(uint8_t)(1U<<ASDIV3)

/* GACDIVH - Gauss Clock Divider, High Byte */
#define    GACDIV8         0       /* Gauss Clock Divider bit 8 */
#define    BM_GACDIV8	(uint8_t)(1U<<GACDIV8)
#define    GACDIV9         1       /* Gauss Clock Divider bit 9 */
#define    BM_GACDIV9	(uint8_t)(1U<<GACDIV9)
#define    GACDIV10        2       /* Gauss Clock Divider bit 10 */
#define    BM_GACDIV10	(uint8_t)(1U<<GACDIV10)
#define    GACDIV11        3       /* Gauss Clock Divider bit 11 */
#define    BM_GACDIV11	(uint8_t)(1U<<GACDIV11)
#define    GACDIV12        4       /* Gauss Clock Divider bit 12 */
#define    BM_GACDIV12	(uint8_t)(1U<<GACDIV12)

/* GACDIVL - Gauss Clock Divider, Low Byte */
#define    GACDIV0         0       /* Gauss Clock Divider bit 0 */
#define    BM_GACDIV0	(uint8_t)(1U<<GACDIV0)
#define    GACDIV1         1       /* Gauss Clock Divider bit 1 */
#define    BM_GACDIV1	(uint8_t)(1U<<GACDIV1)
#define    GACDIV2         2       /* Gauss Clock Divider bit 2 */
#define    BM_GACDIV2	(uint8_t)(1U<<GACDIV2)
#define    GACDIV3         3       /* Gauss Clock Divider bit 3 */
#define    BM_GACDIV3	(uint8_t)(1U<<GACDIV3)
#define    GACDIV4         4       /* Gauss Clock Divider bit 4 */
#define    BM_GACDIV4	(uint8_t)(1U<<GACDIV4)
#define    GACDIV5         5       /* Gauss Clock Divider bit 5 */
#define    BM_GACDIV5	(uint8_t)(1U<<GACDIV5)
#define    GACDIV6         6       /* Gauss Clock Divider bit 6 */
#define    BM_GACDIV6	(uint8_t)(1U<<GACDIV6)
#define    GACDIV7         7       /* Gauss Clock Divider bit 7 */
#define    BM_GACDIV7	(uint8_t)(1U<<GACDIV7)


/* ***** TXM ************************** */
/* TMCIH - Tx Modulator CRC Init Value, High Byte */
#define    TMCI8           0       /* Tx Modulator CRC Init Value bit 8 */
#define    BM_TMCI8	(uint8_t)(1U<<TMCI8)
#define    TMCI9           1       /* Tx Modulator CRC Init Value bit 9 */
#define    BM_TMCI9	(uint8_t)(1U<<TMCI9)
#define    TMCI10          2       /* Tx Modulator CRC Init Value bit 10 */
#define    BM_TMCI10	(uint8_t)(1U<<TMCI10)
#define    TMCI11          3       /* Tx Modulator CRC Init Value bit 11 */
#define    BM_TMCI11	(uint8_t)(1U<<TMCI11)
#define    TMCI12          4       /* Tx Modulator CRC Init Value bit 12 */
#define    BM_TMCI12	(uint8_t)(1U<<TMCI12)
#define    TMCI13          5       /* Tx Modulator CRC Init Value bit 13 */
#define    BM_TMCI13	(uint8_t)(1U<<TMCI13)
#define    TMCI14          6       /* Tx Modulator CRC Init Value bit 14 */
#define    BM_TMCI14	(uint8_t)(1U<<TMCI14)
#define    TMCI15          7       /* Tx Modulator CRC Init Value bit 15 */
#define    BM_TMCI15	(uint8_t)(1U<<TMCI15)

/* TMCIL - Tx Modulator CRC Init Value Low Byte */
#define    TMCI0           0       /* Tx Modulator CRC Init Value bit 0 */
#define    BM_TMCI0	(uint8_t)(1U<<TMCI0)
#define    TMCI1           1       /* Tx Modulator CRC Init Value bit 1 */
#define    BM_TMCI1	(uint8_t)(1U<<TMCI1)
#define    TMCI2           2       /* Tx Modulator CRC Init Value bit 2 */
#define    BM_TMCI2	(uint8_t)(1U<<TMCI2)
#define    TMCI3           3       /* Tx Modulator CRC Init Value bit 3 */
#define    BM_TMCI3	(uint8_t)(1U<<TMCI3)
#define    TMCI4           4       /* Tx Modulator CRC Init Value bit 4 */
#define    BM_TMCI4	(uint8_t)(1U<<TMCI4)
#define    TMCI5           5       /* Tx Modulator CRC Init Value bit 5 */
#define    BM_TMCI5	(uint8_t)(1U<<TMCI5)
#define    TMCI6           6       /* Tx Modulator CRC Init Value bit 6 */
#define    BM_TMCI6	(uint8_t)(1U<<TMCI6)
#define    TMCI7           7       /* Tx Modulator CRC Init Value bit 7 */
#define    BM_TMCI7	(uint8_t)(1U<<TMCI7)

/* TMCPH - Tx Modulator CRC Polynomial, High Byte */
#define    TMCP8           0       /* Tx Modulator CRC Polynomial bit 8 */
#define    BM_TMCP8	(uint8_t)(1U<<TMCP8)
#define    TMCP9           1       /* Tx Modulator CRC Polynomial bit 9 */
#define    BM_TMCP9	(uint8_t)(1U<<TMCP9)
#define    TMCP10          2       /* Tx Modulator CRC Polynomial bit 10 */
#define    BM_TMCP10	(uint8_t)(1U<<TMCP10)
#define    TMCP11          3       /* Tx Modulator CRC Polynomial bit 11 */
#define    BM_TMCP11	(uint8_t)(1U<<TMCP11)
#define    TMCP12          4       /* Tx Modulator CRC Polynomial bit 12 */
#define    BM_TMCP12	(uint8_t)(1U<<TMCP12)
#define    TMCP13          5       /* Tx Modulator CRC Polynomial bit 13 */
#define    BM_TMCP13	(uint8_t)(1U<<TMCP13)
#define    TMCP14          6       /* Tx Modulator CRC Polynomial bit 14 */
#define    BM_TMCP14	(uint8_t)(1U<<TMCP14)
#define    TMCP15          7       /* Tx Modulator CRC Polynomial bit 15 */
#define    BM_TMCP15	(uint8_t)(1U<<TMCP15)

/* TMCPL - Tx Modulator CRC Polynomial, Low Byte */
#define    TMCP0           0       /* Tx Modulator CRC Polynomial bit 0 */
#define    BM_TMCP0	(uint8_t)(1U<<TMCP0)
#define    TMCP1           1       /* Tx Modulator CRC Polynomial bit 1 */
#define    BM_TMCP1	(uint8_t)(1U<<TMCP1)
#define    TMCP2           2       /* Tx Modulator CRC Polynomial bit 2 */
#define    BM_TMCP2	(uint8_t)(1U<<TMCP2)
#define    TMCP3           3       /* Tx Modulator CRC Polynomial bit 3 */
#define    BM_TMCP3	(uint8_t)(1U<<TMCP3)
#define    TMCP4           4       /* Tx Modulator CRC Polynomial bit 4 */
#define    BM_TMCP4	(uint8_t)(1U<<TMCP4)
#define    TMCP5           5       /* Tx Modulator CRC Polynomial bit 5 */
#define    BM_TMCP5	(uint8_t)(1U<<TMCP5)
#define    TMCP6           6       /* Tx Modulator CRC Polynomial bit 6 */
#define    BM_TMCP6	(uint8_t)(1U<<TMCP6)
#define    TMCP7           7       /* Tx Modulator CRC Polynomial bit 7 */
#define    BM_TMCP7	(uint8_t)(1U<<TMCP7)

/* TMCR1 - Tx Modulator Control Register 1 */
#define    TMPIS0          0       /* Tx Modulator Port Interface Select bit 0 */
#define    BM_TMPIS0	(uint8_t)(1U<<TMPIS0)
#define    TMPIS1          1       /* Tx Modulator Port Interface Select bit 1 */
#define    BM_TMPIS1	(uint8_t)(1U<<TMPIS1)
#define    TMPIS2          2       /* Tx Modulator Port Interface Select bit 2 */
#define    BM_TMPIS2	(uint8_t)(1U<<TMPIS2)
#define    TMSCS           3       /* Tx Modulator Serial Output Clock Select */
#define    BM_TMSCS	(uint8_t)(1U<<TMSCS)
#define    TMCIM           4       /* Tx Modulator Transmission Complete Interrupt Mask */
#define    BM_TMCIM	(uint8_t)(1U<<TMCIM)

