camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* TMCR2 - Tx Modulator Control Register 2 */
#define    TMCRCE          0       /* Tx Modulator CRC Enable */
#define    BM_TMCRCE	(uint8_t)(1U<<TMCRCE)
#define    TMCRCSE0        1       /* Tx Modulator CRC Select bit 0 */
#define    BM_TMCRCSE0	(uint8_t)(1U<<TMCRCSE0)
#define    TMCRCSE1        2       /* Tx Modulator CRC Select bit 1 */
#define    BM_TMCRCSE1	(uint8_t)(1U<<TMCRCSE1)
#define    TMNRZE          3       /* Tx Modulator NRZ Mode Enable */
#define    BM_TMNRZE	(uint8_t)(1U<<TMNRZE)
#define    TMPOL           4       /* Tx Modulator Polarity */
#define    BM_TMPOL	(uint8_t)(1U<<TMPOL)
#define    TMSSE           5       /* Tx Modulator Stop Sequence Enable */
#define    BM_TMSSE	(uint8_t)(1U<<TMSSE)
#define    TMLSB           6       /* Tx Modulator Least Significant Bit First */
#define    BM_TMLSB	(uint8_t)(1U<<TMLSB)

/* TMCRCH - Tx Modulator CRC Result, High Byte */
#define    TMCRC8          0       /* Tx Modulator CRC Result bit 8 */
#define    BM_TMCRC8	(uint8_t)(1U<<TMCRC8)
#define    TMCRC9          1       /* Tx Modulator CRC Result bit 9 */
#define    BM_TMCRC9	(uint8_t)(1U<<TMCRC9)
#define    TMCRC10         2       /* Tx Modulator CRC Result bit 10 */
#define    BM_TMCRC10	(uint8_t)(1U<<TMCRC10)
#define    TMCRC11         3       /* Tx Modulator CRC Result bit 11 */
#define    BM_TMCRC11	(uint8_t)(1U<<TMCRC11)
#define    TMCRC12         4       /* Tx Modulator CRC Result bit 12 */
#define    BM_TMCRC12	(uint8_t)(1U<<TMCRC12)
#define    TMCRC13         5       /* Tx Modulator CRC Result bit 13 */
#define    BM_TMCRC13	(uint8_t)(1U<<TMCRC13)
#define    TMCRC14         6       /* Tx Modulator CRC Result bit 14 */
#define    BM_TMCRC14	(uint8_t)(1U<<TMCRC14)
#define    TMCRC15         7       /* Tx Modulator CRC Result bit 15 */
#define    BM_TMCRC15	(uint8_t)(1U<<TMCRC15)

/* TMCRCL - Tx Modulator CRC Result, Low Byte */
#define    TMCRC0          0       /* Tx Modulator CRC Result bit 0 */
#define    BM_TMCRC0	(uint8_t)(1U<<TMCRC0)
#define    TMCRC1          1       /* Tx Modulator CRC Result bit 1 */
#define    BM_TMCRC1	(uint8_t)(1U<<TMCRC1)
#define    TMCRC2          2       /* Tx Modulator CRC Result bit 2 */
#define    BM_TMCRC2	(uint8_t)(1U<<TMCRC2)
#define    TMCRC3          3       /* Tx Modulator CRC Result bit 3 */
#define    BM_TMCRC3	(uint8_t)(1U<<TMCRC3)
#define    TMCRC4          4       /* Tx Modulator CRC Result bit 4 */
#define    BM_TMCRC4	(uint8_t)(1U<<TMCRC4)
#define    TMCRC5          5       /* Tx Modulator CRC Result bit 5 */
#define    BM_TMCRC5	(uint8_t)(1U<<TMCRC5)
#define    TMCRC6          6       /* Tx Modulator CRC Result bit 6 */
#define    BM_TMCRC6	(uint8_t)(1U<<TMCRC6)
#define    TMCRC7          7       /* Tx Modulator CRC Result bit 7 */
#define    BM_TMCRC7	(uint8_t)(1U<<TMCRC7)

/* TMCSB - Tx Modulator CRC Skip Bit Number */
#define    TMCSB0          0       /* Tx Modulator CRC Skip Bit Number bit 0 */
#define    BM_TMCSB0	(uint8_t)(1U<<TMCSB0)
#define    TMCSB1          1       /* Tx Modulator CRC Skip Bit Number bit 1 */
#define    BM_TMCSB1	(uint8_t)(1U<<TMCSB1)
#define    TMCSB2          2       /* Tx Modulator CRC Skip Bit Number bit 2 */
#define    BM_TMCSB2	(uint8_t)(1U<<TMCSB2)
#define    TMCSB3          3       /* Tx Modulator CRC Skip Bit Number bit 3 */
#define    BM_TMCSB3	(uint8_t)(1U<<TMCSB3)
#define    TMCSB4          4       /* Tx Modulator CRC Skip Bit Number bit 4 */
#define    BM_TMCSB4	(uint8_t)(1U<<TMCSB4)
#define    TMCSB5          5       /* Tx Modulator CRC Skip Bit Number bit 5 */
#define    BM_TMCSB5	(uint8_t)(1U<<TMCSB5)
#define    TMCSB6          6       /* Tx Modulator CRC Skip Bit Number bit 6 */
#define    BM_TMCSB6	(uint8_t)(1U<<TMCSB6)
#define    TMCSB7          7       /* Tx Modulator CRC Skip Bit Number bit 7 */
#define    BM_TMCSB7	(uint8_t)(1U<<TMCSB7)

/* TMFSM - Tx Modulator Finite State Machine */
#define    TMSSM0          0       /* Tx Modulator Sub State Machine bit 0 */
#define    BM_TMSSM0	(uint8_t)(1U<<TMSSM0)
#define    TMSSM1          1       /* Tx Modulator Sub State Machine bit 1 */
#define    BM_TMSSM1	(uint8_t)(1U<<TMSSM1)
#define    TMSSM2          2       /* Tx Modulator Sub State Machine bit 2 */
#define    BM_TMSSM2	(uint8_t)(1U<<TMSSM2)
#define    TMSSM3          3       /* Tx Modulator Sub State Machine bit 3 */
#define    BM_TMSSM3	(uint8_t)(1U<<TMSSM3)
#define    TMMSM0          4       /* Tx Modulator Master State Machine bit 0 */
#define    BM_TMMSM0	(uint8_t)(1U<<TMMSM0)
#define    TMMSM1          5       /* Tx Modulator Master State Machine bit 1 */
#define    BM_TMMSM1	(uint8_t)(1U<<TMMSM1)
#define    TMMSM2          6       /* Tx Modulator Master State Machine bit 2 */
#define    BM_TMMSM2	(uint8_t)(1U<<TMMSM2)

/* TMSHR - Tx Modulator Shift Register */
#define    TMSHR0          0       /* Tx Modulator Shift Register bit 0 */
#define    BM_TMSHR0	(uint8_t)(1U<<TMSHR0)
#define    TMSHR1          1       /* Tx Modulator Shift Register bit 1 */
#define    BM_TMSHR1	(uint8_t)(1U<<TMSHR1)
#define    TMSHR2          2       /* Tx Modulator Shift Register bit 2 */
#define    BM_TMSHR2	(uint8_t)(1U<<TMSHR2)
#define    TMSHR3          3       /* Tx Modulator Shift Register bit 3 */
#define    BM_TMSHR3	(uint8_t)(1U<<TMSHR3)
#define    TMSHR4          4       /* Tx Modulator Shift Register bit 4 */
#define    BM_TMSHR4	(uint8_t)(1U<<TMSHR4)
#define    TMSHR5          5       /* Tx Modulator Shift Register bit 5 */
#define    BM_TMSHR5	(uint8_t)(1U<<TMSHR5)
#define    TMSHR6          6       /* Tx Modulator Shift Register bit 6 */
#define    BM_TMSHR6	(uint8_t)(1U<<TMSHR6)
#define    TMSHR7          7       /* Tx Modulator Shift Register bit 7 */
#define    BM_TMSHR7	(uint8_t)(1U<<TMSHR7)

/* TMSR - Tx Modulator Status Register */
#define    TMTCF           0       /* Tx Modulator Transmission Complete Status Flag */
#define    BM_TMTCF	(uint8_t)(1U<<TMTCF)

/* TMSSC - Tx Modulator Stop Sequence Configuration */
#define    TMSSP0          0       /* Tx Modulator Stop Sequence Pattern bit 0 */
#define    BM_TMSSP0	(uint8_t)(1U<<TMSSP0)
#define    TMSSP1          1       /* Tx Modulator Stop Sequence Pattern bit 1 */
#define    BM_TMSSP1	(uint8_t)(1U<<TMSSP1)
#define    TMSSP2          2       /* Tx Modulator Stop Sequence Pattern bit 2 */
#define    BM_TMSSP2	(uint8_t)(1U<<TMSSP2)
#define    TMSSP3          3       /* Tx Modulator Stop Sequence Pattern bit 3 */
#define    BM_TMSSP3	(uint8_t)(1U<<TMSSP3)
#define    TMSSL0          4       /* Tx Modulator Stop Sequence Length bit 0 */
#define    BM_TMSSL0	(uint8_t)(1U<<TMSSL0)
#define    TMSSL1          5       /* Tx Modulator Stop Sequence Length bit 1 */
#define    BM_TMSSL1	(uint8_t)(1U<<TMSSL1)
#define    TMSSL2          6       /* Tx Modulator Stop Sequence Length bit 2 */
#define    BM_TMSSL2	(uint8_t)(1U<<TMSSL2)
#define    TMSSH           7       /* Tx Modulator Stop Sequence Hold Mode */
#define    BM_TMSSH	(uint8_t)(1U<<TMSSH)

/* TMTLH - Tx Modulator Telegram Length Register, High Byte */
#define    TMTL8           0       /* Tx Modulator Telegram Length bit 8 */
#define    BM_TMTL8	(uint8_t)(1U<<TMTL8)
#define    TMTL9           1       /* Tx Modulator Telegram Length bit 9 */
#define    BM_TMTL9	(uint8_t)(1U<<TMTL9)
#define    TMTL10          2       /* Tx Modulator Telegram Length bit 10 */
#define    BM_TMTL10	(uint8_t)(1U<<TMTL10)
#define    TMTL11          3       /* Tx Modulator Telegram Length bit 11 */
#define    BM_TMTL11	(uint8_t)(1U<<TMTL11)

/* TMTLL - Tx Modulator Telegram Length Register, Low Byte */
#define    TMTL0           0       /* Tx Modulator Telegram Length bit 0 */
#define    BM_TMTL0	(uint8_t)(1U<<TMTL0)
#define    TMTL1           1       /* Tx Modulator Telegram Length bit 1 */
#define    BM_TMTL1	(uint8_t)(1U<<TMTL1)
#define    TMTL2           2       /* Tx Modulator Telegram Length bit 2 */
#define    BM_TMTL2	(uint8_t)(1U<<TMTL2)
#define    TMTL3           3       /* Tx Modulator Telegram Length bit 3 */
#define    BM_TMTL3	(uint8_t)(1U<<TMTL3)
#define    TMTL4           4       /* Tx Modulator Telegram Length bit 4 */
#define    BM_TMTL4	(uint8_t)(1U<<TMTL4)
#define    TMTL5           5       /* Tx Modulator Telegram Length bit 5 */
#define    BM_TMTL5	(uint8_t)(1U<<TMTL5)
#define    TMTL6           6       /* Tx Modulator Telegram Length bit 6 */
#define    BM_TMTL6	(uint8_t)(1U<<TMTL6)
#define    TMTL7           7       /* Tx Modulator Telegram Length bit 7 */
#define    BM_TMTL7	(uint8_t)(1U<<TMTL7)



