camellion0/pic32_ata_isp/src/fw_D/P2P22_TXMODE_NXP/firmware/stdc/src/ioATA5700.h
/* ***** LOCKSBITS ******************************************************** */
#define    LB1             0       /* Lock bit */
#define    LB2             1       /* Lock bit */
#define    BLB01           2       /* Boot Lock bit */
#define    BLB02           3       /* Boot Lock bit */
#define    BLB11           4       /* Boot lock bit */
#define    BLB12           5       /* Boot lock bit */


/* ***** FUSES ************************************************************ */
/* LOW fuse bits */



/* ***** CPU REGISTER DEFINITIONS ***************************************** */
#define    XH              r27
#define    XL              r26
#define    YH              r29
#define    YL              r28
#define    ZH              r31
#define    ZL              r30



/* ***** DATA MEMORY DECLARATIONS ***************************************** */
#define    FLASHEND        0xffff  /* Note: Byte address */
#define    IOEND           0x01ff
#define    SRAM_START      0x0200
#define    SRAM_SIZE       1024
#define    RAMEND          0x05ff
#define    XRAMEND         0x0000
#define    E2END           0x08ff
#define    EEPROMEND       0x08ff
#define    EEADRBITS       11



/* ***** BOOTLOADER DECLARATIONS ****************************************** */
#define    NRWW_START_ADDR 0xc00
#define    NRWW_STOP_ADDR  0xfff
#define    RWW_START_ADDR  0x0
#define    RWW_STOP_ADDR   0xbff
#define    PAGESIZE        32
#define    FIRSTBOOTSTART  0x7000
#define    SECONDBOOTSTART 0x6000
#define    THIRDBOOTSTART  0x4000
#define    FOURTHBOOTSTART 0x3800
#define    SMALLBOOTSTART  FIRSTBOOTSTART
#define    LARGEBOOTSTART  FOURTHBOOTSTART

#endif /* ENABLE_BIT_DEFINITIONS */



/* ***** INTERRUPT VECTORS ************************************************ */
#define    RESET_vect      (0x00)  /* External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset */
#define    INT0_vect       (0x04)  /* External Interrupt Request 0 */
#define    INT1_vect       (0x08)  /* External Interrupt Request 1 */
#define    PCINT0_vect     (0x0c)  /* Pin Change Interrupt Request 0 */
#define    PCINT1_vect     (0x10)  /* Pin Change Interrupt Request 1 */
#define    VMON_vect       (0x14)  /* Voltage Monitoring Interrupt */
#define    AVCCR_vect      (0x18)  /* AVCC Reset Interrupt */
#define    AVCCL_vect      (0x1c)  /* AVCC Low Interrupt */
#define    T0INT_vect      (0x20)  /* Timer0 Interval Interrupt */
#define    T1COMP_vect     (0x24)  /* Timer/Counter1 Compare Match Interrupt */
#define    T1OVF_vect      (0x28)  /* Timer/Counter1 Overflow Interrupt */
#define    T2COMP_vect     (0x2c)  /* Timer/Counter2 Compare Match Interrupt */
#define    T2OVF_vect      (0x30)  /* Timer/Counter2 Overflow Interrupt */
#define    T3CAP_vect      (0x34)  /* Timer/Counter3 Capture Event Interrupt */
#define    T3COMP_vect     (0x38)  /* Timer/Counter3 Compare Match Interrupt */
#define    T3OVF_vect      (0x3c)  /* Timer/Counter3 Overflow Interrupt */
#define    T4CAP_vect      (0x40)  /* Timer/Counter4 Capture Event Interrupt */
#define    T4COMP_vect     (0x44)  /* Timer/Counter4 Compare Match Interrupt */
#define    T4OVF_vect      (0x48)  /* Timer/Counter4 Overflow Interrupt */
#define    T5COMP_vect     (0x4c)  /* Timer/Counter5 Compare Match Interrupt */
#define    T5OVF_vect      (0x50)  /* Timer/Counter5 Overflow Interrupt */
#define    SPI_STC_vect    (0x54)  /* SPI Serial Transfer Complete Interrupt */
#define    SRX_FIFO_vect   (0x58)  /* SPI Rx Buffer Interrupt */
#define    STX_FIFO_vect   (0x5c)  /* SPI Tx Buffer Interrupt */
#define    SSM_vect        (0x60)  /* Sequencer State Machine Interrupt */
#define    DFFLR_vect      (0x64)  /* Data FIFO fill level reached Interrupt */
#define    DFOUE_vect      (0x68)  /* Data FIFO overflow or underflow error Interrupt */
#define    SFFLR_vect      (0x6c)  /* RSSI/Preamble FIFO fill level reached Interrupt */
#define    SFOUE_vect      (0x70)  /* RSSI/Preamble FIFO overflow or underflow error Interrupt */
#define    TMTCF_vect      (0x74)  /* Tx Modulator Telegram Finish Interrupt */
#define    AES_vect        (0x78)  /* AES Krypto Unit Interrupt */
#define    TPINT_vect      (0x7c)  /* Transponder Mode Interrupt */
#define    TPTOERR_vect    (0x80)  /* Transponder Timeout Error Interrupt */
#define    LFID0INT_vect   (0x84)  /* LF receiver Identifier 0 Interrupt */
#define    LFID1INT_vect   (0x88)  /* LF receiver Identifier 1 Interrupt */
#define    LFFEINT_vect    (0x8c)  /* LF receiver Frame End Interrupt */
#define    LFBCR_vect      (0x90)  /* LF receiver Bit Count Reached Interrupt */
#define    LFPBD_vect      (0x94)  /* LF receiver PreBurst Detected Interrupt */
#define    LFDE_vect       (0x98)  /* LF receiver Decoder Error Interrupt */
#define    LFEOT_vect      (0x9c)  /* LF receiver End of Telegram Interrupt */
#define    LFTCOR_vect     (0xa0)  /* LF receiver Timer Compare Match Interrupt */
#define    LFRSCO_vect     (0xa4)  /* LF receiver RSSI measurement Interrupt */
#define    PHFFLR_vect     (0xa8)  /* Protocol Handler FIFO Fill Level Reached Interrupt */
#define    PHFOUE_vect     (0xac)  /* Protocol Handler FIFO Overflow or Underflow Error Interrupt */
#define    EXCM_vect       (0xb0)  /* External input Clock monitoring Interrupt */
#define    E2CINT_vect     (0xb4)  /* EEPROM Error Correction Interrupt */
#define    ERDY_vect       (0xb8)  /* EEPROM Ready Interrupt */
#define    SPM_RDY_vect    (0xbc)  /* Store Program Memory Ready */
#define    TWI_vect        (0xc0)  /* TWI Interrupt */



#endif /* __IOATA5700_H (define part) */

#pragma language=default

#endif  /* __IOATA5700_H (SFR part)*/

/* ***** END OF FILE ****************************************************** */
#endif /* IOATA5700_H_OVERALL */
